[
  {"id":"17","accessed":{"date-parts":[[2019,10,14]]},"citation-key":"17","DOI":"10.1088/1741-2552/aa5eea","issued":{"date-parts":[[2017]]},"title":"Open Ephys: an open-source, plugin-based platform for multichannel electrophysiology Related content","type":"article-journal","URL":"https://doi.org/10.1088/1741-2552/aa5eea"},
  {"id":"adesnik21","abstract":"Optogenetics ushered in a revolution in how neuroscientists interrogate brain function. Because of technical limitations, the majority of optogenetic studies have used low spatial resolution activation schemes that limit the types of perturbations that can be made. However, neural activity manipulations at finer spatial scales are likely to be important to more fully understand neural computation. Spatially precise multiphoton holographic optogenetics promises to address this challenge and opens up many new classes of experiments that were not previously possible. More specifically, by offering the ability to recreate extremely specific neural activity patterns in both space and time in functionally defined ensembles of neurons, multiphoton holographic optogenetics could allow neuroscientists to reveal fundamental aspects of the neural codes for sensation, cognition and behavior that have been beyond reach. This Review summarizes recent advances in multiphoton holographic optogenetics that substantially expand its capabilities, highlights outstanding technical challenges and provides an overview of the classes of experiments it can execute to test and validate key theoretical models of brain function. Multiphoton holographic optogenetics could substantially accelerate the pace of neuroscience discovery by helping to close the loop between experimental and theoretical neuroscience, leading to fundamental new insights into nervous system function and disorder.","accessed":{"date-parts":[[2022,9,7]]},"author":[{"family":"Adesnik","given":"Hillel"},{"family":"Abdeladim","given":"Lamiae"}],"citation-key":"adesnik21","container-title":"Nature Neuroscience","container-title-short":"Nat Neurosci","DOI":"10.1038/s41593-021-00902-9","ISSN":"1546-1726","issue":"10","issued":{"date-parts":[[2021,10]]},"language":"en","license":"2021 Springer Nature America, Inc.","number":"10","page":"1356-1366","publisher":"Nature Publishing Group","source":"www.nature.com","title":"Probing neural codes with two-photon holographic optogenetics","type":"article-journal","URL":"https://www.nature.com/articles/s41593-021-00902-9","volume":"24"},
  {"id":"akar19","abstract":"We introduce Arbor, a performance portable library for simulation of large networks of multi-compartment neurons on HPC systems. Arbor is open source software, developed under the auspices of the HBP. The performance portability is by virtue of back-end specific optimizations for x86 multicore, Intel KNL, and NVIDIA GPUs. When coupled with low memory overheads, these optimizations make Arbor an order of magnitude faster than the most widely-used comparable simulation software. The single-node performance can be scaled out to run very large models at extreme scale with efficient weak scaling.","accessed":{"date-parts":[[2022,8,25]]},"author":[{"family":"Akar","given":"Nora Abi"},{"family":"Cumming","given":"Ben"},{"family":"Karakasis","given":"Vasileios"},{"family":"Küsters","given":"Anne"},{"family":"Klijn","given":"Wouter"},{"family":"Peyser","given":"Alexander"},{"family":"Yates","given":"Stuart"}],"citation-key":"akar19","container-title":"Proceedings - 27th Euromicro International Conference on Parallel, Distributed and Network-Based Processing, PDP 2019","DOI":"10.1109/EMPDP.2019.8671560","ISBN":"978-1-72811-644-0","issued":{"date-parts":[[2019,3,19]]},"page":"274-282","publisher":"Institute of Electrical and Electronics Engineers Inc.","title":"Arbor - A Morphologically-Detailed Neural Network Simulation Library for Contemporary High-Performance Computing Architectures","type":"paper-conference"},
  {"id":"antolik13","abstract":"The increasing availability of computational resources is enabling more detailed, realistic modeling in computational neuroscience, resulting in a shift toward more heterogeneous models of neuronal circuits, and employment of complex experimental protocols. This poses a challenge for existing tool chains, as the set of tools involved in a typical modeler’s workflow is expanding concomitantly, with growing complexity in the metadata flowing between them. For many parts of the workflow, a range of tools is available; however, numerous areas lack dedicated tools, while integration of existing tools is limited. This forces modelers to either handle the workflow manually, leading to errors, or to write substantial amounts of code to automate parts of the workflow, in both cases reducing their productivity. To address these issues, we have developed Mozaik: a workflow system for spiking neuronal network simulations written in Python. Mozaik integrates model, experiment and stimulation specification, simulation execution, data storage, data analysis and visualization into a single automated workflow, ensuring that all relevant metadata are available to all workflow components. It is based on several existing tools, including PyNN, Neo, and Matplotlib. It offers a declarative way to specify models and recording configurations using hierarchically organized configuration files. Mozaik automatically records all data together with all relevant metadata about the experimental context, allowing automation of the analysis and visualization stages. Mozaik has a modular architecture, and the existing modules are designed to be extensible with minimal programming effort. Mozaik increases the productivity of running virtual experiments on highly structured neuronal networks by automating the entire experimental cycle, while increasing the reliability of modeling studies by relieving the user from manual handling of the flow of metadata between the individual workflow stages.","accessed":{"date-parts":[[2022,3,30]]},"author":[{"family":"Antolík","given":"Ján"},{"family":"Davison","given":"Andrew P."}],"citation-key":"antolik13","container-title":"Frontiers in Neuroinformatics","DOI":"10.3389/fninf.2013.00034","ISSN":"16625196","issued":{"date-parts":[[2013,12,1]]},"page":"34","publisher":"Frontiers Media S.A.","title":"Integrated workflows for spiking neuronal network simulations","type":"article-journal","volume":"7"},
  {"id":"antolik21","abstract":"The neural encoding of visual features in primary visual cortex (V1) is well understood, with strong correlates to low-level perception, making V1 a strong candidate for vision restoration through neuroprosthetics. However, the functional relevance of neural dynamics evoked through external stimulation directly imposed at the cortical level is poorly understood. Furthermore, protocols for designing cortical stimulation patterns that would induce a naturalistic perception of the encoded stimuli have not yet been established. Here, we demonstrate a proof of concept by solving these issues through a computational model, combining (1) a large-scale spiking neural network model of cat V1 and (2) a virtual prosthetic system transcoding the visual input into tailored light-stimulation patterns which drive in situ the optogenetically modified cortical tissue. Using such virtual experiments, we design a protocol for translating simple Fourier contrasted stimuli (gratings) into activation patterns of the optogenetic matrix stimulator. We then quantify the relationship between spatial configuration of the imposed light pattern and the induced cortical activity. Our simulations in the absence of visual drive (simulated blindness) show that optogenetic stimulation with a spatial resolution as low as 100 μ m, and light intensity as weak as 10 16 photons/s/cm2 is sufficient to evoke activity patterns in V1 close to those evoked by normal vision.","accessed":{"date-parts":[[2022,3,30]]},"author":[{"family":"Antolik","given":"Jan"},{"family":"Sabatier","given":"Quentin"},{"family":"Galle","given":"Charlie"},{"family":"Frégnac","given":"Yves"},{"family":"Benosman","given":"Ryad"}],"citation-key":"antolik21","container-title":"Scientific Reports","DOI":"10.1038/s41598-021-88960-8","ISBN":"0123456789","ISSN":"20452322","issue":"1","issued":{"date-parts":[[2021,5,24]]},"page":"1-18","PMID":"34031442","publisher":"Nature Publishing Group","title":"Assessment of optogenetically-driven strategies for prosthetic restoration of cortical vision in large-scale neural simulation of V1","type":"article-journal","URL":"https://www.nature.com/articles/s41598-021-88960-8","volume":"11"},
  {"id":"appukuttan22","accessed":{"date-parts":[[2022,5,5]]},"author":[{"family":"Appukuttan","given":"Shailesh"},{"family":"Sharma","given":"Lungsi"},{"family":"Garcia-Rodriguez","given":"Pedro"},{"family":"Davison","given":"Andrew"},{"family":"Davison","given":"Andrew P"}],"citation-key":"appukuttan22","issued":{"date-parts":[[2022]]},"title":"A Software Framework for Validating Neuroscience Models A Software Frame-work for Validating Neuroscience Models A Software Framework for Validating Neuroscience Models","type":"article-journal","URL":"https://hal.archives-ouvertes.fr/hal-03586825"},
  {"id":"arenkiel07","abstract":"Channelrhodopsin-2 (ChR2) is a light-gated, cation-selective ion channel isolated from the green algae Chlamydomonas reinhardtii. Here, we report the generation of transgenic mice that express a ChR2-YFP fusion protein in the CNS for in vivo activation and mapping of neural circuits. Using focal illumination of the cerebral cortex and olfactory bulb, we demonstrate a highly reproducible, light-dependent activation of neurons and precise control of firing frequency in vivo. To test the feasibility of mapping neural circuits, we exploited the circuitry formed between the olfactory bulb and the piriform cortex in anesthetized mice. In the olfactory bulb, individual mitral cells fired action potentials in response to light, and their firing rate was not influenced by costimulated glomeruli. However, in piriform cortex, the activity of target neurons increased as larger areas of the bulb were illuminated to recruit additional glomeruli. These results support a model of olfactory processing that is dependent upon mitral cell convergence and integration onto cortical cells. More broadly, these findings demonstrate a system for precise manipulation of neural activity in the intact mammalian brain with light and illustrate the use of ChR2 mice in exploring functional connectivity of complex neural circuits in vivo. © 2007 Elsevier Inc. All rights reserved.","accessed":{"date-parts":[[2021,6,1]]},"author":[{"family":"Arenkiel","given":"Benjamin R."},{"family":"Peca","given":"Joao"},{"family":"Davison","given":"Ian G."},{"family":"Feliciano","given":"Catia"},{"family":"Deisseroth","given":"Karl"},{"family":"Augustine","given":"George J J."},{"family":"Ehlers","given":"Michael D."},{"family":"Feng","given":"Guoping"}],"citation-key":"arenkiel07","container-title":"Neuron","DOI":"10.1016/j.neuron.2007.03.005","ISSN":"08966273","issue":"2","issued":{"date-parts":[[2007,4,19]]},"page":"205-218","PMID":"17442243","publisher":"Cell Press","title":"In Vivo Light-Induced Activation of Neural Circuitry in Transgenic Mice Expressing Channelrhodopsin-2","type":"article-journal","volume":"54"},
  {"id":"aru15","abstract":"Cross-frequency coupling (CFC) has been proposed to coordinate neural dynamics across spatial and temporal scales. Despite its potential relevance for understanding healthy and pathological brain function, the standard CFC analysis and physiological interpretation come with fundamental problems. For example, apparent CFC can appear because of spectral correlations due to common non-stationarities that may arise in the total absence of interactions between neural frequency components. To provide a road map towards an improved mechanistic understanding of CFC, we organize the available and potential novel statistical/modeling approaches according to their biophysical interpretability. While we do not provide solutions for all the problems described, we provide a list of practical recommendations to avoid common errors and to enhance the interpretability of CFC analysis.","accessed":{"date-parts":[[2022,3,21]]},"author":[{"family":"Aru","given":"Juhan"},{"family":"Aru","given":"Jaan"},{"family":"Priesemann","given":"Viola"},{"family":"Wibral","given":"Michael"},{"family":"Lana","given":"Luiz"},{"family":"Pipa","given":"Gordon"},{"family":"Singer","given":"Wolf"},{"family":"Vicente","given":"Raul"}],"citation-key":"aru15","container-title":"Current Opinion in Neurobiology","DOI":"10.1016/j.conb.2014.08.002","ISSN":"18736882","issued":{"date-parts":[[2015,4,1]]},"page":"51-61","PMID":"25212583","publisher":"Elsevier Current Trends","title":"Untangling cross-frequency coupling in neuroscience","type":"article-journal","volume":"31"},
  {"id":"avitan22","abstract":"Sensory areas are spontaneously active in the absence of sensory stimuli. This spontaneous activity has long been studied; however, its functional role remains largely unknown. Recent advances in technology, allowing large-scale neural recordings in the awake and behaving animal, have transformed our understanding of spontaneous activity. Studies using these recordings have discovered high-dimensional spontaneous activity patterns, correlation between spontaneous activity and behavior, and dissimilarity between spontaneous and sensory-driven activity patterns. These findings are supported by evidence from developing animals, where a transition toward these characteristics is observed as the circuit matures, as well as by evidence from mature animals across species. These newly revealed characteristics call for the formulation of a new role for spontaneous activity in neural sensory computation.","accessed":{"date-parts":[[2022,9,7]]},"author":[{"family":"Avitan","given":"Lilach"},{"family":"Stringer","given":"Carsen"}],"citation-key":"avitan22","container-title":"Neuron","container-title-short":"Neuron","DOI":"10.1016/j.neuron.2022.06.019","ISSN":"0896-6273","issued":{"date-parts":[[2022,7,20]]},"language":"en","source":"ScienceDirect","title":"Not so spontaneous: Multi-dimensional representations of behaviors and context in sensory areas","title-short":"Not so spontaneous","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S0896627322005888"},
  {"id":"bansal20","abstract":"Low-power and high-frequency bidirectional control of spatiotemporal patterns of neural spiking is one of the major challenges in optogenetics. A detailed theoretical analysis and optimization with ChR2-NpHR, ChR2(H134R)-eNpHR3.0, Chrimson-GtACR2 and also with prospective opsin pairs namely, Chronos-Jaws, Chronos-eNpHR3.0, CheRiff-Jaws and vf-Chrimson-GtACR2 has been presented. Biophysical circuit models of bidirectional optogenetic control in above opsin pairs expressing hippocampal neurons and fast-spiking neocortical interneurons have been formulated. The models include the important rebound effect of chloride ions and overlapping of absorption spectra. Blue light absorption by red-shifted opsins not only affects the photocurrent, but also its turn-off kinetics. Under continuous illumination, bidirectional control of spiking around 40 Hz in hippocampal neurons requires very low blue and orange light intensities of 0.014 mW/mm2 and 0.8 mW/mm2 with CheRiff-Jaws and 0.04 mW/mm2, and 0.02 mW/mm2 with Chrimson-GtACR2, respectively. Under optimal photostimulation and expression density, high-frequency limit of bidirectional control is 60 Hz and 100 Hz with ChR2-NpHR, 60 Hz and 20 Hz with ChR2(H134R)-eNpHR3.0, 90 Hz and 180 Hz with Chronos-Jaws, and 90 Hz and 250 Hz with Chronos-eNpHR3.0 in neurons and interneurons, respectively. Although, Chrimson-GtACR2 enables bidirectional control at very low-power, vf-Chrimson-GtACR2 provides control with reduced cross-talk. The theoretical analysis highlights the usefulness of computational methods to virtually optimize stimulation protocols for optogenetic tool combinations. The study is useful to generate neural codes with desired spatiotemporal resolution and to design optogenetic neuroprosthetic devices and circuits.","accessed":{"date-parts":[[2022,3,15]]},"author":[{"family":"Bansal","given":"Himanshu"},{"family":"Gupta","given":"Neha"},{"family":"Roy","given":"Sukhdev"}],"citation-key":"bansal20","container-title":"Neuroscience","DOI":"10.1016/j.neuroscience.2020.09.022","ISSN":"18737544","issued":{"date-parts":[[2020,11,21]]},"page":"165-188","PMID":"32941934","publisher":"Pergamon","title":"Theoretical Analysis of Low-power Bidirectional Optogenetic Control of High-frequency Neural Codes with Single Spike Resolution","type":"article-journal","volume":"449"},
  {"id":"bansal20b","abstract":"A detailed theoretical analysis of low-power, high-frequency and temporally precise optogenetic inhibition of neuronal spiking, with red-shifted opsins namely, NpHR, eNpHR3.0 and Jaws, has been presented. An accurate model for inhibition of spiking in these opsins expressed hippocampal neurons that includes the important rebound activity of chloride ions across the membrane has been formulated. The effect of various parameters including irradiance, pulse width, frequency, opsin-expression density and chloride concentration has been studied in detail. Theoretical simulations are in very good agreement with reported experimental results. The chloride concentration gradient directly affects the photocurrent and inhibition capacity in all three variants. eNpHR3.0 shows smallest inhibitory post-synaptic potential plateau at higher frequencies. The time delay between light stimulus and target spike is crucial to minimize irradiance and expression density thresholds for suppressing individual spike. Good practical values of photostimulation parameters have been obtained empirically for peak photocurrent, time delay and 100% spiking inhibition, at continuous and pulsed illumination. Under continuous illumination, complete inhibition of neural activity in Jaws-expressing neurons takes place at minimum irradiance of 0.2 mW mm-2 and expression density of 0.2 mS cm-2, whereas for pulsed stimulation, it is at minimum irradiance of 0.6 mW mm-2 and 5 ms pulse width, at 10 Hz. It is shown that Jaws and eNpHR3.0 are able to invoke single spike precise inhibition up to 160 and 200 Hz, respectively. The study is useful in designing new experiments, understanding temporal spike coding and bidirectional control, and curing neurological disorders.","accessed":{"date-parts":[[2022,3,16]]},"author":[{"family":"Bansal","given":"Himanshu"},{"family":"Gupta","given":"Neha"},{"family":"Roy","given":"Sukhdev"}],"citation-key":"bansal20b","container-title":"Biomedical Physics and Engineering Express","DOI":"10.1088/2057-1976/ab90a1","ISSN":"20571976","issue":"4","issued":{"date-parts":[[2020,5,18]]},"page":"045011","PMID":"33444272","publisher":"IOP Publishing","title":"Comparison of low-power, high-frequency and temporally precise optogenetic inhibition of spiking in NpHR, eNpHR3.0 and Jaws-expressing neurons","type":"article-journal","URL":"https://iopscience.iop.org/article/10.1088/2057-1976/ab90a1","volume":"6"},
  {"id":"bansal20c","abstract":"A detailed theoretical analysis of low-power, high-frequency and temporally precise optogenetic inhibition of neuronal spiking, with red-shifted opsins namely, NpHR, eNpHR3.0 and Jaws, has been presented. An accurate model for inhibition of spiking in these opsins expressed hippocampal neurons that includes the important rebound activity of chloride ions across the membrane has been formulated. The effect of various parameters including irradiance, pulse width, frequency, opsin-expression density and chloride concentration has been studied in detail. Theoretical simulations are in very good agreement with reported experimental results. The chloride concentration gradient directly affects the photocurrent and inhibition capacity in all three variants. eNpHR3.0 shows smallest inhibitory post-synaptic potential plateau at higher frequencies. The time delay between light stimulus and target spike is crucial to minimize irradiance and expression density thresholds for suppressing individual spike. Good practical values of photostimulation parameters have been obtained empirically for peak photocurrent, time delay and 100% spiking inhibition, at continuous and pulsed illumination. Under continuous illumination, complete inhibition of neural activity in Jaws-expressing neurons takes place at minimum irradiance of 0.2 mW mm-2 and expression density of 0.2 mS cm-2, whereas for pulsed stimulation, it is at minimum irradiance of 0.6 mW mm-2 and 5 ms pulse width, at 10 Hz. It is shown that Jaws and eNpHR3.0 are able to invoke single spike precise inhibition up to 160 and 200 Hz, respectively. The study is useful in designing new experiments, understanding temporal spike coding and bidirectional control, and curing neurological disorders.","accessed":{"date-parts":[[2022,3,14]]},"author":[{"family":"Bansal","given":"Himanshu"},{"family":"Gupta","given":"Neha"},{"family":"Roy","given":"Sukhdev"}],"citation-key":"bansal20c","container-title":"Biomedical Physics and Engineering Express","DOI":"10.1088/2057-1976/ab90a1","ISSN":"20571976","issue":"4","issued":{"date-parts":[[2020]]},"PMID":"33444272","title":"Comparison of low-power, high-frequency and temporally precise optogenetic inhibition of spiking in NpHR, eNpHR3.0 and Jaws-expressing neurons","type":"article-journal","URL":"https://doi.org/10.1088/2057-1976/ab90a1","volume":"6"},
  {"id":"bansal21a","abstract":"Objective. Optogenetics has emerged as a promising technique for neural prosthetics, especially retinal prostheses, with unprecedented spatiotemporal resolution. Newly discovered opsins with high light sensitivity and fast temporal kinetics can provide sufficient temporal resolution at safe light powers and overcome the limitations of presently used opsins. It is also important to formulate accurate mathematical models for optogenetic retinal prostheses, which can facilitate optimization of photostimulation factors to improve the performance. Approach. A detailed theoretical analysis of optogenetic excitation of model retinal ganglion neurons (RGNs) and hippocampal neurons expressed with already tested opsins for retinal prostheses, namely, ChR2, ReaChR and ChrimsonR, and also with recently discovered potent opsins CsChrimson, bReaChES and ChRmine, was carried out. Main results. Under continuous illumination, ChRmine-expressing RGNs begin to respond at very low irradiances ∼10-4 mW mm-2, and evoke firing upto ∼280 Hz, highest among other opsin-expressing RGNs, at 10-2 mW mm-2. Under pulsed illumination at randomized photon fluxes, ChRmine-expressing RGNs respond to changes in pulse to pulse irradiances upto four logs, although very bright pulses >1014 photons mm-2 s-1 block firing in these neurons. The minimum irradiance threshold for ChRmine-expressing RGNs is lower by two orders of magnitude, whereas, the first spike latency in ChRmine-expressing RGNs is shorter by an order of magnitude, alongwith stable latency of subsequest spikes compared to others. Further, a good set of photostimulation parameters were determined to achieve high-frequency control with single spike resolution at minimal power. Although ChrimsonR enables spiking upto 100 Hz in RGNs, it requires very high irradiances. ChRmine provides control at light powers that are two orders of magnitude smaller than that required with experimentally studied opsins, while maintaining single spike temporal resolution upto 40 Hz. Significance. The present study highlights the importance of ChRmine as a potential opsin for optogenetic retinal prostheses.","accessed":{"date-parts":[[2022,3,14]]},"author":[{"family":"Bansal","given":"Himanshu"},{"family":"Gupta","given":"Neha"},{"family":"Roy","given":"Sukhdev"}],"citation-key":"bansal21a","container-title":"Journal of Neural Engineering","DOI":"10.1088/1741-2552/ac1175","ISSN":"17412552","issue":"4","issued":{"date-parts":[[2021,7,26]]},"page":"0460b8","PMID":"34229315","publisher":"IOP Publishing","title":"Theoretical analysis of optogenetic spiking with ChRmine, bReaChES and CsChrimson-expressing neurons for retinal prostheses","type":"article-journal","URL":"https://iopscience.iop.org/article/10.1088/1741-2552/ac1175","volume":"18"},
  {"id":"bedard12","author":[{"family":"Bédard","given":"Claude"},{"family":"Destexhe","given":"Alain"}],"citation-key":"bedard12","container-title":"Handbook of Neural Measurement","issued":{"date-parts":[[2012]]},"page":"136-191","title":"Local field potentials","type":"chapter","URL":"http://ebookcentral.proquest.com/lib/gatech/detail.action?docID=989075."},
  {"id":"berman14","abstract":"A frequent assumption in behavioural science is that most of an animal's activities can be described in terms of a small set of stereotyped motifs. Here, we introduce a method for mapping an animal's actions, relying only upon the underlying structure of postural movement data to organize and classify behaviours. Applying this method to the ground-based behaviour of the fruit fly, Drosophila melanogaster, we find that flies perform stereotyped actions roughly 50% of the time, discovering over 100 distinguishable, stereotyped behavioural states. These include multiple modes of locomotion and grooming. We use the resulting measurements as the basis for identifying subtle sex-specific behavioural differences and revealing the low-dimensional nature of animal motions.","accessed":{"date-parts":[[2022,9,7]]},"author":[{"family":"Berman","given":"Gordon J."},{"family":"Choi","given":"Daniel M."},{"family":"Bialek","given":"William"},{"family":"Shaevitz","given":"Joshua W."}],"citation-key":"berman14","container-title":"Journal of The Royal Society Interface","DOI":"10.1098/rsif.2014.0672","issue":"99","issued":{"date-parts":[[2014,10,6]]},"page":"20140672","publisher":"Royal Society","source":"royalsocietypublishing.org (Atypon)","title":"Mapping the stereotyped behaviour of freely moving fruit flies","type":"article-journal","URL":"https://royalsocietypublishing.org/doi/full/10.1098/rsif.2014.0672","volume":"11"},
  {"id":"berndt16","abstract":"The structure-guided design of chloride-conducting channelrhodopsins has illuminated mechanisms underlying ion selectivity of this remarkable family of light-activated ion channels. The first generation of chloride-conducting channelrhodopsins, guided in part by development of a structure-informed electrostatic model for pore selectivity, included both the introduction of amino acids with positively charged side chains into the ion conduction pathway and the removal of residues hypothesized to support negatively charged binding sites for cations. Engineered channels indeed became chloride selective, reversing near -65 mV and enabling a new kind of optogenetic inhibition; however, these first-generation chloride-conducting channels displayed small photocurrents and were not tested for optogenetic inhibition of behavior. Here we report the validation and further development of the channelrhodopsin pore model via crystal structure-guided engineering of next-generation light-activated chloride channels (iC++) and a bistable variant (SwiChR++) with net photocurrents increased more than 15-fold under physiological conditions, reversal potential further decreased by another ~15 mV, inhibition of spiking faithfully tracking chloride gradients and intrinsic cell properties, strong expression in vivo, and the initial microbial opsin channel-inhibitor-based control of freely moving behavior. We further show that inhibition by light-gated chloride channels is mediated mainly by shunting effects, which exert optogenetic control much more efficiently than the hyperpolarization induced by light-activated chloride pumps. The design and functional features of these next-generation chloride-conducting channelrhodopsins provide both chronic and acute timescale tools for reversible optogenetic inhibition, confirm fundamental predictions of the ion selectivity model, and further elucidate electrostatic and steric structure- function relationships of the light-gated pore.","accessed":{"date-parts":[[2022,3,15]]},"author":[{"family":"Berndt","given":"Andre"},{"family":"Lee","given":"Soo Yeun"},{"family":"Wietek","given":"Jonas"},{"family":"Ramakrishnan","given":"Charu"},{"family":"Steinberg","given":"Elizabeth E."},{"family":"Rashid","given":"Asim J."},{"family":"Kim","given":"Hoseok"},{"family":"Park","given":"Sungmo"},{"family":"Santoro","given":"Adam"},{"family":"Frankland","given":"Paul W."},{"family":"Iyer","given":"Shrivats M."},{"family":"Pak","given":"Sally"},{"family":"Ährlund-Richter","given":"Sofie"},{"family":"Delp","given":"Scott L."},{"family":"Malenka","given":"Robert C."},{"family":"Josselyn","given":"Sheena A."},{"family":"Carlén","given":"Marie"},{"family":"Hegemann","given":"Peter"},{"family":"Deisseroth","given":"Karl"}],"citation-key":"berndt16","container-title":"Proceedings of the National Academy of Sciences of the United States of America","DOI":"10.1073/pnas.1523341113","ISSN":"10916490","issue":"4","issued":{"date-parts":[[2016,1,26]]},"page":"822-829","PMID":"26699459","publisher":"National Academy of Sciences","title":"Structural foundations of optogenetics: Determinants of channelrhodopsin ion selectivity","type":"article-journal","volume":"113"},
  {"id":"bettencourt08","abstract":"In the dynamic clamp technique, a typically nonlinear feedback system delivers electrical current to an excitable cell that represents the actions of \"virtual\" ion channels (e.g., channels that are gated by local membrane potential or by electrical activity in neighboring biological or virtual neurons). Since the conception of this technique, there have been a number of different implementations of dynamic clamp systems, each with differing levels of flexibility and performance. Embedded hardware-based systems typically offer feedback that is very fast and precisely timed, but these systems are often expensive and sometimes inflexible. PC-based systems, on the other hand, allow the user to write software that defines an arbitrarily complex feedback system, but real-time performance in PC-based systems can be deteriorated by imperfect real-time performance. Here, we systematically evaluate the performance requirements for artificial dynamic clamp knock-in of transient sodium and delayed rectifier potassium conductances. Specifically, we examine the effects of controller time step duration, differential equation integration method, jitter (variability in time step), and latency (the time lag from reading inputs to updating outputs). Each of these control system flaws is artificially introduced in both simulated and real dynamic clamp experiments. We demonstrate that each of these errors affect dynamic clamp accuracy in a way that depends on the time constants and stiffness of the differential equations being solved. In simulations, time steps above 0.2 ms lead to catastrophic alteration of spike shape, but the frequency-current relationship is much more robust. Latency (the part of the time step that occurs between measuring membrane potential and injecting re-calculated membrane current) is a crucial factor as well. Experimental data are substantially more sensitive to inaccuracies than simulated data. © 2007 Elsevier B.V. All rights reserved.","accessed":{"date-parts":[[2022,4,13]]},"author":[{"family":"Bettencourt","given":"Jonathan C."},{"family":"Lillis","given":"Kyle P."},{"family":"Stupin","given":"Laura R."},{"family":"White","given":"John A."}],"citation-key":"bettencourt08","container-title":"Journal of Neuroscience Methods","DOI":"10.1016/j.jneumeth.2007.10.009","ISSN":"01650270","issue":"2","issued":{"date-parts":[[2008,4,30]]},"page":"282-289","PMID":"18076999","publisher":"Elsevier","title":"Effects of imperfect dynamic clamp: Computational and experimental results","type":"article-journal","volume":"169"},
  {"id":"bogdanchikov13","abstract":"Today we have a lot of programming languages that can realize our needs, but the most important question is how to teach programming to beginner students. In this paper we suggest using Python for this purpose, because it is a programming language that has neatly organized syntax and powerful tools to solve any task. Moreover it is very close to simple math thinking. Python is chosen as a primary programming language for freshmen in most of leading universities. Writing code in python is easy. In this paper we give some examples of program codes written in Java, C++ and Python language, and we make a comparison between them. Firstly, this paper proposes advantages of Python language in relation to C++ and JAVA. Then it shows the results of a comparison of short program codes written in three different languages, followed by a discussion on how students understand programming. Finally experimental results of students' success in programming courses are shown. © IOP Publishing Ltd 2013.","accessed":{"date-parts":[[2022,6,1]]},"author":[{"family":"Bogdanchikov","given":"A."},{"family":"Zhaparov","given":"M."},{"family":"Suliyev","given":"R."}],"citation-key":"bogdanchikov13","container-title":"Journal of Physics: Conference Series","DOI":"10.1088/1742-6596/423/1/012027","ISSN":"17426596","issue":"1","issued":{"date-parts":[[2013,4,10]]},"page":"012027","publisher":"IOP Publishing","title":"Python to learn programming","type":"paper-conference","URL":"https://iopscience.iop.org/article/10.1088/1742-6596/423/1/012027","volume":"423"},
  {"id":"bolus18","author":[{"family":"Bolus","given":"M F"},{"family":"Willats","given":"A A"},{"family":"Whitmire","given":"C J"},{"family":"Rozell","given":"C J"},{"family":"Stanley","given":"G B"}],"citation-key":"bolus18","container-title":"Journal of Neural Engineering","DOI":"10.1088/1741-2552/aaa506","ISSN":"1741-2560","issue":"2","issued":{"date-parts":[[2018,4,1]]},"page":"026011","title":"Design strategies for dynamic closed-loop optogenetic neurocontrol in vivo","type":"article-journal","URL":"http://stacks.iop.org/1741-2552/15/i=2/a=026011?key=crossref.675a1fafcd9598af059326f67782e979","volume":"15"},
  {"id":"bolus21","abstract":"Objective. The rapid acceleration of tools for recording neuronal populations and targeted optogenetic manipulation has enabled real-time, feedback control of neuronal circuits in the brain. Continuously-graded control of measured neuronal activity poses a wide range of technical challenges, which we address through a combination of optogenetic stimulation and a state-space optimal control framework implemented in the thalamocortical circuit of the awake mouse. Approach. Closed-loop optogenetic control of neurons was performed in real-time via stimulation of channelrhodopsin-2 expressed in the somatosensory thalamus of the head-fixed mouse. A state-space linear dynamical system model structure was used to approximate the light-to-spiking input-output relationship in both single-neuron as well as multi-neuron scenarios when recording from multielectrode arrays. These models were utilized to design state feedback controller gains by way of linear quadratic optimal control and were also used online for estimation of state feedback, where a parameter-adaptive Kalman filter provided robustness to model-mismatch. Main results. This model-based control scheme proved effective for feedback control of single-neuron firing rate in the thalamus of awake animals. Notably, the graded optical actuation utilized here did not synchronize simultaneously recorded neurons, State-space optogenetic control 2 but heterogeneity across the neuronal population resulted in a varied response to stimulation. Simulated multi-output feedback control provided better control of a heterogeneous population and demonstrated how the approach generalizes beyond single-neuron applications. Significance. To our knowledge, this work represents the first experimental application of state space model-based feedback control for optogenetic stimulation. In combination with linear quadratic optimal control, the approaches laid out and tested here generalize to the multi-input/multi-output control problems necessitated by highly complex neural circuits. More generally, feedback control of neuronal circuits opens the door to adaptively interacting with the dynamics underlying sensory, motor, and cognitive signaling, enabling a deeper understanding of circuit function and ultimately the control of function in the face of injury or disease.","accessed":{"date-parts":[[2020,8,13]]},"author":[{"family":"Bolus","given":"M F"},{"family":"Willats","given":"A A"},{"family":"Rozell","given":"C J"},{"family":"Stanley","given":"G B"}],"citation-key":"bolus21","container-title":"Journal of neural engineering","DOI":"10.1101/2020.06.25.171785","issue":"3","issued":{"date-parts":[[2021,6,29]]},"page":"036006-undefined","publisher":"Cold Spring Harbor Laboratory","title":"State-space optimal feedback control of optogenetically driven neural activity","type":"article-journal","URL":"https://doi.org/10.1101/2020.06.25.171785","volume":"18"},
  {"id":"buffalo11","abstract":"Attention to a stimulus enhances both neuronal responses and gamma frequency synchrony in visual area V4, both ofwhich should increase the impact of attended information on downstream neurons. To determine whether gamma synchrony is common throughout the ventral stream, we recorded from neurons in the superficial and deep layers of V1, V2, and V4 in two rhesusmonkeys.We found an unexpected striking difference in gamma synchrony in the superficial vs. deep layers. In all three areas, spike-field coherence in the gamma (40-60 Hz) frequency range was largely confined to the superficial layers,whereas the deep layers showedmaximal coherence at low frequencies (6-16 Hz), which included the alpha range. In the superficial layers of V2 and V4, gamma synchrony was enhanced by attention, whereas in the deep layers, alpha synchrony was reduced by attention. Unlike these major differences in synchrony, attentional effects on firing rates and noise correlation did not differ substantially between the superficial and deep layers. The results suggest that synchrony plays very different roles in feedback and feedforward projections.","accessed":{"date-parts":[[2022,3,21]]},"author":[{"family":"Buffalo","given":"Elizabeth A."},{"family":"Fries","given":"Pascal"},{"family":"Landman","given":"Rogier"},{"family":"Buschman","given":"Timothy J."},{"family":"Desimone","given":"Robert"}],"citation-key":"buffalo11","container-title":"Proceedings of the National Academy of Sciences of the United States of America","DOI":"10.1073/pnas.1011284108","ISSN":"00278424","issue":"27","issued":{"date-parts":[[2011,7,5]]},"page":"11262-11267","PMID":"21690410","title":"Laminar differences in gamma and alpha coherence in the ventral stream","type":"article-journal","volume":"108"},
  {"id":"buschman12","abstract":"Intelligent behavior requires acquiring and following rules. Rules define how our behavior should fit different situations. To understand its neural mechanisms, we simultaneously recorded from multiple electrodes in dorsolateral prefrontal cortex (PFC) while monkeys switched between two rules (respond to color versus orientation). We found evidence that oscillatory synchronization of local field potentials (LFPs) formed neural ensembles representing the rules: there were rule-specific increases in synchrony at \" beta\" (19-40 Hz) frequencies between electrodes. In addition, individual PFC neurons synchronized to the LFP ensemble corresponding to the current rule (color versus orientation). Furthermore, the ensemble encoding the behaviorally dominant orientation rule showed increased \" alpha\" (6-16 Hz) synchrony when preparing to apply the alternative (weaker) color rule. This suggests that beta-frequency synchrony selects the relevant rule ensemble, while alpha-frequency synchrony deselects a stronger, but currently irrelevant, ensemble. Synchrony may act to dynamically shape task-relevant neural ensembles out of larger, overlapping circuits.","accessed":{"date-parts":[[2022,3,21]]},"author":[{"family":"Buschman","given":"Timothy J."},{"family":"Denovellis","given":"Eric L."},{"family":"Diogo","given":"Cinira"},{"family":"Bullock","given":"Daniel"},{"family":"Miller","given":"Earl K."}],"citation-key":"buschman12","container-title":"Neuron","DOI":"10.1016/j.neuron.2012.09.029","ISSN":"08966273","issue":"4","issued":{"date-parts":[[2012,11,21]]},"page":"838-846","PMID":"23177967","publisher":"Cell Press","title":"Synchronous Oscillatory Neural Ensembles for Rules in the Prefrontal Cortex","type":"article-journal","volume":"76"},
  {"id":"buzsaki04","abstract":"Clocks tick, bridges and skyscrapers vibrate, neuronal networks oscillate. Are neuronal oscillations an inevitable by-product, similar to bridge vibrations, or an essential part of the brain's design? Mammalian cortical neurons form behavior-dependent oscillating networks of various sizes, which span five orders of magnitude in frequency. These oscillations are phylogenetically preserved, suggesting that they are functionally relevant. Recent findings indicate that network oscillations bias input selection, temporally link neurons into assemblies, and facilitate synaptic plasticity, mechanisms that cooperatively support temporal representation and long-term consolidation of information.","accessed":{"date-parts":[[2022,3,21]]},"author":[{"family":"Buzsáki","given":"György"},{"family":"Draguhn","given":"Andreas"}],"citation-key":"buzsaki04","container-title":"Science","DOI":"10.1126/science.1099745","ISSN":"00368075","issue":"5679","issued":{"date-parts":[[2004,6,25]]},"page":"1926-1929","PMID":"15218136","publisher":"American Association for the Advancement of Science","title":"Neuronal oscillations in cortical networks","type":"article-journal","URL":"https://www.science.org/doi/abs/10.1126/science.1099745","volume":"304"},
  {"id":"buzsaki12","abstract":"Neuronal activity in the brain gives rise to transmembrane and extracellular electromagnetic fields that can be measured in the extracellular medium using several approaches. In this Review, Buzsáki and colleagues provide an overview of the mechanisms that underlie the generation of extracellular currents and fields. Neuronal activity in the brain gives rise to transmembrane currents that can be measured in the extracellular medium. Although the major contributor of the extracellular signal is the synaptic transmembrane current, other sources — including Na+ and Ca2+ spikes, ionic fluxes through voltage- and ligand-gated channels, and intrinsic membrane oscillations — can substantially shape the extracellular field. High-density recordings of field activity in animals and subdural grid recordings in humans, combined with recently developed data processing tools and computational modelling, can provide insight into the cooperative behaviour of neurons, their average synaptic input and their spiking output, and can increase our understanding of how these processes contribute to the extracellular signal.","accessed":{"date-parts":[[2021,10,25]]},"author":[{"family":"Buzsáki","given":"György"},{"family":"Anastassiou","given":"Costas A."},{"family":"Koch","given":"Christof"}],"citation-key":"buzsaki12","container-title":"Nature Reviews Neuroscience 2012 13:6","DOI":"10.1038/nrn3241","ISSN":"1471-0048","issue":"6","issued":{"date-parts":[[2012,5,18]]},"page":"407-420","publisher":"Nature Publishing Group","title":"The origin of extracellular fields and currents — EEG, ECoG, LFP and spikes","type":"article-journal","URL":"https://www.nature.com/articles/nrn3241","volume":"13"},
  {"id":"cannon14","abstract":"Computational models are increasingly important for studying complex neurophysiological systems. As scientific tools, it is essential that such models can be reproduced and critically evaluated by a range of scientists. However, published models are currently implemented using a diverse set of modeling approaches, simulation tools, and computer languages making them inaccessible and difficult to reproduce. Models also typically contain concepts that are tightly linked to domain-specific simulators, or depend on knowledge that is described exclusively in text-based documentation. To address these issues we have developed a compact, hierarchical, XML-based language called LEMS (Low Entropy Model Specification), that can define the structure and dynamics of a wide range of biological models in a fully machine readable format. We describe how LEMS underpins the latest version of NeuroML and show that this framework can define models of ion channels, synapses, neurons and networks. Unit handling, often a source of error when reusing models, is built into the core of the language by specifying physical quantities in models in terms of the base dimensions. We show how LEMS, together with the open source Java and Python based libraries we have developed, facilitates the generation of scripts for multiple neuronal simulators and provides a route for simulator free code generation. We establish that LEMS can be used to define models from systems biology and map them to neuroscience-domain specific simulators, enabling models to be shared between these traditionally separate disciplines. LEMS and NeuroML 2 provide a new, comprehensive framework for defining computational models of neuronal and other biological systems in a machine readable format, making them more reproducible and increasing the transparency and accessibility of their underlying structure and properties.","accessed":{"date-parts":[[2021,5,12]]},"author":[{"family":"Cannon","given":"Robert C."},{"family":"Gleeson","given":"Padraig"},{"family":"Crook","given":"Sharon"},{"family":"Ganapathy","given":"Gautham"},{"family":"Marin","given":"Boris"},{"family":"Piasini","given":"Eugenio"},{"family":"Silver","given":"R. Angus"}],"citation-key":"cannon14","container-title":"Frontiers in Neuroinformatics","DOI":"10.3389/fninf.2014.00079","ISSN":"16625196","issue":"SEP","issued":{"date-parts":[[2014,9,25]]},"page":"79","publisher":"Frontiers Media S.A.","title":"LEMS: A language for expressing complex biological models in concise and hierarchical form and its use in underpinning NeuroML 2","type":"article-journal","URL":"www.frontiersin.org","volume":"8"},
  {"id":"cardin10","abstract":"A major long-term goal of systems neuroscience is to identify the different roles of neural subtypes in brain circuit function. The ability to causally manipulate selective cell types is critical to meeting this goal. This protocol describes techniques for optically stimulating specific populations of excitatory neurons and inhibitory interneurons in vivo in combination with electrophysiology. Cell type selectivity is obtained using Cre-dependent expression of the light-activated channel Channelrhodopsin-2. We also describe approaches for minimizing optical interference with simultaneous extracellular and intracellular recording. These optogenetic techniques provide a spatially and temporally precise means of studying neural activity in the intact brain and allow a detailed examination of the effect of evoked activity on the surrounding local neural network. Injection of viral vectors requires 30-45 min, and in vivo electrophysiology with optogenetic stimulation requires 1-4 h. © 2010 Nature Publishing Group.","accessed":{"date-parts":[[2022,3,21]]},"author":[{"family":"Cardin","given":"Jessica A."},{"family":"Carlén","given":"Marie"},{"family":"Meletis","given":"Konstantinos"},{"family":"Knoblich","given":"Ulf"},{"family":"Zhang","given":"Feng"},{"family":"Deisseroth","given":"Karl"},{"family":"Tsai","given":"Li Huei"},{"family":"Moore","given":"Christopher I."}],"citation-key":"cardin10","container-title":"Nature Protocols","DOI":"10.1038/nprot.2009.228","ISSN":"17542189","issue":"2","issued":{"date-parts":[[2010,1,21]]},"page":"247-254","PMID":"20134425","publisher":"Nature Publishing Group","title":"Targeted optogenetic stimulation and recording of neurons in vivo using cell-type-specific expression of Channelrhodopsin-2","type":"article-journal","URL":"https://www.nature.com/articles/nprot.2009.228","volume":"5"},
  {"id":"chen18a","abstract":"Optogenetics has revolutionized the experimental interrogation of neural circuits and holds promise for the treatment of neurological disorders. It is limited, however, because visible light cannot penetrate deep inside brain tissue. Upconversion nanoparticles (UCNPs) absorb tissue-penetrating near-infrared (NIR) light and emit wavelength-specific visible light. Here, we demonstrate that molecularly tailored UCNPs can serve as optogenetic actuators of transcranial NIR light to stimulate deep brain neurons. Transcranial NIR UCNP-mediated optogenetics evoked dopamine release from genetically tagged neurons in the ventral tegmental area, induced brain oscillations through activation of inhibitory neurons in the medial septum, silenced seizure by inhibition of hippocampal excitatory cells, and triggered memory recall. UCNP technology will enable less-invasive optical neuronal activity manipulation with the potential for remote therapy.","accessed":{"date-parts":[[2022,3,16]]},"author":[{"family":"Chen","given":"Shuo"},{"family":"Weitemier","given":"Adam Z."},{"family":"Zeng","given":"Xiao"},{"family":"He","given":"Linmeng"},{"family":"Wang","given":"Xiyu"},{"family":"Tao","given":"Yanqiu"},{"family":"Huang","given":"Arthur J.Y."},{"family":"Hashimotodani","given":"Yuki"},{"family":"Kano","given":"Masanobu"},{"family":"Iwasaki","given":"Hirohide"},{"family":"Parajuli","given":"Laxmi Kumar"},{"family":"Okabe","given":"Shigeo"},{"family":"Loong Teh","given":"Daniel B."},{"family":"All","given":"Angelo H."},{"family":"Tsutsui-Kimura","given":"Iku"},{"family":"Tanaka","given":"Kenji F."},{"family":"Liu","given":"Xiaogang"},{"family":"McHugh","given":"Thomas J."}],"citation-key":"chen18a","container-title":"Science","DOI":"10.1126/science.aaq1144","ISBN":"9781510623880","ISSN":"10959203","issue":"6376","issued":{"date-parts":[[2018,2,9]]},"page":"679-684","PMID":"29439241","publisher":"American Association for the Advancement of Science","title":"Near-infrared deep brain stimulation via upconversion nanoparticle–mediated optogenetics","type":"article-journal","URL":"https://www.science.org/doi/abs/10.1126/science.aaq1144","volume":"359"},
  {"id":"chuong14","abstract":"Optogenetic inhibition of the electrical activity of neurons enables the causal assessment of their contributions to brain functions. Red light penetrates deeper into tissue than other visible wavelengths. We present a red-shifted cruxhalorhodopsin, Jaws, derived from Haloarcula (Halobacterium) salinarum (strain Shark) and engineered to result in red light-induced photocurrents three times those of earlier silencers. Jaws exhibits robust inhibition of sensory-evoked neural activity in the cortex and results in strong light responses when used in retinas of retinitis pigmentosa model mice. We also demonstrate that Jaws can noninvasively mediate transcranial optical inhibition of neurons deep in the brains of awake mice. The noninvasive optogenetic inhibition opened up by Jaws enables a variety of important neuroscience experiments and offers a powerful general-use chloride pump for basic and applied neuroscience. © 2014 Nature America, Inc.","accessed":{"date-parts":[[2022,3,15]]},"author":[{"family":"Chuong","given":"Amy S."},{"family":"Miri","given":"Mitra L."},{"family":"Busskamp","given":"Volker"},{"family":"Matthews","given":"Gillian A.C."},{"family":"Acker","given":"Leah C."},{"family":"Sørensen","given":"Andreas T."},{"family":"Young","given":"Andrew"},{"family":"Klapoetke","given":"Nathan C."},{"family":"Henninger","given":"Mike A."},{"family":"Kodandaramaiah","given":"Suhasa B."},{"family":"Ogawa","given":"Masaaki"},{"family":"Ramanlal","given":"Shreshtha B."},{"family":"Bandler","given":"Rachel C."},{"family":"Allen","given":"Brian D."},{"family":"Forest","given":"Craig R."},{"family":"Chow","given":"Brian Y."},{"family":"Han","given":"Xue"},{"family":"Lin","given":"Yingxi"},{"family":"Tye","given":"Kay M."},{"family":"Roska","given":"Botond"},{"family":"Cardin","given":"Jessica A."},{"family":"Boyden","given":"Edward S."}],"citation-key":"chuong14","container-title":"Nature Neuroscience","DOI":"10.1038/nn.3752","ISSN":"15461726","issue":"8","issued":{"date-parts":[[2014,7,6]]},"page":"1123-1129","PMID":"24997763","publisher":"Nature Publishing Group","title":"Noninvasive optical inhibition with a red-shifted microbial rhodopsin","type":"article-journal","URL":"https://www.nature.com/articles/nn.3752","volume":"17"},
  {"id":"cole17","abstract":"Oscillations are a prevalent feature of brain recordings. They are believed to play key roles in neural communication and computation. Current analysis methods for studying neural oscillations often implicitly assume that the oscillations are sinusoidal. While these approaches have proven fruitful, we show here that there are numerous instances in which neural oscillations are nonsinusoidal. We highlight approaches to characterize nonsinusoidal features and account for them in traditional spectral analysis. Instead of being a nuisance, we discuss how these nonsinusoidal features may provide crucial and so far overlooked physiological information related to neural communication, computation, and cognition.","accessed":{"date-parts":[[2022,3,21]]},"author":[{"family":"Cole","given":"Scott R."},{"family":"Voytek","given":"Bradley"}],"citation-key":"cole17","container-title":"Trends in Cognitive Sciences","DOI":"10.1016/j.tics.2016.12.008","ISSN":"1879307X","issue":"2","issued":{"date-parts":[[2017,2,1]]},"page":"137-149","PMID":"28063662","publisher":"Elsevier Current Trends","title":"Brain Oscillations and the Importance of Waveform Shape","type":"article-journal","volume":"21"},
  {"id":"cole19","abstract":"Neural oscillations are widely studied using methods based on the Fourier transform, which models data as sums of sinusoids. This has successfully uncovered numerous links between oscillations and cognition or disease. However, neural data are nonsinusoidal, and these nonsinusoidal features are increasingly linked to a variety of behavioral and cognitive states, pathophysiology, and underlying neuronal circuit properties. We present a new analysis framework, one that is complementary to existing Fourier and Hilbert transform-based approaches, that quantifies oscillatory features in the time domain on a cycle-by-cycle basis. We have released this cycle-by-cycle analysis suite as “bycycle,” a fully documented, open-source Python package with detailed tutorials and troubleshooting cases. This approach performs tests to assess whether an oscillation is present at any given moment and, if so, quantifies each oscillatory cycle by its amplitude, period, and waveform symmetry, the latter of which is missed with the use of conventional approaches. In a series of simulated event-related studies, we show how conventional Fourier and Hilbert transform approaches can conflate event-related changes in oscillation burst duration as increased oscillatory amplitude and as a change in the oscillation frequency, even though those features were unchanged in simulation. Our approach avoids these errors. Furthermore, we validate this approach in simulation and against experimental recordings of patients with Parkinson’s disease, who are known to have nonsinusoidal beta (12–30 Hz) oscillations.","accessed":{"date-parts":[[2022,3,21]]},"author":[{"family":"Cole","given":"Scott"},{"family":"Voytek","given":"Bradley"}],"citation-key":"cole19","container-title":"Journal of Neurophysiology","DOI":"10.1152/JN.00273.2019","ISSN":"15221598","issue":"2","issued":{"date-parts":[[2019,8,1]]},"page":"849-861","PMID":"31268801","publisher":"American Physiological Society","title":"Cycle-by-cycle analysis of neural oscillations","type":"article-journal","URL":"https://journals.physiology.org/doi/abs/10.1152/jn.00273.2019","volume":"122"},
  {"id":"cowley20","abstract":"The ability to make a perceptual decision depends both on sensory inputs and on internal cognitive state. Cowley et al. find a slow drift embedded in populations of neurons in visual and prefrontal cortex. Rather than biasing sensory evidence, the slow drift reflects the likelihood of an impulsive decision.","accessed":{"date-parts":[[2022,3,3]]},"author":[{"family":"Cowley","given":"Benjamin R."},{"family":"Snyder","given":"Adam C."},{"family":"Acar","given":"Katerina"},{"family":"Williamson","given":"Ryan C."},{"family":"Yu","given":"Byron M."},{"family":"Smith","given":"Matthew A."}],"citation-key":"cowley20","container-title":"Neuron","DOI":"10.1016/j.neuron.2020.07.021","ISSN":"10974199","issue":"3","issued":{"date-parts":[[2020,11,11]]},"page":"551-567.e8","PMID":"32810433","publisher":"Cell Press","title":"Slow Drift of Neural Activity as a Signature of Impulsivity in Macaque Visual and Prefrontal Cortex","type":"article-journal","volume":"108"},
  {"id":"dai20","abstract":"Experimental studies in neuroscience are producing data at a rapidly increasing rate, providing exciting opportunities and formidable challenges to existing theoretical and modeling approaches. To turn massive datasets into predictive quantitative frameworks, the field needs software solutions for systematic integration of data into realistic, multiscale models. Here we describe the Brain Modeling ToolKit (BMTK), a software suite for building models and performing simulations at multiple levels of resolution, from biophysically detailed multi-compartmental, to point-neuron, to population-statistical approaches. Leveraging the SONATA file format and existing software such as NEURON, NEST, and others, BMTK offers a consistent user experience across multiple levels of resolution. It permits highly sophisticated simulations to be set up with little coding required, thus lowering entry barriers to new users. We illustrate successful applications of BMTK to large-scale simulations of a cortical area. BMTK is an open-source package provided as a resource supporting modeling-based discovery in the community.","accessed":{"date-parts":[[2021,5,11]]},"author":[{"family":"Dai","given":"Kael"},{"family":"Gratiy","given":"Sergey L."},{"family":"Billeh","given":"Yazan N."},{"family":"Xu","given":"Richard"},{"family":"Cai","given":"Binghuang"},{"family":"Cain","given":"Nicholas"},{"family":"Rimehaug","given":"Atle E."},{"family":"Stasik","given":"Alexander J."},{"family":"Einevoll","given":"Gaute T."},{"family":"Mihalas","given":"Stefan"},{"family":"Koch","given":"Christof"},{"family":"Arkhipov","given":"Anton"}],"citation-key":"dai20","container-title":"PLoS Computational Biology","DOI":"10.1371/journal.pcbi.1008386","ISSN":"15537358","issue":"11","issued":{"date-parts":[[2020,11,30]]},"page":"e1008386","PMID":"33253147","publisher":"Public Library of Science","title":"Brain Modeling ToolKit: An open source software suite for multiscale modeling of brain circuits","type":"article-journal","URL":"https://doi.org/10.1371/journal.pcbi.1008386","volume":"16"},
  {"id":"davie06","abstract":"The patch-clamp technique allows investigation of the electrical excitability of neurons and the functional properties and densities of ion channels. Most patch-clamp recordings from neurons have been made from the soma, the largest structure of individual neurons, while their dendrites, which form the majority of the surface area and receive most of the synaptic input, have been relatively neglected. This protocol describes techniques for recording from the dendrites of neurons in brain slices under direct visual control. Although the basic technique is similar to that used for somatic patching, we describe refinements and optimizations of slice quality, microscope optics, setup stability and electrode approach that are required for maximizing the success rate for dendritic recordings. Using this approach, all configurations of the patch-clamp technique (cell-attached, inside-out, whole-cell, outside-out and perforated patch) can be achieved, even for relatively distal dendrites, and simultaneous multiple-electrode dendritic recordings are also possible. The protocol - from the beginning of slice preparation to the end of the first successful recording - can be completed in 3 h.","accessed":{"date-parts":[[2022,3,16]]},"author":[{"family":"Davie","given":"Jenny T."},{"family":"Kole","given":"Maarten H.P."},{"family":"Letzkus","given":"Johannes J."},{"family":"Rancz","given":"Ede A."},{"family":"Spruston","given":"Nelson"},{"family":"Stuart","given":"Greg J."},{"family":"Häusser","given":"Michael"}],"citation-key":"davie06","container-title":"Nature Protocols","DOI":"10.1038/nprot.2006.164","ISSN":"17502799","issue":"3","issued":{"date-parts":[[2006,9,21]]},"page":"1235-1247","PMID":"17406407","publisher":"Nature Publishing Group","title":"Dendritic patch-clamp recording","type":"article-journal","URL":"https://www.nature.com/articles/nprot.2006.164","volume":"1"},
  {"id":"davison09","abstract":"Neuroscience simulators allow scientists to express models in terms of biological concepts, without having to concern themselves with low-level computational details of their implementation. The expressiveness, power and ease-of-use of the simulator interface is critical in efficiently and accurately translating ideas into a working simulation. We review long-term trends in the development of programmable simulator interfaces, and examine the benefits of moving from proprietary, domain-specific languages to modern dynamic general-purpose languages, in particular Python, which provide neuroscientists with an interactive and expressive simulation development environment and easy access to state-of-the-art general-purpose tools for scientific computing. © 2009 Davison, Hines and Muller.","accessed":{"date-parts":[[2022,6,1]]},"author":[{"family":"Davison","given":"Andrew P."},{"family":"Hines","given":"Michael L."},{"family":"Muller","given":"Eilif"}],"citation-key":"davison09","container-title":"Frontiers in Neuroscience","DOI":"10.3389/neuro.01.036.2009","ISSN":"16624548","issue":"DEC","issued":{"date-parts":[[2009]]},"page":"374-380","publisher":"Frontiers","title":"Trends in programming languages for neuroscience simulations","type":"article-journal","volume":"3"},
  {"id":"davison09a","abstract":"Computational neuroscience has produced a diversity of software for simulations of networks of spiking neurons, with both negative and positive consequences. On the one hand, each simulator uses its own programming or confi guration language, leading to considerable diffi culty in porting models from one simulator to another. This impedes communication between investigators and makes it harder to reproduce and build on the work of others. On the other hand, simulation results can be cross-checked between different simulators, giving greater confi dence in their correctness, and each simulator has different optimizations, so the most appropriate simulator can be chosen for a given modelling task. A common programming interface to multiple simulators would reduce or eliminate the problems of simulator diversity while retaining the benefi ts. PyNN is such an interface, making it possible to write a simulation script once, using the Python programming language, and run it without modifi cation on any supported simulator (currently NEURON, NEST, PCSIM, Brian and the Heidelberg VLSI neuromorphic hardware). PyNN increases the productivity of neuronal network modelling by providing high-level abstraction, by promoting code sharing and reuse, and by providing a foundation for simulator-agnostic analysis, visualization and data-management tools. PyNN increases the reliability of modelling studies by making it much easier to check results on multiple simulators. © 2009 Davison, Brüderle, Eppler, Kremkow, Muller, Pecevski, Perrinet and Yger.","accessed":{"date-parts":[[2021,5,11]]},"author":[{"family":"Davison","given":"Andrew P."},{"family":"Brüderle","given":"Daniel"},{"family":"Eppler","given":"Jochen"},{"family":"Kremkow","given":"Jens"},{"family":"Muller","given":"Eilif"},{"family":"Pecevski","given":"Dejan"},{"family":"Perrinet","given":"Laurent"},{"family":"Yger","given":"Pierre"}],"citation-key":"davison09a","container-title":"Frontiers in Neuroinformatics","DOI":"10.3389/neuro.11.011.2008","ISSN":"16625196","issue":"JAN","issued":{"date-parts":[[2009,1,27]]},"page":"11","publisher":"Frontiers Media S.A.","title":"PyNN: A common interface for neuronal network simulators","type":"article-journal","URL":"www.frontiersin.org","volume":"2"},
  {"id":"dura-bernal19","abstract":"Biophysical modeling of neuronal networks helps to integrate and interpret rapidly growing and disparate experimental datasets at multiple scales. The NetPyNE tool (www.netpyne. org) provides both programmatic and graphical interfaces to develop data-driven multiscale network models in NEURON. NetPyNE clearly separates model parameters from implementation code. Users provide specifications at a high level via a standardized declarative language, for example connectivity rules, to create millions of cell-to-cell connections. NetPyNE then enables users to generate the NEURON network, run efficiently parallelized simulations, optimize and explore network parameters through automated batch runs, and use built-in functions for visualization and analysis – connectivity matrices, voltage traces, spike raster plots, local field potentials, and information theoretic measures. NetPyNE also facilitates model sharing by exporting and importing standardized formats (NeuroML and SONATA). NetPyNE is already being used to teach computational neuroscience students and by modelers to investigate brain regions and phenomena.","accessed":{"date-parts":[[2021,11,17]]},"author":[{"family":"Dura-Bernal","given":"Salvador"},{"family":"Suter","given":"Benjamin A."},{"family":"Gleeson","given":"Padraig"},{"family":"Cantarelli","given":"Matteo"},{"family":"Quintana","given":"Adrian"},{"family":"Rodriguez","given":"Facundo"},{"family":"Kedziora","given":"David J."},{"family":"Chadderdon","given":"George L."},{"family":"Kerr","given":"Cliff C."},{"family":"Neymotin","given":"Samuel A."},{"family":"McDougal","given":"Robert A."},{"family":"Hines","given":"Michael"},{"family":"Shepherd","given":"Gordon M.G."},{"family":"Lytton","given":"William W."}],"citation-key":"dura-bernal19","container-title":"eLife","DOI":"10.7554/eLife.44494","ISSN":"2050084X","issued":{"date-parts":[[2019,4,1]]},"PMID":"31025934","publisher":"eLife Sciences Publications Ltd","title":"NetpyNE, a tool for data-driven multiscale modeling of brain circuits","type":"article-journal","volume":"8"},
  {"id":"dutta19","abstract":"Objective. The ability to modulate neural activity in a closed-loop fashion enables causal tests of hypotheses which link dynamically-changing neural circuits to specific behavioral functions. One such dynamically-changing neural circuit is the hippocampus, in which momentary sharp-wave ripple (SWR) events - ≈ 100 ms periods of large 150-250 Hz oscillations - have been linked to specific mnemonic functions via selective closed-loop perturbation. The limited duration of SWR means that the latency in systems used for closed-loop interaction is of significant consequence compared to other longer-lasting circuit states. While closed-loop SWR perturbation is becoming more wide-spread, the performance trade-offs involved in building a SWR disruption system have not been explored, limiting the design and interpretation of paradigms involving ripple disruption. Approach. We developed and evaluated a low-latency closed-loop SWR detection system implemented as a module to an open-source neural data acquisition software suite capable of interfacing with two separate data acquisition hardware platforms. We first use synthetic data to explore the parameter space of our detection algorithm, then proceed to quantify the realtime in vivo performance and limitations of our system. Main results. We evaluate the realtime system performance of two data acquisition platforms, one using USB and one using ethernet for communication. We report that signal detection latency decomposes into a data acquisition component of 7.5-13.8 ms and 1.35-2.6 ms for USB and ethernet hardware respectively, and an algorithmic component which varies depending on the threshold parameter. Using ethernet acquisition hardware, we report that an algorithmic latency in the range of ≈20-66 ms can be achieved while maintaining <10 false detections per minute, and that these values are highly dependent upon algorithmic parameter space trade-offs. Significance. By characterizing this system in detail, we establish a framework for analyzing other closed-loop neural interfacing systems. Thus, we anticipate this modular, open-source, realtime system will facilitate a wide range of carefully-designed causal closed-loop experiments.","accessed":{"date-parts":[[2022,1,6]]},"author":[{"family":"Dutta","given":"Shayok"},{"family":"Ackermann","given":"Etienne"},{"family":"Kemere","given":"Caleb"}],"citation-key":"dutta19","container-title":"Journal of Neural Engineering","DOI":"10.1088/1741-2552/aae90e","ISSN":"17412552","issue":"1","issued":{"date-parts":[[2019,12,3]]},"page":"016009","PMID":"30507556","publisher":"IOP Publishing","title":"Analysis of an open source, closed-loop, realtime system for hippocampal sharp-wave ripple disruption","type":"article-journal","URL":"https://iopscience.iop.org/article/10.1088/1741-2552/aae90e","volume":"16"},
  {"id":"einevoll13","abstract":"The past decade has witnessed a renewed interest in cortical local field potentials (LFPs)-that is, extracellularly recorded potentials with frequencies of up to ~500 Hz. This is due to both the advent of multielectrodes, which has enabled recording of LFPs at tens to hundreds of sites simultaneously, and the insight that LFPs offer a unique window into key integrative synaptic processes in cortical populations. However, owing to its numerous potential neural sources, the LFP is more difficult to interpret than are spikes. Careful mathematical modelling and analysis are needed to take full advantage of the opportunities that this signal offers in understanding signal processing in cortical circuits and, ultimately, the neural basis of perception and cognition. © 2013 Macmillan Publishers Limited.","accessed":{"date-parts":[[2021,10,28]]},"author":[{"family":"Einevoll","given":"Gaute T."},{"family":"Kayser","given":"Christoph"},{"family":"Logothetis","given":"Nikos K."},{"family":"Panzeri","given":"Stefano"}],"citation-key":"einevoll13","container-title":"Nature Reviews Neuroscience","DOI":"10.1038/nrn3599","ISSN":"1471003X","issue":"11","issued":{"date-parts":[[2013,10,18]]},"page":"770-785","PMID":"24135696","publisher":"Nature Publishing Group","title":"Modelling and analysis of local field potentials for studying the function of cortical circuits","type":"article-journal","URL":"https://www.nature.com/articles/nrn3599","volume":"14"},
  {"id":"emiliani15","abstract":"There have been two recent revolutionary advances in neuroscience: First, genetically encoded activity sensors have brought the goal of optical detection of single action potentials in vivo within reach. Second, optogenetic actuators now allow the activity of neurons to be controlled with millisecond precision. These revolutions have now been combined, together with advanced microscopies, to allow “all-optical” readout and manipulation of activity in neural circuits with single-spike and single-neuron precision. This is a transformational advance that will open new frontiers inneuroscience research. Harnessing the power of light in the all-optical approach require scoexpression of genetic allyen code dactivity sensors and optogenetic probesin thes a meneurons, as well as the ability to simultaneously target and record the light from the selected neurons. It has recently become possible to combine sensors and optical strategies that are sufficiently sensitiveandcross talk free to enable single-actionpotential sensitivity and precision for both readout and manipulation in the intact brain. The combination of simultaneous readout and manipulation from the same geneticallyde fined cells will enable awiderange of new experiments as well as inspire new technologies forinter acting with the brain. The advances described in this review herald a future where the traditional tools used for generations by physiologists to study and interact with the brain—stimulation and recording electrodes—can largely be replaced by light. We outline potential future developments in this field and discuss how the all-optical strategy can be applied to solve fundamental problems in neuroscience.","accessed":{"date-parts":[[2020,9,7]]},"author":[{"family":"Emiliani","given":"Valentina"},{"family":"Cohen","given":"Adam E."},{"family":"Deisseroth","given":"Karl"},{"family":"Häusser","given":"Michael"}],"citation-key":"emiliani15","container-title":"Journal of Neuroscience","DOI":"10.1523/JNEUROSCI.2916-15.2015","ISSN":"15292401","issue":"41","issued":{"date-parts":[[2015,10,14]]},"page":"13917-13926","PMID":"26468193","publisher":"Society for Neuroscience","title":"All-optical interrogation of neural circuits","type":"article-journal","URL":"http://www.addgene.org/","volume":"35"},
  {"id":"engel16","abstract":"Dendrites of dopaminergic neurons receive and convey synaptic input, support action potential back-propagation and neurotransmitter release. Understanding these fundamental functions will shed light on the information transfer in these neurons. Dendritic patch-clamp recordings provide the possibility to directly examine the electrical properties of dendrites and underlying voltage-gated ion channels. However, these fine structures are not easily accessible to patch pipettes because of their small diameter. This report describes a step-by-step procedure to collect stable and reliable recordings from the dendrites of dopaminergic neurons in acute slices. Electrophysiological measurements are combined with post hoc recovery of cell morphology. Successful experiments rely on improved preparation of slices, solutions and pipettes, adequate adjustment of the optics and stability of the pipette in contact with the recorded structure. Standard principles of somatic patch-clamp recording are applied to dendrites but with a gentler approach of the pipette. These versatile techniques can be implemented to address various questions concerning the excitable properties of dendrites.","accessed":{"date-parts":[[2022,3,16]]},"author":[{"family":"Engel","given":"Dominique"}],"citation-key":"engel16","container-title":"Journal of Visualized Experiments","DOI":"10.3791/54601","ISSN":"1940087X","issue":"117","issued":{"date-parts":[[2016,11,2]]},"page":"e54601","PMID":"27842379","publisher":"Journal of Visualized Experiments","title":"Subcellular patch-clamp recordings from the somatodendritic domain of nigral dopamine neurons","type":"article-journal","URL":"https://www.jove.com/v/54601/subcellular-patch-clamp-recordings-from-somatodendritic-domain-nigral","volume":"2016"},
  {"id":"eriksson22","abstract":"Simultaneous large-scale recordings and optogenetic interventions may hold the key to deciphering the fast-paced and multifaceted dialogue between neurons that sustains brain function. Here we have taken advantage of thin, cell-sized, optical fibers for minimally invasive optogenetics and flexible implantations. We describe a simple procedure for making those fibers side-emitting with a Lambertian emission distribution. Here we combined those fibers with silicon probes to achieve high-quality recordings and ultrafast multichannel optogenetic inhibition. Furthermore, we developed a multi-channel optical commutator and general-purpose patch-cord for flexible experiments. We demonstrate that our framework allows to conduct simultaneous laminar recordings and multifiber stimulations, 3D optogenetic stimulation, connectivity inference, and behavioral quantification in freely moving animals. Our framework paves the way for large-scale photo tagging and controlled interrogation of rapid neuronal communication in any combination of brain areas.","accessed":{"date-parts":[[2022,9,7]]},"author":[{"family":"Eriksson","given":"David"},{"family":"Schneider","given":"Artur"},{"family":"Thirumalai","given":"Anupriya"},{"family":"Alyahyay","given":"Mansour"},{"family":"Crompe","given":"Brice","non-dropping-particle":"de la"},{"family":"Sharma","given":"Kirti"},{"family":"Ruther","given":"Patrick"},{"family":"Diester","given":"Ilka"}],"citation-key":"eriksson22","container-title":"Nature Communications","container-title-short":"Nat Commun","DOI":"10.1038/s41467-022-28629-6","ISSN":"2041-1723","issue":"1","issued":{"date-parts":[[2022,2,21]]},"language":"en","license":"2022 The Author(s)","number":"1","page":"985","publisher":"Nature Publishing Group","source":"www.nature.com","title":"Multichannel optogenetics combined with laminar recordings for ultra-controlled neuronal interrogation","type":"article-journal","URL":"https://www.nature.com/articles/s41467-022-28629-6","volume":"13"},
  {"id":"evans16","abstract":"Optogenetics has become a key tool for understanding the function of neural circuits and controlling their behavior. An array of directly light driven opsins have been genetically isolated from several families of organisms, with a wide range of temporal and spectral properties. In order to characterize, understand and apply these opsins, we present an integrated suite of open-source, multi-scale computational tools called PyRhO. The purpose of developing PyRhO is three-fold: (i) to characterize new (and existing) opsins by automatically fitting a minimal set of experimental data to three-, four-, or six-state kinetic models, (ii) to simulate these models at the channel, neuron and network levels, and (iii) provide functional insights through model selection and virtual experiments in silico. The module is written in Python with an additional IPython/Jupyter notebook based GUI, allowing models to be fit, simulations to be run and results to be shared through simply interacting with a webpage. The seamless integration of model fitting algorithms with simulation environments (including NEURON and Brian2) for these virtual opsins will enable neuroscientists to gain a comprehensive understanding of their behavior and rapidly identify the most suitable variant for application in a particular biological system. This process may thereby guide not only experimental design and opsin choice but also alterations of the opsin genetic code in a neuro-engineering feed-back loop. In this way, we expect PyRhO will help to significantly advance optogenetics as a tool for transforming biological sciences.","accessed":{"date-parts":[[2020,2,26]]},"author":[{"family":"Evans","given":"Benjamin D."},{"family":"Jarvis","given":"Sarah"},{"family":"Schultz","given":"Simon R."},{"family":"Nikolic","given":"Konstantin"}],"citation-key":"evans16","container-title":"Frontiers in Neuroinformatics","DOI":"10.3389/fninf.2016.00008","ISSN":"1662-5196","issue":"MAR","issued":{"date-parts":[[2016,3,11]]},"page":"8","publisher":"Frontiers Media S.A.","title":"PyRhO: A Multiscale Optogenetics Simulation Platform","type":"article-journal","URL":"http://journal.frontiersin.org/Article/10.3389/fninf.2016.00008/abstract","volume":"10"},
  {"id":"fabus21","abstract":"Neurophysiological signals are often noisy, nonsinusoidal, and consist of transient bursts. Extraction and analysis of oscillatory features (such as waveform shape and cross-frequency coupling) in such data sets remains difficult. This limits our understanding of brain dynamics and its functional importance. Here, we develop iterated masking empirical mode decomposition (itEMD), a method designed to decompose noisy and transient single-channel data into relevant oscillatory modes in a flexible, fully data-driven way without the need for manual tuning. Based on empirical mode decomposition (EMD), this technique can extract single-cycle waveform dynamics through phase-aligned instantaneous frequency. We test our method by extensive simulations across different noise, sparsity, and nonsinusoidality conditions. We find itEMD significantly improves the separation of data into distinct nonsinusoidal oscillatory components and robustly reproduces waveform shape across a wide range of relevant parameters. We further validate the technique on multimodal, multispecies electrophysiological data. Our itEMD extracts known rat hippocampal h waveform asymmetry and identifies subject-specific human occipital a without any prior assumptions about the frequencies contained in the signal. Notably, it does so with significantly less mode mixing compared with existing EMD-based methods. By reducing mode mixing and simplifying interpretation of EMD results, itEMD will enable new analyses into functional roles of neural signals in behavior and disease.","accessed":{"date-parts":[[2022,3,21]]},"author":[{"family":"Fabus","given":"Marco S."},{"family":"Quinn","given":"Andrew J."},{"family":"Warnaby","given":"Catherine E."},{"family":"Woolrich","given":"Mark W."}],"citation-key":"fabus21","container-title":"Journal of Neurophysiology","DOI":"10.1152/jn.00315.2021","ISSN":"15221598","issue":"5","issued":{"date-parts":[[2021,11,1]]},"page":"1670-1684","PMID":"34614377","publisher":"American Physiological Society","title":"Automatic decomposition of electrophysiological data into distinct nonsinusoidal oscillatory modes","type":"article-journal","URL":"https://emd.readthedocs.io","volume":"126"},
  {"id":"faini21","abstract":"Understanding how specific sets of neurons fire and wire together during cognitive-relevant activity is one of the most pressing questions in neuroscience. Two-photon, single-cell resolution optogenetics based on holographic light-targeting approaches enables accurate spatio-temporal control of individual or multiple neurons. Yet, currently, the ability to drive asynchronous activity in distinct cells is critically limited to a few milliseconds and the achievable number of targets to several dozens. In order to expand the capability of single-cell optogenetics, we introduce an approach capable of ultra-fast sequential light targeting (FLiT), based on switching temporally focused beams between holograms at kHz rates. We demonstrate serial-parallel photostimulation strategies capable of multi-cell sub-millisecond temporal control and many-fold expansion of the number of activated cells. This approach will be important for experiments that require rapid and precise cell stimulation with defined spatio-temporal activity patterns and optical control of large neuronal ensembles. ### Competing Interest Statement The authors have declared no competing interest.","accessed":{"date-parts":[[2022,3,14]]},"author":[{"family":"Faini","given":"Giulia"},{"family":"Molinier","given":"Clément"},{"family":"Telliez","given":"Cécile"},{"family":"Tourain","given":"Christophe"},{"family":"Forget","given":"Benoît C."},{"family":"Ronzitti","given":"Emiliano"},{"family":"Emiliani","given":"Valentina"}],"citation-key":"faini21","container-title":"bioRxiv","DOI":"10.1101/2021.06.14.448315","issued":{"date-parts":[[2021,6,14]]},"page":"2021.06.14.448315","publisher":"Cold Spring Harbor Laboratory","title":"Ultrafast Light Targeting for High-Throughput Precise Control of Neuronal Networks","type":"article-journal","URL":"https://www.biorxiv.org/content/10.1101/2021.06.14.448315v1"},
  {"id":"fenno11","abstract":"Genetically encoded, single-component optogenetic tools have made a significant impact on neuroscience, enabling specific modulation of selected cells within complex neural tissues. As the optogenetic toolbox contents grow and diversify, the opportunities for neuroscience continue to grow. In this review, we outline the development of currently available single-component optogenetic tools and summarize the application of various optogenetic tools in diverse model organisms. © 2011 by Annual Reviews. All rights reserved.","accessed":{"date-parts":[[2020,9,9]]},"author":[{"family":"Fenno","given":"Lief"},{"family":"Yizhar","given":"Ofer"},{"family":"Deisseroth","given":"Karl"}],"citation-key":"fenno11","container-title":"Annual Review of Neuroscience","DOI":"10.1146/annurev-neuro-061010-113817","ISSN":"0147006X","issued":{"date-parts":[[2011,7,21]]},"page":"389-412","PMID":"21692661","publisher":"Annual Reviews","title":"The development and application of optogenetics","type":"article-journal","URL":"www.annualreviews.org","volume":"34"},
  {"id":"fourcaud-trocme03","abstract":"This study examines the ability of neurons to track temporally varying inputs, namely by investigating how the instantaneous firing rate of a neuron is modulated by a noisy input with a small sinusoidal component with frequency (f). Using numerical simulations of conductance-based neurons and analytical calculations of one-variable nonlinear integrate-and-fire neurons, we characterized the dependence of this modulation on f. For sufficiently high noise, the neuron acts as a low-pass filter. The modulation amplitude is approximately constant for frequencies up to a cutoff frequency, fc, after which it decays. The cutoff frequency increases almost linearly with the firing rate. For higher frequencies, the modulation amplitude decays as C/f α, where the power α depends on the spike initiation mechanism. For conductance-based models, α = 1, and the prefactor C depends solely on the average firing rate and a spike \"slope factor,\" which determines the sharpness of the spike initiation. These results are attributable to the fact that near threshold, the sodium activation variable can be approximated by an exponential function. Using this feature, we propose a simplified one-variable model, the \"exponential integrate-and-fire neuron,\" as an approximation of a conductance-based model. We show that this model reproduces the dynamics of a simple conductance-based model extremely well. Our study shows how an intrinsic neuronal property (the characteristics of fast sodium channels) determines the speed with which neurons can track changes in input.","accessed":{"date-parts":[[2022,3,10]]},"author":[{"family":"Fourcaud-Trocmé","given":"Nicolas"},{"family":"Hansel","given":"David"},{"family":"Van Vreeswijk","given":"Carl"},{"family":"Brunel","given":"Nicolas"}],"citation-key":"fourcaud-trocme03","container-title":"Journal of Neuroscience","DOI":"10.1523/jneurosci.23-37-11628.2003","ISSN":"02706474","issue":"37","issued":{"date-parts":[[2003,12,17]]},"page":"11628-11640","PMID":"14684865","publisher":"Society for Neuroscience","title":"How Spike Generation Mechanisms Determine the Neuronal Response to Fluctuating Inputs","type":"article-journal","URL":"https://www.jneurosci.org/content/23/37/11628","volume":"23"},
  {"id":"gerkin19","abstract":"Validating a quantitative scientific model requires comparing its predictions against many experimental observations, ideally from many labs, using transparent, robust, statistical comparisons. Unfortunately, in rapidly-growing fields like neuroscience, this is becoming increasingly untenable, even for the most conscientious scientists. Thus the merits and limitations of existing models, or whether a new model is an improvement on the state-of-the-art, is often unclear. Software engineers seeking to verify, validate and contribute to a complex software project rely on suites of simple executable tests, called “unit tests”. Drawing inspiration from this practice, we previously developed SciUnit , an easy-to-use framework for developing data-driven “model validation tests” – executable functions, here written in Python. Each such test generates and statistically validates predictions from a model against one relevant feature of empirical data to produce a score indicating agreement between the model and the data. Suites of such validation tests can be used to clearly identify the merits and limitations of existing models and developmental progress on new models. Here we describe NeuronUnit , a library that builds upon SciUnit and integrates with several existing neuroinformatics resources to support the validation of single-neuron models using data gathered by neurophysiologists and neuroanatomists. NeuronUnit integrates with existing technologies like Jupyter, Pandas, NeuroML and resources such as NeuroElectro, The Allen Institute, and The Human Brain Project in order to make neuron model validation as easy as possible for computational neuroscientists.","accessed":{"date-parts":[[2022,6,15]]},"author":[{"family":"Gerkin","given":"Richard C."},{"family":"Birgiolas","given":"Justas"},{"family":"Jarvis","given":"Russell J."},{"family":"Omar","given":"Cyrus"},{"family":"Crook","given":"Sharon M."}],"citation-key":"gerkin19","container-title":"bioRxiv","DOI":"10.1101/665331","issued":{"date-parts":[[2019,6,9]]},"page":"665331","publisher":"Cold Spring Harbor Laboratory","title":"NeuronUnit: A package for data-driven validation of neuron models using SciUnit","type":"article-journal","URL":"https://www.biorxiv.org/content/10.1101/665331v1"},
  {"id":"gobel07","abstract":"Spatiotemporal activity patterns in local neural networks are fundamental to brain function. Network activity can now be measured in vivo using two-photon imaging of cell populations that are labeled with fluorescent calcium indicators. In this review, we discuss basic aspects of in vivo calcium imaging and highlight recent developments that will help to uncover operating principles of neural circuits.","accessed":{"date-parts":[[2022,9,7]]},"author":[{"family":"Göbel","given":"Werner"},{"family":"Helmchen","given":"Fritjof"}],"citation-key":"gobel07","container-title":"Physiology","DOI":"10.1152/physiol.00032.2007","ISSN":"1548-9213","issue":"6","issued":{"date-parts":[[2007,12]]},"page":"358-365","publisher":"American Physiological Society","source":"journals.physiology.org (Atypon)","title":"In Vivo Calcium Imaging of Neural Network Function","type":"article-journal","URL":"https://journals.physiology.org/doi/full/10.1152/physiol.00032.2007","volume":"22"},
  {"id":"govorunova15","abstract":"Light-gated rhodopsin cation channels from chlorophyte algae have transformed neuroscience research through their use as membrane-depolarizing optogenetic tools for targeted photoactivation of neuron firing. Photosuppression of neuronal action potentials has been limited by the lack of equally efficient tools for membrane hyperpolarization. We describe anion channel rhodopsins (ACRs), a family of light-gated anion channels from cryptophyte algae that provide highly sensitive and efficient membrane hyperpolarization and neuronal silencing through light-gated chloride conduction. ACRs strictly conducted anions, completely excluding protons and larger cations, and hyperpolarized the membrane of cultured animal cells with much faster kinetics at less than one-thousandth of the light intensity required by the most efficient currently available optogenetic proteins. Natural ACRs provide optogenetic inhibition tools with unprecedented light sensitivity and temporal precision.","accessed":{"date-parts":[[2022,3,15]]},"author":[{"family":"Govorunova","given":"Elena G."},{"family":"Sineshchekov","given":"Oleg A."},{"family":"Janz","given":"Roger"},{"family":"Liu","given":"Xiaoqin"},{"family":"Spudich","given":"John L."}],"citation-key":"govorunova15","container-title":"Science","DOI":"10.1126/science.aaa7484","ISSN":"10959203","issue":"6248","issued":{"date-parts":[[2015,8,7]]},"page":"647-650","PMID":"26113638","publisher":"American Association for the Advancement of Science","title":"Natural light-gated anion channels: A family of microbial rhodopsins for advanced optogenetics","type":"article-journal","URL":"https://www.science.org/doi/abs/10.1126/science.aaa7484","volume":"349"},
  {"id":"govorunova17","abstract":"Natural anion channelrhodopsins (ACRs) discovered in the cryptophyte alga Guillardia theta generate large hyperpolarizing currents at membrane potentials above the Nernst equilibrium potential for Cl- and thus can be used as efficient inhibitory tools for optogenetics. We have identified and characterized new ACR homologs in different cryptophyte species, showing that all of them are anion-selective, and thus expanded this protein family to 20 functionally confirmed members. Sequence comparison of natural ACRs and engineered Cl- conducting mutants of cation channelrhodopsins (CCRs) showed radical differences in their anion selectivity filters. In particular, the Glu90 residue in channelrhodopsin 2, which needed to be mutated to a neutral or alkaline residue to confer anion selectivity to CCRs, is nevertheless conserved in all of the ACRs identified. The new ACRs showed a large variation of the amplitude, kinetics, and spectral sensitivity of their photocurrents. A notable variant, designated \"ZipACR\", is particularly promising for inhibitory optogenetics because of its combination of larger current amplitudes than those of previously reported ACRs and an unprecedentedly fast conductance cycle (current half-decay time 2-4 ms depending on voltage). ZipACR expressed in cultured mouse hippocampal neurons enabled precise photoinhibition of individual spikes in trains of up to 50 Hz frequency.","accessed":{"date-parts":[[2022,3,15]]},"author":[{"family":"Govorunova","given":"Elena G."},{"family":"Sineshchekov","given":"Oleg A."},{"family":"Rodarte","given":"Elsa M."},{"family":"Janz","given":"Roger"},{"family":"Morelle","given":"Olivier"},{"family":"Melkonian","given":"Michael"},{"family":"Wong","given":"Gane K.S."},{"family":"Spudich","given":"John L."}],"citation-key":"govorunova17","container-title":"Scientific Reports","DOI":"10.1038/srep43358","ISBN":"0021218439","ISSN":"20452322","issue":"1","issued":{"date-parts":[[2017,3,3]]},"page":"1-10","PMID":"28256618","publisher":"Nature Publishing Group","title":"The Expanding Family of Natural Anion Channelrhodopsins Reveals Large Variations in Kinetics, Conductance, and Spectral Sensitivity","type":"article-journal","URL":"https://www.nature.com/articles/srep43358","volume":"7"},
  {"id":"gratiy18","abstract":"There is a significant interest in the neuroscience community in the development of large-scale network models that would integrate diverse sets of experimental data to help elucidate mechanisms underlying neuronal activity and computations. Although powerful numerical simulators (e.g., NEURON, NEST) exist, data-driven large-scale modeling remains challenging due to difficulties involved in setting up and running network simulations. We developed a high-level application programming interface (API) in Python that facilitates building large-scale biophysically detailed networks and simulating them with NEURON on parallel computer architecture. This tool, termed “BioNet”, is designed to support a modular workflow whereby the description of a constructed model is saved as files that could be subsequently loaded for further refinement and/or simulation. The API supports both NEURON’s built-in as well as user-defined models of cells and synapses. It is capable of simulating a variety of observables directly supported by NEURON (e.g., spikes, membrane voltage, intracellular [Ca++]), as well as plugging in modules for computing additional observables (e.g. extracellular potential). The high-level API platform obviates the time-consuming development of custom code for implementing individual models, and enables easy model sharing via standardized files. This tool will help refocus neuroscientists on addressing outstanding scientific questions rather than developing narrow-purpose modeling code.","accessed":{"date-parts":[[2021,5,12]]},"author":[{"family":"Gratiy","given":"Sergey L."},{"family":"Billeh","given":"Yazan N."},{"family":"Dai","given":"Kael"},{"family":"Mitelut","given":"Catalin"},{"family":"Feng","given":"David"},{"family":"Gouwens","given":"Nathan W."},{"family":"Cain","given":"Nicholas"},{"family":"Koch","given":"Christof"},{"family":"Anastassiou","given":"Costas A."},{"family":"Arkhipov","given":"Anton"}],"citation-key":"gratiy18","container-title":"PLoS ONE","DOI":"10.1371/journal.pone.0201630","ISSN":"19326203","issue":"8","issued":{"date-parts":[[2018,8,1]]},"page":"e0201630","PMID":"30071069","publisher":"Public Library of Science","title":"BioNet: A Python interface to NEURON for modeling large-scale networks","type":"article-journal","URL":"https://doi.org/10.1371/journal.pone.0201630","volume":"13"},
  {"id":"grosenick15","accessed":{"date-parts":[[2019,10,9]]},"author":[{"family":"Grosenick","given":"Logan"},{"family":"Marshel","given":"James H"},{"family":"Deisseroth","given":"Karl"}],"citation-key":"grosenick15","container-title":"Neuron","DOI":"10.1016/j.neuron.2015.03.034","issued":{"date-parts":[[2015]]},"page":"106-139","title":"Review Closed-Loop and Activity-Guided Optogenetic Control","type":"article-journal","URL":"http://dx.doi.org/10.1016/j.neuron.2015.03.034","volume":"86"},
  {"id":"gunaydin10","abstract":"Channelrhodopsins such as channelrhodopsin-2 (ChR2) can drive spiking with millisecond precision in a wide variety of cells, tissues and animal species. However, several properties of this protein have limited the precision of optogenetic control. First, when ChR2 is expressed at high levels, extra spikes (for example, doublets) can occur in response to a single light pulse, with potential implications as doublets may be important for neural coding. Second, many cells cannot follow ChR2-driven spiking above the gamma (∼40 Hz) range in sustained trains, preventing temporally stationary optogenetic access to a broad and important neural signaling band. Finally, rapid optically driven spike trains can result in plateau potentials of 10 mV or more, causing incidental upstates with information-processing implications. We designed and validated an engineered opsin gene (ChETA) that addresses all of these limitations (profoundly reducing extra spikes, eliminating plateau potentials and allowing temporally stationary, sustained spike trains up to at least 200 Hz). © 2010 Nature America, Inc. All rights reserved.","accessed":{"date-parts":[[2021,6,16]]},"author":[{"family":"Gunaydin","given":"Lisa A."},{"family":"Yizhar","given":"Ofer"},{"family":"Berndt","given":"André"},{"family":"Sohal","given":"Vikaas S."},{"family":"Deisseroth","given":"Karl"},{"family":"Hegemann","given":"Peter"}],"citation-key":"gunaydin10","container-title":"Nature Neuroscience","DOI":"10.1038/nn.2495","ISSN":"10976256","issue":"3","issued":{"date-parts":[[2010,3,17]]},"page":"387-392","PMID":"20081849","publisher":"Nature Publishing Group","title":"Ultrafast optogenetic control","type":"article-journal","URL":"https://www.nature.com/articles/nn.2495","volume":"13"},
  {"id":"gupta19a","abstract":"A detailed theoretical analysis and optimization of high-fidelity, high-frequency firing of the red-shifted very-fast-Chrimson (vf-Chrimson) expressing neurons is presented. A four-state model for vf-Chrimson photocycle has been formulated and incorporated in Hodgkin-Huxley and Wang-Buzsaki spiking neuron circuit models. The effect of various parameters that include irradiance, pulse width, frequency, expression level, and membrane capacitance has been studied in detail. Theoretical simulations are in excellent agreement with recently reported experimental results. The analysis and optimization bring out additional interesting features. A minimal pulse width of 1.7 ms at 23 mW/mm2 induces a peak photocurrent of 1250 pA. Optimal irradiance (0.1 mW/mm2) and pulse width (50 us) to trigger action potential have been determined. At frequencies beyond 200 Hz, higher values of expression level and irradiance result in spike failure. Singlet and doublet spiking fidelity can be maintained up to 400 and 150 Hz, respectively. The combination of expression level and membrane capacitance is a crucial factor to achieve high-frequency firing above 500 Hz. Its optimization enables 100% spike probability of up to 1 kHz. The study is useful in designing new high-frequency optogenetic neural spiking experiments with desired spatiotemporal resolution, by providing insights into the temporal spike coding, plasticity, and curing neurodegenerative diseases.","accessed":{"date-parts":[[2022,3,14]]},"author":[{"family":"Gupta","given":"Neha"},{"family":"Bansal","given":"Himanshu"},{"family":"Roy","given":"Sukhdev"}],"citation-key":"gupta19a","container-title":"Neurophotonics","DOI":"10.1117/1.nph.6.2.025002","ISSN":"23294248","issue":"02","issued":{"date-parts":[[2019,4,11]]},"page":"1","publisher":"SPIE","title":"Theoretical optimization of high-frequency optogenetic spiking of red-shifted very fast-Chrimson-expressing neurons","type":"article-journal","URL":"https://www.spiedigitallibrary.org/journals/neurophotonics/volume-6/issue-2/025002/Theoretical-optimization-of-high-frequency-optogenetic-spiking-of-red-shifted/10.1117/1.NPh.6.2.025002.full","volume":"6"},
  {"id":"gutruf18","abstract":"Recently developed classes of ultraminiaturized wireless devices provide powerful capabilities in neuroscience research, as implantable light sources for simulation/inhibition via optogenetics, as integrated microfluidic systems for programmed pharmacological delivery and as multimodal sensors for physiological measurements. These platforms leverage basic advances in biocompatible materials, semiconductor device designs and systems engineering concepts to afford modes of operation that are qualitatively distinct from those of conventional approaches that tether animals to external hardware by means of optical fibers, electrical cables and/or fluidic tubing. Neuroscience studies that exploit the unique features of these technologies enable insights into neural function through targeted stimulation, inhibition and recording, with spatially and genetically precise manipulation of neural circuit activity. Experimental possibilities include studies in naturalistic, three dimensional environments, investigations of pair-wise or group related social interactions and many other scenarios of interest that cannot be addressed using traditional hardware.","accessed":{"date-parts":[[2022,9,7]]},"author":[{"family":"Gutruf","given":"Philipp"},{"family":"Rogers","given":"John A"}],"citation-key":"gutruf18","collection-title":"Neurotechnologies","container-title":"Current Opinion in Neurobiology","container-title-short":"Current Opinion in Neurobiology","DOI":"10.1016/j.conb.2017.12.007","ISSN":"0959-4388","issued":{"date-parts":[[2018,6,1]]},"language":"en","page":"42-49","source":"ScienceDirect","title":"Implantable, wireless device platforms for neuroscience research","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S0959438817301964","volume":"50"},
  {"id":"gutzen18","abstract":"Computational neuroscience relies on simulations of neural network models to bridge the gap between the theory of neural networks and the experimentally observed activity dynamics in the brain. The rigorous validation of simulation results against reference data is thus an indispensable part of any simulation workflow. Moreover, the availability of different simulation environments and levels of model description require also validation of model implementations against each other to evaluate their equivalence. Despite rapid advances in the formalized description of models, data, and analysis workflows, there is no accepted consensus regarding the terminology and practical implementation of validation workflows in the context of neural simulations. This situation prevents the generic, unbiased comparison between published models, which is a key element of enhancing reproducibility of computational research in neuroscience. In this study, we argue for the establishment of standardized statistical test metrics that enable the quantitative validation of network models on the level of the population dynamics. Despite the importance of validating the elementary components of a simulation, such as single cell dynamics, building networks from validated building blocks does not entail the validity of the simulation on the network scale. Therefore, we introduce a corresponding set of validation tests and present an example workflow that practically demonstrates the iterative model validation of a spiking neural network model against its reproduction on the SpiNNaker neuromorphic hardware system. We formally implement the workflow using a generic Python library that we introduce for validation tests on neural network activity data. Together with the companion study (Trensch et al., 2018), the work presents a consistent definition, formalization, and implementation of the verification and validation process for neural network simulations.","accessed":{"date-parts":[[2022,5,5]]},"author":[{"family":"Gutzen","given":"Robin"},{"family":"Papen","given":"Michael","non-dropping-particle":"von"},{"family":"Trensch","given":"Guido"},{"family":"Quaglio","given":"Pietro"},{"family":"Grün","given":"Sonja"},{"family":"Denker","given":"Michael"}],"citation-key":"gutzen18","container-title":"Frontiers in Neuroinformatics","DOI":"10.3389/fninf.2018.00090","ISSN":"16625196","issued":{"date-parts":[[2018,12,19]]},"page":"90","publisher":"Frontiers Media S.A.","title":"Reproducible neural network simulations: Statistical methods for model validation on the level of network activity data","type":"article-journal","volume":"12"},
  {"id":"gysbrechts16","abstract":"Optical brain stimulation gained a lot of attention in neuroscience due to its superior cell-type specificity. In the design of illumination strategies, predicting the light propagation in a specific tissue is essential and requires knowledge of the optical properties of that tissue. We present the estimated absorption and reduced scattering in rodent brain tissue using non-destructive contact spatially resolved spectroscopy (cSRS). The obtained absorption and scattering in the cortex, hippocampus and striatum are similar, but lower than in the thalamus, leading to a less deep but broader light penetration profile in the thalamus. Next, the light distribution was investigated for different stimulation protocols relevant for fiber-optic based optogenetic experiments, using Monte Carlo simulation. A protocol specific analysis is proposed to evaluate the potential of thermally induced side effects.","accessed":{"date-parts":[[2022,3,10]]},"author":[{"family":"Gysbrechts","given":"Barbara"},{"family":"Wang","given":"Ling"},{"family":"Trong","given":"Nghia Nguyen Do"},{"family":"Cabral","given":"Henrique"},{"family":"Navratilova","given":"Zaneta"},{"family":"Battaglia","given":"Francesco"},{"family":"Saeys","given":"Wouter"},{"family":"Bartic","given":"Carmen"}],"citation-key":"gysbrechts16","container-title":"Journal of Biophotonics","DOI":"10.1002/jbio.201500106","ISSN":"18640648","issue":"6","issued":{"date-parts":[[2016,6,1]]},"page":"576-585","PMID":"26192551","publisher":"John Wiley & Sons, Ltd","title":"Light distribution and thermal effects in the rat brain under optogenetic stimulation","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/full/10.1002/jbio.201500106","volume":"9"},
  {"id":"hagen16","abstract":"With rapidly advancing multi-electrode recording technology, the local field potential (LFP) has again become a popular measure of neuronal activity in both research and clinical applications. Proper understanding of the LFP requires detailed mathematical modeling incorporating the anatomical and electrophysiological features of neurons near the recording electrode, as well as synaptic inputs from the entire network. Here we propose a hybrid modeling scheme combining efficient point-neuron network models with biophysical principles underlying LFP generation by real neurons. The LFP predictions rely on populations of network-equivalent multicompartment neuron models with layer-specific synaptic connectivity, can be used with an arbitrary number of point-neuron network populations, and allows for a full separation of simulated network dynamics and LFPs. We apply the scheme to a full-scale cortical network model for a ∼1mm2 patch of primary visual cortex, predict laminar LFPs for different network states, assess the relative LFP contribution from different laminar populations, and investigate effects of input correlations and neuron density on the LFP. The generic nature of the hybrid scheme and its public implementation in hybridLFPy form the basis for LFP predictions from other and larger pointneuron network models, as well as extensions of the current application with additional biological detail.","accessed":{"date-parts":[[2021,5,11]]},"author":[{"family":"Hagen","given":"Espen"},{"family":"Dahmen","given":"David"},{"family":"Stavrinou","given":"Maria L."},{"family":"Lindén","given":"Henrik"},{"family":"Tetzlaff","given":"Tom"},{"family":"Van Albada","given":"Sacha J."},{"family":"Grün","given":"Sonja"},{"family":"Diesmann","given":"Markus"},{"family":"Einevoll","given":"Gaute T."}],"citation-key":"hagen16","container-title":"Cerebral Cortex","DOI":"10.1093/cercor/bhw237","ISSN":"14602199","issue":"12","issued":{"date-parts":[[2016,12,1]]},"page":"4461-4496","PMID":"27797828","publisher":"Oxford University Press","title":"Hybrid scheme for modeling local field potentials from point-neuron networks","type":"article-journal","URL":"https://academic.oup.com/cercor/article/26/12/4461/2333943","volume":"26"},
  {"id":"hagen18","abstract":"Recordings of extracellular electrical, and later also magnetic, brain signals have been the dominant technique for measuring brain activity for decades. The interpretation of such signals is however nontrivial, as the measured signals result from both local and distant neuronal activity. In volume-conductor theory the extracellular potentials can be calculated from a distance-weighted sum of contributions from transmembrane currents of neurons. Given the same transmembrane currents, the contributions to the magnetic field recorded both inside and outside the brain can also be computed. This allows for the development of computational tools implementing forward models grounded in the biophysics underlying electrical and magnetic measurement modalities. LFPy (LFPy.readthedocs.io) incorporated a well-established scheme for predicting extracellular potentials of individual neurons with arbitrary levels of biological detail. It relies on NEURON (neuron.yale.edu) to compute transmembrane currents of multicompartment neurons which is then used in combination with an electrostatic forward model. Its functionality is now extended to allow for modeling of networks of multicompartment neurons with concurrent calculations of extracellular potentials and current dipole moments. The current dipole moments are then, in combination with suitable volume-conductor head models, used to compute non-invasive measures of neuronal activity, like scalp potentials (electroencephalographic recordings; EEG) and magnetic fields outside the head (magnetoencephalographic recordings; MEG). One such built-in head model is the four-sphere head model incorporating the different electric conductivities of brain, cerebrospinal fluid, skull and scalp. We demonstrate the new functionality of the software by constructing a network of biophysically detailed multicompartment neuron models from the Neocortical Microcircuit Collaboration (NMC) Portal (bbp.epfl.ch/nmc-portal) with corresponding statistics of connections and synapses, and compute in vivo-like extracellular potentials (local field potentials, LFP; electrocorticographical signals, ECoG) and corresponding current dipole moments. From the current dipole moments we estimate corresponding EEG and MEG signals using the four-sphere head model. We also show strong scaling performance of LFPy with different numbers of message-passing interface (MPI) processes, and for different network sizes with different density of connections. The open-source software LFPy is equally suitable for execution on laptops and in parallel on high-performance computing (HPC) facilities and is publicly available on GitHub.com.","accessed":{"date-parts":[[2021,5,11]]},"author":[{"family":"Hagen","given":"Espen"},{"family":"Næss","given":"Solveig"},{"family":"Ness","given":"Torbjørn V."},{"family":"Einevoll","given":"Gaute T."}],"citation-key":"hagen18","container-title":"Frontiers in Neuroinformatics","DOI":"10.3389/fninf.2018.00092","ISSN":"16625196","issued":{"date-parts":[[2018,12,18]]},"page":"92","publisher":"Frontiers Media S.A.","title":"Multimodal modeling of neural network activity: Computing LFP, ECoG, EEG, and MEG signals with LFPy 2.0","type":"article-journal","URL":"www.frontiersin.org","volume":"12"},
  {"id":"hochbaum14","abstract":"All-optical electrophysiology-spatially resolved simultaneous optical perturbation and measurement of membrane voltage-would open new vistas in neuroscience research. We evolved two archaerhodopsin-based voltage indicators, QuasAr1 and QuasAr2, which show improved brightness and voltage sensitivity, have microsecond response times and produce no photocurrent. We engineered a channelrhodopsin actuator, cheriff, which shows high light sensitivity and rapid kinetics and is spectrally orthogonal to the QuasArs. A coexpression vector, optopatch, enabled cross-talk-free genetically targeted all-optical electrophysiology. in cultured rat neurons, we combined optopatch with patterned optical excitation to probe back-propagating action potentials (APs) in dendritic spines, synaptic transmission, subcellular microsecond-timescale details of AP propagation, and simultaneous fring of many neurons in a network. optopatch measurements revealed homeostatic tuning of intrinsic excitability in human stem cell-derived neurons. in rat brain slices, optopatch induced and reported APs and subthreshold events with high signal-to-noise ratios. the optopatch platform enables high-throughput, spatially resolved electrophysiology without the use of conventional electrodes. © 2014 Nature America, Inc. All rights reserved.","accessed":{"date-parts":[[2022,3,15]]},"author":[{"family":"Hochbaum","given":"Daniel R."},{"family":"Zhao","given":"Yongxin"},{"family":"Farhi","given":"Samouil L."},{"family":"Klapoetke","given":"Nathan"},{"family":"Werley","given":"Christopher A."},{"family":"Kapoor","given":"Vikrant"},{"family":"Zou","given":"Peng"},{"family":"Kralj","given":"Joel M."},{"family":"MacLaurin","given":"Dougal"},{"family":"Smedemark-Margulies","given":"Niklas"},{"family":"Saulnier","given":"Jessica L."},{"family":"Boulting","given":"Gabriella L."},{"family":"Straub","given":"Christoph"},{"family":"Cho","given":"Yong Ku"},{"family":"Melkonian","given":"Michael"},{"family":"Wong","given":"Gane Ka Shu"},{"family":"Harrison","given":"D. Jed"},{"family":"Murthy","given":"Venkatesh N."},{"family":"Sabatini","given":"Bernardo L."},{"family":"Boyden","given":"Edward S."},{"family":"Campbell","given":"Robert E."},{"family":"Cohen","given":"Adam E."}],"citation-key":"hochbaum14","container-title":"Nature Methods","DOI":"10.1038/NMETH.3000","ISSN":"15487105","issue":"8","issued":{"date-parts":[[2014,6,22]]},"page":"825-833","PMID":"24952910","publisher":"Nature Publishing Group","title":"All-optical electrophysiology in mammalian neurons using engineered microbial rhodopsins","type":"article-journal","URL":"https://www.nature.com/articles/nmeth.3000","volume":"11"},
  {"id":"jazayeri21","abstract":"The ongoing exponential rise in recording capacity calls for new approaches for analysing and interpreting neural data. Effective dimensionality has emerged as an important property of neural activity across populations of neurons, yet different studies rely on different definitions and interpretations of this quantity. Here, we focus on intrinsic and embedding dimensionality, and discuss how they might reveal computational principles from data. Reviewing recent works, we propose that the intrinsic dimensionality reflects information about the latent variables encoded in collective activity while embedding dimensionality reveals the manner in which this information is processed. We conclude by highlighting the role of network models as an ideal substrate for testing more specifically various hypotheses on the computational principles reflected through intrinsic and embedding dimensionality.","accessed":{"date-parts":[[2022,3,3]]},"author":[{"family":"Jazayeri","given":"Mehrdad"},{"family":"Ostojic","given":"Srdjan"}],"citation-key":"jazayeri21","container-title":"Current Opinion in Neurobiology","DOI":"10.1016/j.conb.2021.08.002","ISSN":"18736882","issued":{"date-parts":[[2021,10,1]]},"page":"113-120","PMID":"34537579","publisher":"Elsevier Current Trends","title":"Interpreting neural computations by examining intrinsic and embedding dimensionality of neural activity","type":"article-journal","volume":"70"},
  {"id":"jha22","abstract":"Active learning seeks to reduce the number of samples required to estimate the parameters of a model, thus forming an important class of techniques in modern machine learning. However, past work on active learning has largely overlooked latent variable models, which play a vital role in neuroscience, psychology, and a variety of other engineering and scientific disciplines. Here we address this gap in the literature and propose a novel framework for maximum-mutual-information input selection for learning discrete latent variable regression models. We first examine a class of models known as \"mixtures of linear regressions\" (MLR). This example is striking because it is well known that active learning confers no advantage for standard least-squares regression. However, we show -- both in simulations and analytically using Fisher information -- that optimal input selection can nevertheless provide dramatic gains for mixtures of regression models; we also validate this on a real-world application of MLRs. We then consider a powerful class of temporally structured latent variable models known as Input-Output Hidden Markov Models (IO-HMMs), which have recently gained prominence in neuroscience. We show that our method substantially speeds up learning, and outperforms a variety of approximate methods based on variational and amortized inference.","accessed":{"date-parts":[[2022,4,7]]},"author":[{"family":"Jha","given":"Aditi"},{"family":"Ashwood","given":"Zoe C."},{"family":"Pillow","given":"Jonathan W."}],"citation-key":"jha22","container-title":"arXiv","DOI":"10.48550/arxiv.2202.13426","issued":{"date-parts":[[2022,2,27]]},"title":"Bayesian Active Learning for Discrete Latent Variable Models","type":"article-journal","URL":"https://arxiv.org/abs/2202.13426v1"},
  {"id":"juavinett19","abstract":"The advent of high-yield electrophysiology using Neuropixels probes is now enabling researchers to simultaneously record hundreds of neurons with remarkably high signal to noise. However, these probes have not been well-suited to use in freely moving mice. It is critical to study neural activity in unrestricted animals for many reasons, such as leveraging ethological approaches to study neural circuits. We designed and implemented a novel device that allows Neuropixels probes to be customized for chronically implanted experiments in freely moving mice. We demonstrate the ease and utility of this approach in recording hundreds of neurons during an ethological behavior across weeks of experiments. We provide the technical drawings and procedures for other researchers to do the same. Importantly, our approach enables researchers to explant and reuse these valuable probes, a transformative step which has not been established for recordings with any type of chronically-implanted probe.","accessed":{"date-parts":[[2022,9,7]]},"author":[{"family":"Juavinett","given":"Ashley L"},{"family":"Bekheet","given":"George"},{"family":"Churchland","given":"Anne K"}],"citation-key":"juavinett19","container-title":"eLife","DOI":"10.7554/eLife.47188","editor":[{"family":"Colgin","given":"Laura L"},{"family":"Steinmetz","given":"Nick"}],"ISSN":"2050-084X","issued":{"date-parts":[[2019,8,14]]},"page":"e47188","publisher":"eLife Sciences Publications, Ltd","source":"eLife","title":"Chronically implanted Neuropixels probes enable high-yield recordings in freely moving mice","type":"article-journal","URL":"https://doi.org/10.7554/eLife.47188","volume":"8"},
  {"id":"kaufman14","abstract":"Neural circuits must perform computations and then selectively output the results to other circuits. Yet synapses do not change radically at millisecond timescales. A key question then is: how is communication between neural circuits controlled? In motor control, brain areas directly involved in driving movement are active well before movement begins. Muscle activity is some readout of neural activity, yet it remains largely unchanged during preparation. Here we find that during preparation, while the monkey holds still, changes in motor cortical activity cancel out at the level of these population readouts. Motor cortex can thereby prepare the movement without prematurely causing it. Further, we found evidence that this mechanism also operates in dorsal premotor cortex, largely accounting for how preparatory activity is attenuated in primary motor cortex. Selective use of 'output-null' vs. 'output-potent' patterns of activity may thus help control communication to the muscles and between these brain areas. © 2014 Nature America, Inc.","accessed":{"date-parts":[[2022,7,12]]},"author":[{"family":"Kaufman","given":"Matthew T."},{"family":"Churchland","given":"Mark M."},{"family":"Ryu","given":"Stephen I."},{"family":"Shenoy","given":"Krishna V."}],"citation-key":"kaufman14","container-title":"Nature Neuroscience","DOI":"10.1038/nn.3643","ISSN":"10976256","issue":"3","issued":{"date-parts":[[2014,2,2]]},"page":"440-448","PMID":"24487233","publisher":"Nature Publishing Group","title":"Cortical activity in the null space: Permitting preparation without movement","type":"article-journal","URL":"https://www.nature.com/articles/nn.3643","volume":"17"},
  {"id":"kazemipour19","abstract":"Point-scanning two-photon microscopy enables high-resolution imaging within scattering specimens such as the mammalian brain, but sequential acquisition of voxels fundamentally limits its speed. We developed a two-photon imaging technique that scans lines of excitation across a focal plane at multiple angles and computationally recovers high-resolution images, attaining voxel rates of over 1 billion Hz in structured samples. Using a static image as a prior for recording neural activity, we imaged visually evoked and spontaneous glutamate release across hundreds of dendritic spines in mice at depths over 250 µm and frame rates over 1 kHz. Dendritic glutamate transients in anesthetized mice are synchronized within spatially contiguous domains spanning tens of micrometers at frequencies ranging from 1–100 Hz. We demonstrate millisecond-resolved recordings of acetylcholine and voltage indicators, three-dimensional single-particle tracking and imaging in densely labeled cortex. Our method surpasses limits on the speed of raster-scanned imaging imposed by fluorescence lifetime.","accessed":{"date-parts":[[2022,3,9]]},"author":[{"family":"Kazemipour","given":"Abbas"},{"family":"Novak","given":"Ondrej"},{"family":"Flickinger","given":"Daniel"},{"family":"Marvin","given":"Jonathan S."},{"family":"Abdelfattah","given":"Ahmed S."},{"family":"King","given":"Jonathan"},{"family":"Borden","given":"Philip M."},{"family":"Kim","given":"Jeong Jun"},{"family":"Al-Abdullatif","given":"Sarah H."},{"family":"Deal","given":"Parker E."},{"family":"Miller","given":"Evan W."},{"family":"Schreiter","given":"Eric R."},{"family":"Druckmann","given":"Shaul"},{"family":"Svoboda","given":"Karel"},{"family":"Looger","given":"Loren L."},{"family":"Podgorski","given":"Kaspar"}],"citation-key":"kazemipour19","container-title":"Nature Methods","DOI":"10.1038/s41592-019-0493-9","ISSN":"15487105","issue":"8","issued":{"date-parts":[[2019,7,29]]},"page":"778-786","PMID":"31363222","publisher":"Nature Publishing Group","title":"Kilohertz frame-rate two-photon tomography","type":"article-journal","URL":"https://www.nature.com/articles/s41592-019-0493-9","volume":"16"},
  {"id":"kishi22","abstract":"ChRmine, a recently discovered pump-like cation-conducting channelrhodopsin, exhibits puzzling properties (large photocurrents, red-shifted spectrum, and extreme light sensitivity) that have created new opportunities in optogenetics. ChRmine and its homologs function as ion channels but, by primary sequence, more closely resemble ion pump rhodopsins; mechanisms for passive channel conduction in this family have remained mysterious. Here, we present the 2.0 Å resolution cryo-EM structure of ChRmine, revealing architectural features atypical for channelrhodopsins: trimeric assembly, a short transmembrane-helix 3, a twisting extracellular-loop 1, large vestibules within the monomer, and an opening at the trimer interface. We applied this structure to design three proteins (rsChRmine and hsChRmine, conferring further red-shifted and high-speed properties, respectively, and frChRmine, combining faster and more red-shifted performance) suitable for fundamental neuroscience opportunities. These results illuminate the conduction and gating of pump-like channelrhodopsins and point the way toward further structure-guided creation of channelrhodopsins for applications across biology.","accessed":{"date-parts":[[2022,3,16]]},"author":[{"family":"Kishi","given":"Koichiro E."},{"family":"Kim","given":"Yoon Seok"},{"family":"Fukuda","given":"Masahiro"},{"family":"Inoue","given":"Masatoshi"},{"family":"Kusakizako","given":"Tsukasa"},{"family":"Wang","given":"Peter Y."},{"family":"Ramakrishnan","given":"Charu"},{"family":"Byrne","given":"Eamon F.X."},{"family":"Thadhani","given":"Elina"},{"family":"Paggi","given":"Joseph M."},{"family":"Matsui","given":"Toshiki E."},{"family":"Yamashita","given":"Keitaro"},{"family":"Nagata","given":"Takashi"},{"family":"Konno","given":"Masae"},{"family":"Quirin","given":"Sean"},{"family":"Lo","given":"Maisie"},{"family":"Benster","given":"Tyler"},{"family":"Uemura","given":"Tomoko"},{"family":"Liu","given":"Kehong"},{"family":"Shibata","given":"Mikihiro"},{"family":"Nomura","given":"Norimichi"},{"family":"Iwata","given":"So"},{"family":"Nureki","given":"Osamu"},{"family":"Dror","given":"Ron O."},{"family":"Inoue","given":"Keiichi"},{"family":"Deisseroth","given":"Karl"},{"family":"Kato","given":"Hideaki E."}],"citation-key":"kishi22","container-title":"Cell","DOI":"10.1016/j.cell.2022.01.007","ISSN":"10974172","issue":"4","issued":{"date-parts":[[2022,2,17]]},"page":"672-689.e23","PMID":"35114111","publisher":"Elsevier B.V.","title":"Structural basis for channel conduction in the pump-like channelrhodopsin ChRmine","type":"article-journal","URL":"http://www.cell.com/article/S0092867422000319/fulltext","volume":"185"},
  {"id":"klapoetke14","abstract":"Optogenetic tools enable examination of how specific cell types contribute to brain circuit functions. A long-standing question is whether it is possible to independently activate two distinct neural populations in mammalian brain tissue. Such a capability would enable the study of how different synapses or pathways interact to encode information in the brain. Here we describe two channelrhodopsins, Chronos and Chrimson, discovered through sequencing and physiological characterization of opsins from over 100 species of alga. Chrimson's excitation spectrum is red shifted by 45 nm relative to previous channelrhodopsins and can enable experiments in which red light is preferred. We show minimal visual system-mediated behavioral interference when using Chrimson in neurobehavioral studies in Drosophila melanogaster. Chronos has faster kinetics than previous channelrhodopsins yet is effectively more light sensitive. Together these two reagents enable two-color activation of neural spiking and downstream synaptic transmission in independent neural populations without detectable cross-talk in mouse brain slice. © 2014 Nature America, Inc.","accessed":{"date-parts":[[2022,3,15]]},"author":[{"family":"Klapoetke","given":"Nathan C."},{"family":"Murata","given":"Yasunobu"},{"family":"Kim","given":"Sung Soo"},{"family":"Pulver","given":"Stefan R."},{"family":"Birdsey-Benson","given":"Amanda"},{"family":"Cho","given":"Yong Ku"},{"family":"Morimoto","given":"Tania K."},{"family":"Chuong","given":"Amy S."},{"family":"Carpenter","given":"Eric J."},{"family":"Tian","given":"Zhijian"},{"family":"Wang","given":"Jun"},{"family":"Xie","given":"Yinlong"},{"family":"Yan","given":"Zhixiang"},{"family":"Zhang","given":"Yong"},{"family":"Chow","given":"Brian Y."},{"family":"Surek","given":"Barbara"},{"family":"Melkonian","given":"Michael"},{"family":"Jayaraman","given":"Vivek"},{"family":"Constantine-Paton","given":"Martha"},{"family":"Wong","given":"Gane Ka Shu"},{"family":"Boyden","given":"Edward S."}],"citation-key":"klapoetke14","container-title":"Nature Methods","DOI":"10.1038/nmeth.2836","ISSN":"15487105","issue":"3","issued":{"date-parts":[[2014,2,9]]},"page":"338-346","PMID":"24509633","publisher":"Nature Publishing Group","title":"Independent optical excitation of distinct neural populations","type":"article-journal","URL":"https://www.nature.com/articles/nmeth.2836","volume":"11"},
  {"id":"knopfel19","abstract":"A central goal in neuroscience is to determine how the brain’s neuronal circuits generate perception, cognition and emotions and how these lead to appropriate behavioural actions. A methodological platform based on genetically encoded voltage indicators (GEVIs) that enables the monitoring of large-scale circuit dynamics has brought us closer to this ambitious goal. This Review provides an update on the current state of the art and the prospects of emerging optical GEVI imaging technologies.","accessed":{"date-parts":[[2022,9,7]]},"author":[{"family":"Knöpfel","given":"Thomas"},{"family":"Song","given":"Chenchen"}],"citation-key":"knopfel19","container-title":"Nature Reviews Neuroscience","container-title-short":"Nat Rev Neurosci","DOI":"10.1038/s41583-019-0231-4","ISSN":"1471-0048","issue":"12","issued":{"date-parts":[[2019,12]]},"language":"en","license":"2019 Springer Nature Limited","number":"12","page":"719-727","publisher":"Nature Publishing Group","source":"www.nature.com","title":"Optical voltage imaging in neurons: moving from technology development to practical tool","title-short":"Optical voltage imaging in neurons","type":"article-journal","URL":"https://www.nature.com/articles/s41583-019-0231-4","volume":"20"},
  {"id":"kriegeskorte18","abstract":"To learn how cognition is implemented in the brain, we must build computational models that can perform cognitive tasks, and test such models with brain and behavioral experiments. Cognitive science has developed computational models that decompose cognition into functional components. Computational neuroscience has modeled how interacting neurons can implement elementary components of cognition. It is time to assemble the pieces of the puzzle of brain computation and to better integrate these separate disciplines. Modern technologies enable us to measure and manipulate brain activity in unprecedentedly rich ways in animals and humans. However, experiments will yield theoretical insight only when employed to test brain-computational models. Here we review recent work in the intersection of cognitive science, computational neuroscience and artificial intelligence. Computational models that mimic brain information processing during perceptual, cognitive and control tasks are beginning to be developed and tested with brain and behavioral data.","accessed":{"date-parts":[[2022,5,5]]},"author":[{"family":"Kriegeskorte","given":"Nikolaus"},{"family":"Douglas","given":"Pamela K."}],"citation-key":"kriegeskorte18","container-title":"Nature Neuroscience","DOI":"10.1038/s41593-018-0210-5","ISSN":"15461726","issue":"9","issued":{"date-parts":[[2018,8,20]]},"page":"1148-1160","PMID":"30127428","publisher":"Nature Publishing Group","title":"Cognitive computational neuroscience","type":"article-journal","URL":"https://www.nature.com/articles/s41593-018-0210-5","volume":"21"},
  {"id":"krook-magnuson13","abstract":"Temporal lobe epilepsy is the most common type of epilepsy in adults, is often medically refractory, and due to broad actions and long-time scales, current systemic treatments have major negative side-effects. However, temporal lobe seizures tend to arise from discrete regions before overt clinical behaviour, making temporally and spatially specific treatment theoretically possible. Here we report the arrest of spontaneous seizures using a real-time, closed-loop, response system and in vivo optogenetics in a mouse model of temporal lobe epilepsy. Either optogenetic inhibition of excitatory principal cells, or activation of a subpopulation of GABAergic cells representing <5% of hippocampal neurons, stops seizures rapidly upon light application. These results demonstrate that spontaneous temporal lobe seizures can be detected and terminated by modulating specific cell populations in a spatially restricted manner. A clinical approach built on these principles may overcome many of the side-effects of currently available treatment options. © 2013 Macmillan Publishers Limited. All rights reserved.","accessed":{"date-parts":[[2020,9,11]]},"author":[{"family":"Krook-Magnuson","given":"Esther"},{"family":"Armstrong","given":"Caren"},{"family":"Oijala","given":"Mikko"},{"family":"Soltesz","given":"Ivan"}],"citation-key":"krook-magnuson13","container-title":"Nature Communications","DOI":"10.1038/ncomms2376","ISSN":"20411723","issue":"1","issued":{"date-parts":[[2013,1,22]]},"page":"1-8","PMID":"23340416","publisher":"Nature Publishing Group","title":"On-demand optogenetic control of spontaneous seizures in temporal lobe epilepsy","type":"article-journal","URL":"www.nature.com/naturecommunications","volume":"4"},
  {"id":"kumar13","abstract":"Neuronal networks confront researchers with an overwhelming complexity of interactions between their elements. A common approach to understanding neuronal processing is to reduce complexity by defining subunits and infer their functional role by selectively modulating them. However, this seemingly straightforward approach may lead to confusing results if the network exhibits parallel pathways leading to recurrent connectivity. We demonstrate limits of the selective modulation approach and argue that, even though highly successful in some instances, the approach fails in networks with complex connectivity. We argue to refine experimental techniques by carefully considering the structural features of the neuronal networks involved. Such methods could dramatically increase the effectiveness of selective modulation and may lead to a mechanistic understanding of principles underlying brain function. © 2013 Elsevier Ltd.","accessed":{"date-parts":[[2020,10,9]]},"author":[{"family":"Kumar","given":"Arvind"},{"family":"Vlachos","given":"Ioannis"},{"family":"Aertsen","given":"Ad"},{"family":"Boucsein","given":"Clemens"}],"citation-key":"kumar13","container-title":"Trends in Neurosciences","DOI":"10.1016/j.tins.2013.06.005","ISSN":"1878108X","issue":"10","issued":{"date-parts":[[2013,10,1]]},"page":"579-586","PMID":"23876423","publisher":"Elsevier Ltd","title":"Challenges of understanding brain function by selective modulation of neuronal subpopulations","type":"article-journal","volume":"36"},
  {"id":"lai21","abstract":"Laser scanning is used in advanced biological microscopy to deliver superior imaging contrast, resolution and sensitivity. However, it is challenging to scale up the scanning speed required for interrogating a large and heterogeneous population of biological specimens or capturing highly dynamic biological processes at high spatiotemporal resolution. Bypassing the speed limitation of traditional mechanical methods, free-space angular-chirp-enhanced delay (FACED) is an all-optical, passive and reconfigurable laser-scanning approach that has been successfully applied in different microscopy modalities at an ultrafast line-scan rate of 1–80 MHz. Optimal FACED imaging performance requires optimized experimental design and implementation to enable specific high-speed applications. In this protocol, we aim to disseminate information allowing FACED to be applied to a broader range of imaging modalities. We provide (i) a comprehensive guide and design specifications for the FACED hardware; (ii) step-by-step optical implementations of the FACED module including the key custom components; and (iii) the overall image acquisition and reconstruction pipeline. We illustrate two practical imaging configurations: multimodal FACED imaging flow cytometry (bright-field, fluorescence and second-harmonic generation) and kHz 2D two-photon fluorescence microscopy. Users with basic experience in optical microscope operation and software engineering should be able to complete the setup of the FACED imaging hardware and software in ~2–3 months.","accessed":{"date-parts":[[2022,3,9]]},"author":[{"family":"Lai","given":"Queenie T.K."},{"family":"Yip","given":"Gwinky G.K."},{"family":"Wu","given":"Jianglai"},{"family":"Wong","given":"Justin S.J."},{"family":"Lo","given":"Michelle C.K."},{"family":"Lee","given":"Kelvin C.M."},{"family":"Le","given":"Tony T.H.D."},{"family":"So","given":"Hayden K.H."},{"family":"Ji","given":"Na"},{"family":"Tsia","given":"Kevin K."}],"citation-key":"lai21","container-title":"Nature Protocols","DOI":"10.1038/s41596-021-00576-4","ISSN":"17502799","issue":"9","issued":{"date-parts":[[2021,8,2]]},"page":"4227-4264","PMID":"34341580","publisher":"Nature Publishing Group","title":"High-speed laser-scanning biological microscopy using FACED","type":"article-journal","URL":"https://www.nature.com/articles/s41596-021-00576-4","volume":"16"},
  {"id":"li22","abstract":"Optogenetic methods provide efficient cell-specific modulations, and the ability of simultaneous neural activation and inhibition in the same brain region of freely moving animals is highly desirable. Here we report bidirectional neuronal activity manipulation accomplished by a wireless, dual-color optogenetic probe in synergy with the co-expression of two spectrally distinct opsins (ChrimsonR and stGtACR2) in a rodent model. The flexible probe comprises vertically assembled, thin-film microscale light-emitting diodes with a lateral dimension of 125 × 180 µm2, showing colocalized red and blue emissions and enabling chronic in vivo operations with desirable biocompatibilities. Red or blue irradiations deterministically evoke or silence neurons co-expressing the two opsins. The probe interferes with dopaminergic neurons in the ventral tegmental area of mice, increasing or decreasing dopamine levels. Such bidirectional regulations further generate rewarding and aversive behaviors and interrogate social interactions among multiple mice. These technologies create numerous opportunities and implications for brain research. Simultaneous neural activation and inhibition in the same brain region of animals is highly desirable. Here the authors report a wireless, dual-colour optogenetic probe with the co-expression of two spectrally distinct opsins to allow for bidirectional neuronal activity manipulation in a rodent model.","accessed":{"date-parts":[[2022,8,2]]},"author":[{"family":"Li","given":"Lizhu"},{"family":"Lu","given":"Lihui"},{"family":"Ren","given":"Yuqi"},{"family":"Tang","given":"Guo"},{"family":"Zhao","given":"Yu"},{"family":"Cai","given":"Xue"},{"family":"Shi","given":"Zhao"},{"family":"Ding","given":"He"},{"family":"Liu","given":"Changbo"},{"family":"Cheng","given":"Dali"},{"family":"Xie","given":"Yang"},{"family":"Wang","given":"Huachun"},{"family":"Fu","given":"Xin"},{"family":"Yin","given":"Lan"},{"family":"Luo","given":"Minmin"},{"family":"Sheng","given":"Xing"}],"citation-key":"li22","container-title":"Nature Communications 2022 13:1","DOI":"10.1038/s41467-022-28539-7","ISSN":"2041-1723","issue":"1","issued":{"date-parts":[[2022,2,11]]},"page":"1-14","PMID":"35149715","publisher":"Nature Publishing Group","title":"Colocalized, bidirectional optogenetic modulations in freely behaving mice with a wireless dual-color optoelectronic probe","type":"article-journal","URL":"https://www.nature.com/articles/s41467-022-28539-7","volume":"13"},
  {"id":"lin13","abstract":"Channelrhodopsins (ChRs) are used to optogenetically depolarize neurons. We engineered a variant of ChR, denoted red-activatable ChR (ReaChR), that is optimally excited with orange to red light (λ ∼590-630 nm) and offers improved membrane trafficking, higher photocurrents and faster kinetics compared to existing red-shifted ChRs. Red light is less scattered by tissue and is absorbed less by blood than the blue to green wavelengths that are required by other ChR variants. We used ReaChR expressed in the vibrissa motor cortex to drive spiking and vibrissa motion in awake mice when excited with red light through intact skull. Precise vibrissa movements were evoked by expressing ReaChR in the facial motor nucleus in the brainstem and illumination with red light through the external auditory canal. Thus, ReaChR enables transcranial optical activation of neurons in deep brain structures without the need to surgically thin the skull, form a transcranial window orimplant optical fibers. © 2013 Nature America, Inc. All rights reserved.","accessed":{"date-parts":[[2022,3,15]]},"author":[{"family":"Lin","given":"John Y."},{"family":"Knutsen","given":"Per Magne"},{"family":"Muller","given":"Arnaud"},{"family":"Kleinfeld","given":"David"},{"family":"Tsien","given":"Roger Y."}],"citation-key":"lin13","container-title":"Nature Neuroscience","DOI":"10.1038/nn.3502","ISSN":"10976256","issue":"10","issued":{"date-parts":[[2013,9,1]]},"page":"1499-1508","PMID":"23995068","publisher":"Nature Publishing Group","title":"ReaChR: A red-shifted variant of channelrhodopsin enables deep transcranial optogenetic excitation","type":"article-journal","URL":"https://www.nature.com/articles/nn.3502","volume":"16"},
  {"id":"liu15","abstract":"Optimizing light delivery for optogenetics is critical in order to accurately stimulate the neurons of interest while reducing nonspecific effects such as tissue heating or photodamage. Light distribution is typically predicted using the assumption of tissue homogeneity, which oversimplifies light transport in heterogeneous brain. Here, we present an open-source 3D simulation platform, OptogenSIM, which eliminates this assumption. This platform integrates a voxel-based 3D Monte Carlo model, generic optical property models of brain tissues, and a well-defined 3D mouse brain tissue atlas. The application of this platform in brain data models demonstrates that brain heterogeneity has moderate to significant impact depending on application conditions. Estimated light density contours can show the region of any specified power density in the 3D brain space and thus can help optimize the light delivery settings, such as the optical fiber position, fiber diameter, fiber numerical aperture, light wavelength and power. OptogenSIM is freely available and can be easily adapted to incorporate additional brain atlases.","accessed":{"date-parts":[[2020,7,22]]},"author":[{"family":"Liu","given":"Yuming"},{"family":"Jacques","given":"Steven L."},{"family":"Azimipour","given":"Mehdi"},{"family":"Rogers","given":"Jeremy D."},{"family":"Pashaie","given":"Ramin"},{"family":"Eliceiri","given":"Kevin W."}],"citation-key":"liu15","container-title":"Biomedical Optics Express","DOI":"10.1364/boe.6.004859","ISSN":"2156-7085","issue":"12","issued":{"date-parts":[[2015,12,1]]},"page":"4859","publisher":"The Optical Society","title":"OptogenSIM: a 3D Monte Carlo simulation platform for light delivery design in optogenetics","type":"article-journal","URL":"http://www.fil.ion.ucl.ac.uk/spm/software/.","volume":"6"},
  {"id":"lundqvist16","abstract":"Working memory is thought to result from sustained neuron spiking. However, computational models suggest complex dynamics with discrete oscillatory bursts. We analyzed local field potential (LFP) and spiking from the prefrontal cortex (PFC) of monkeys performing a working memory task. There were brief bursts of narrow-band gamma oscillations (45–100 Hz), varied in time and frequency, accompanying encoding and re-activation of sensory information. They appeared at a minority of recording sites associated with spiking reflecting the to-be-remembered items. Beta oscillations (20–35 Hz) also occurred in brief, variable bursts but reflected a default state interrupted by encoding and decoding. Only activity of neurons reflecting encoding/decoding correlated with changes in gamma burst rate. Thus, gamma bursts could gate access to, and prevent sensory interference with, working memory. This supports the hypothesis that working memory is manifested by discrete oscillatory dynamics and spiking, not sustained activity.","accessed":{"date-parts":[[2022,3,21]]},"author":[{"family":"Lundqvist","given":"Mikael"},{"family":"Rose","given":"Jonas"},{"family":"Herman","given":"Pawel"},{"family":"Brincat","given":"Scott L L."},{"family":"Buschman","given":"Timothy J J."},{"family":"Miller","given":"Earl K K."}],"citation-key":"lundqvist16","container-title":"Neuron","DOI":"10.1016/j.neuron.2016.02.028","ISSN":"10974199","issue":"1","issued":{"date-parts":[[2016,4,6]]},"page":"152-164","PMID":"26996084","publisher":"Cell Press","title":"Gamma and Beta Bursts Underlie Working Memory","type":"article-journal","volume":"90"},
  {"id":"lundqvist22","abstract":"Working memories have long been thought to be maintained by persistent spiking. However, mounting evidence from multiple-electrode recording (and single-trial analyses) shows that the underlying spiking is better characterized by intermittent bursts of activity. A counterargument suggested this intermittent activity is at odds with observations that spike-time variability reduces during task performance. However, this counterargument rests on assumptions, such as randomness in the timing of the bursts, that may not be correct. Thus, we analyzed spiking and LFPs from the prefrontal cortex (PFC) of monkeys to determine if task-related reductions in variability can co-exist with intermittent spiking. We found that it does because both spiking and associated gamma bursts were task-modulated, not random. In fact, the task-related reduction in spike variability could be explained by a related reduction in gamma burst variability. Our results provide further support for the intermittent activity models of working memory as well as novel mechanistic insights into how spike variability is reduced during cognitive tasks.","accessed":{"date-parts":[[2022,3,21]]},"author":[{"family":"Lundqvist","given":"Mikael"},{"family":"Rose","given":"Jonas"},{"family":"Warden","given":"Melissa"},{"family":"Buschman","given":"Tim"},{"family":"Herman","given":"Pawel"}],"citation-key":"lundqvist22","DOI":"10.1101/2022.02.18.481088","issued":{"date-parts":[[2022]]},"title":"Reduced variability of bursting activity during working memory","type":"article-journal","URL":"https://doi.org/10.1101/2022.02.18.481088"},
  {"id":"luo19","abstract":"We develop a system-level approach to modelling optogenetic-neurons firing behaviour in in-vivo conditions. This approach contains three sub-modules: 1) a Mie/Rayleigh scattering mode of light penetration in tissue; 2) a classic likelihood Poisson spiking train model; 3) a 4-state model of the Channelrhodopsin-2 (ChR2) channel added to a CA3 neuron Hodgkin-Huxley model. We first investigate opto-neurons lightto-spike mechanisms in an in-vivo model: the background noise (synaptic currents) play a dominant role in generating spikes rather than light intensities as for in-vitro conditions (Typically the required light intensity is less than 0.3 mW/mm2 for in-vivo). Then the spiking fidelity is analyzed for different background noise levels. Next, by combining light penetration profiles, we show how neuron firing rates decay as tissue distance increases, for a 2D dimensional cross-section. This preliminary data clearly demonstrate that at given light stimulation protocol, the maximum effected distance in-vivo is 250 μm with small frequency decay rates, while for in-vitro is 50μm with considerable frequency decay rates. Therefore, the developed model can be used for designing sensible light stimulation strategies in-vivo and opto-electronics systems.","accessed":{"date-parts":[[2022,3,10]]},"author":[{"family":"Luo","given":"Jun Wen"},{"family":"Nikolic","given":"Konstantin"},{"family":"Degenaar","given":"Patrick"}],"citation-key":"luo19","container-title":"Proceedings of the Annual International Conference of the IEEE Engineering in Medicine and Biology Society, EMBS","DOI":"10.1109/EMBC.2019.8856664","ISBN":"978-1-5386-1311-5","ISSN":"1557170X","issued":{"date-parts":[[2019,7,1]]},"page":"6136-6140","PMID":"31947244","publisher":"Institute of Electrical and Electronics Engineers Inc.","title":"Modelling Optogenetic Subthreshold Effects","type":"paper-conference"},
  {"id":"maaten08","abstract":"We present a new technique called \"t-SNE\" that visualizes high-dimensional data by giving each datapoint a location in a two or three-dimensional map. The technique is a variation of Stochastic Neighbor Embedding (Hinton and Roweis, 2002) that is much easier to optimize, and produces significantly better visualizations by reducing the tendency to crowd points together in the center of the map. t-SNE is better than existing techniques at creating a single map that reveals structure at many different scales. This is particularly important for high-dimensional data that lie on several different, but related, low-dimensional manifolds, such as images ofobjects from multiple classes seen from multiple viewpoints. For visualizing the structure of very large data sets, we show how t-SNE can use random walks on neighborhood graphs to allow the implicit structure of all of the data to influence the way in which a subset of the data is displayed. We illustrate the performance of t-SNE on a wide variety of data sets and compare it with many other non-parametric visualization techniques, including Sammon mapping, Isomap, and Locally Linear Embedding. The visualizations produced by t-SNE are significantly better than those produced by the other techniques on almost all of the data sets.","accessed":{"date-parts":[[2022,9,7]]},"author":[{"family":"Maaten","given":"Laurens","dropping-particle":"van der"},{"family":"Hinton","given":"Geoffrey"}],"citation-key":"maaten08","container-title":"Journal of Machine Learning Research","ISSN":"1533-7928","issue":"86","issued":{"date-parts":[[2008]]},"page":"2579-2605","source":"jmlr.csail.mit.edu","title":"Visualizing Data using t-SNE","type":"article-journal","URL":"http://jmlr.org/papers/v9/vandermaaten08a.html","volume":"9"},
  {"id":"mager18","abstract":"Optogenetics revolutionizes basic research in neuroscience and cell biology and bears potential for medical applications. We develop mutants leading to a unifying concept for the construction of various channelrhodopsins with fast closing kinetics. Due to different absorption maxima these channelrhodopsins allow fast neural photoactivation over the whole range of the visible spectrum. We focus our functional analysis on the fast-switching, red light-activated Chrimson variants, because red light has lower light scattering and marginal phototoxicity in tissues. We show paradigmatically for neurons of the cerebral cortex and the auditory nerve that the fast Chrimson mutants enable neural stimulation with firing frequencies of several hundred Hz. They drive spiking at high rates and temporal fidelity with low thresholds for stimulus intensity and duration. Optical cochlear implants restore auditory nerve activity in deaf mice. This demonstrates that the mutants facilitate neuroscience research and future medical applications such as hearing restoration.","accessed":{"date-parts":[[2022,3,15]]},"author":[{"family":"Mager","given":"Thomas"},{"family":"Morena","given":"David Lopez De La"},{"family":"Senn","given":"Verena"},{"family":"Schlotte","given":"Johannes"},{"family":"Derrico","given":"Anna"},{"family":"Feldbauer","given":"Katrin"},{"family":"Wrobel","given":"Christian"},{"family":"Jung","given":"Sangyong"},{"family":"Bodensiek","given":"Kai"},{"family":"Rankovic","given":"Vladan"},{"family":"Browne","given":"Lorcan"},{"family":"Huet","given":"Antoine"},{"family":"Jüttner","given":"Josephine"},{"family":"Wood","given":"Phillip G."},{"family":"Letzkus","given":"Johannes J."},{"family":"Moser","given":"Tobias"},{"family":"Bamberg","given":"Ernst"}],"citation-key":"mager18","container-title":"Nature Communications","DOI":"10.1038/s41467-018-04146-3","ISSN":"20411723","issue":"1","issued":{"date-parts":[[2018,5,1]]},"page":"1-14","PMID":"29717130","publisher":"Nature Publishing Group","title":"High frequency neural spiking and auditory signaling by ultrafast red-shifted optogenetics","type":"article-journal","URL":"https://www.nature.com/articles/s41467-018-04146-3","volume":"9"},
  {"id":"martinez-garcia20","abstract":"Most sensory information destined for the neocortex is relayed through the thalamus, where considerable transformation occurs1,2. One means of transformation involves interactions between excitatory thalamocortical neurons that carry data to the cortex and inhibitory neurons of the thalamic reticular nucleus (TRN) that regulate the flow of those data3–6. Although the importance of the TRN has long been recognised7–9, understanding of its cell types, their organization and their functional properties has lagged behind that of the thalamocortical systems they control. Here we address this by investigating the somatosensory and visual circuits of the TRN in mice. In the somatosensory TRN we observed two groups of genetically defined neurons that are topographically segregated and physiologically distinct, and that connect reciprocally with independent thalamocortical nuclei through dynamically divergent synapses. Calbindin-expressing cells—located in the central core—connect with the ventral posterior nucleus, the primary somatosensory thalamocortical relay. By contrast, somatostatin-expressing cells—which reside along the surrounding edges of the TRN—synapse with the posterior medial thalamic nucleus, a higher-order structure that carries both top-down and bottom-up information10–12. The two TRN cell groups process their inputs in pathway-specific ways. Synapses from the ventral posterior nucleus to central TRN cells transmit rapid excitatory currents that depress deeply during repetitive activity, driving phasic spike output. Synapses from the posterior medial thalamic nucleus to edge TRN cells evoke slower, less depressing excitatory currents that drive more persistent spiking. Differences in the intrinsic physiology of TRN cell types, including state-dependent bursting, contribute to these output dynamics. The processing specializations of these two somatosensory TRN subcircuits therefore appear to be tuned to the signals they carry—a primary central subcircuit tuned to discrete sensory events, and a higher-order edge subcircuit tuned to temporally distributed signals integrated from multiple sources. The structure and function of visual TRN subcircuits closely resemble those of the somatosensory TRN. These results provide insights into how subnetworks of TRN neurons may differentially process distinct classes of thalamic information.","accessed":{"date-parts":[[2022,3,21]]},"author":[{"family":"Martinez-Garcia","given":"Rosa I."},{"family":"Voelcker","given":"Bettina"},{"family":"Zaltsman","given":"Julia B."},{"family":"Patrick","given":"Saundra L."},{"family":"Stevens","given":"Tanya R."},{"family":"Connors","given":"Barry W."},{"family":"Cruikshank","given":"Scott J."}],"citation-key":"martinez-garcia20","container-title":"Nature","DOI":"10.1038/s41586-020-2512-5","ISSN":"14764687","issue":"7818","issued":{"date-parts":[[2020,7,22]]},"page":"813-818","PMID":"32699410","publisher":"Nature Publishing Group","title":"Two dynamically distinct circuits drive inhibition in the sensory thalamus","type":"article-journal","URL":"https://www.nature.com/articles/s41586-020-2512-5","volume":"583"},
  {"id":"mathis18","abstract":"Quantifying behavior is crucial for many applications in neuroscience. Videography provides easy methods for the observation and recording of animal behavior in diverse settings, yet extracting particular aspects of a behavior for further analysis can be highly time consuming. In motor control studies, humans or other animals are often marked with reflective markers to assist with computer-based tracking, but markers are intrusive, and the number and location of the markers must be determined a priori. Here we present an efficient method for markerless pose estimation based on transfer learning with deep neural networks that achieves excellent results with minimal training data. We demonstrate the versatility of this framework by tracking various body parts in multiple species across a broad collection of behaviors. Remarkably, even when only a small number of frames are labeled (~200), the algorithm achieves excellent tracking performance on test frames that is comparable to human accuracy.","accessed":{"date-parts":[[2022,9,7]]},"author":[{"family":"Mathis","given":"Alexander"},{"family":"Mamidanna","given":"Pranav"},{"family":"Cury","given":"Kevin M."},{"family":"Abe","given":"Taiga"},{"family":"Murthy","given":"Venkatesh N."},{"family":"Mathis","given":"Mackenzie Weygandt"},{"family":"Bethge","given":"Matthias"}],"citation-key":"mathis18","container-title":"Nature Neuroscience","container-title-short":"Nat Neurosci","DOI":"10.1038/s41593-018-0209-y","ISSN":"1546-1726","issue":"9","issued":{"date-parts":[[2018,9]]},"language":"en","license":"2018 The Author(s)","number":"9","page":"1281-1289","publisher":"Nature Publishing Group","source":"www.nature.com","title":"DeepLabCut: markerless pose estimation of user-defined body parts with deep learning","title-short":"DeepLabCut","type":"article-journal","URL":"https://www.nature.com/articles/s41593-018-0209-y","volume":"21"},
  {"id":"mazzoni15a","abstract":"Leaky integrate-and-fire (LIF) network models are commonly used to study how the spiking dynamics of neural networks changes with stimuli, tasks or dynamic network states. However, neurophysiological studies in vivo often rather measure the mass activity of neuronal microcircuits with the local field potential (LFP). Given that LFPs are generated by spatially separated currents across the neuronal membrane, they cannot be computed directly from quantities defined in models of point-like LIF neurons. Here, we explore the best approximation for predicting the LFP based on standard output from point-neuron LIF networks. To search for this best “LFP proxy”, we compared LFP predictions from candidate proxies based on LIF network output (e.g, firing rates, membrane potentials, synaptic currents) with “ground-truth” LFP obtained when the LIF network synaptic input currents were injected into an analogous three-dimensional (3D) network model of multi-compartmental neurons with realistic morphology, spatial distributions of somata and synapses. We found that a specific fixed linear combination of the LIF synaptic currents provided an accurate LFP proxy, accounting for most of the variance of the LFP time course observed in the 3D network for all recording locations. This proxy performed well over a broad set of conditions, including substantial variations of the neuronal morphologies. Our results provide a simple formula for estimating the time course of the LFP from LIF network simulations in cases where a single pyramidal population dominates the LFP generation, and thereby facilitate quantitative comparison between computational models and experimental LFP recordings in vivo.","accessed":{"date-parts":[[2021,10,25]]},"author":[{"family":"Mazzoni","given":"Alberto"},{"family":"Lindén","given":"Henrik"},{"family":"Cuntz","given":"Hermann"},{"family":"Lansner","given":"Anders"},{"family":"Panzeri","given":"Stefano"},{"family":"Einevoll","given":"Gaute T."}],"citation-key":"mazzoni15a","container-title":"PLOS Computational Biology","DOI":"10.1371/JOURNAL.PCBI.1004584","ISSN":"1553-7358","issue":"12","issued":{"date-parts":[[2015]]},"page":"e1004584","publisher":"Public Library of Science","title":"Computing the Local Field Potential (LFP) from Integrate-and-Fire Network Models","type":"article-journal","URL":"https://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1004584","volume":"11"},
  {"id":"meikle13","abstract":"A review of reported tissue optical properties summarizes the wavelength-dependent behavior of scattering and absorption. Formulae are presented for generating the optical properties of a generic tissue with variable amounts of absorbing chromophores (blood, water, melanin, fat, yellow pigments) and a variable balance between small-scale scatterers and large-scale scatterers in the ultrastructures of cells and tissues. © 2013 Institute of Physics and Engineering in Medicine.","accessed":{"date-parts":[[2022,3,30]]},"author":[{"family":"Meikle","given":"Steven R"},{"family":"Sossi","given":"Vesna"},{"family":"Roncali","given":"Emilie"}],"citation-key":"meikle13","container-title":"Physics in Medicine & Biology","DOI":"10.1088/0031-9155/58/11/R37","ISSN":"0031-9155","issue":"11","issued":{"date-parts":[[2013,5,10]]},"page":"R37","PMID":"23666068","publisher":"IOP Publishing","title":"Optical properties of biological tissues: a review","type":"article-journal","URL":"https://iopscience.iop.org/article/10.1088/0031-9155/58/11/R37","volume":"58"},
  {"id":"montaseri13","abstract":"Synchronization and emergence of a collective mode is a general phenomenon, frequently observed in ensembles of coupled self-sustained oscillators of various natures. In several circumstances, in particular in cases of neurological pathologies, this state of the active medium is undesirable. Destruction of this state by a specially designed stimulation is a challenge of high clinical relevance. Typically, the precise effect of an external action on the ensemble is unknown, since the microscopic description of the oscillators and their interactions are not available. We show that, desynchronization in case of a large degree of uncertainty about important features of the system is nevertheless possible; it can be achieved by virtue of a feedback loop with an additional adaptation of parameters. The adaptation also ensures desynchronization of ensembles with non-stationary, time-varying parameters. We perform the stability analysis of the feedback-controlled system and demonstrate efficient destruction of synchrony for several models, including those of spiking and bursting neurons. © 2013 AIP Publishing LLC.","accessed":{"date-parts":[[2022,4,26]]},"author":[{"family":"Montaseri","given":"Ghazal"},{"family":"Javad Yazdanpanah","given":"Mohammad"},{"family":"Pikovsky","given":"Arkady"},{"family":"Rosenblum","given":"Michael"}],"citation-key":"montaseri13","container-title":"Chaos","DOI":"10.1063/1.4817393","ISSN":"10541500","issue":"3","issued":{"date-parts":[[2013,8,13]]},"page":"033122","PMID":"24089958","publisher":"American Institute of PhysicsAIP","title":"Synchrony suppression in ensembles of coupled oscillators via adaptive vanishing feedback","type":"article-journal","URL":"https://aip.scitation.org/doi/abs/10.1063/1.4817393","volume":"23"},
  {"id":"muller15","accessed":{"date-parts":[[2022,6,1]]},"author":[{"family":"Muller","given":"Eilif"},{"family":"Bednar","given":"James A."},{"family":"Diesmann","given":"Markus"},{"family":"Gewaltig","given":"Marc Oliver"},{"family":"Hines","given":"Michael"},{"family":"Davison","given":"Andrew P."}],"citation-key":"muller15","container-title":"Frontiers in Neuroinformatics","DOI":"10.3389/fninf.2015.00011","ISSN":"16625196","issue":"APR","issued":{"date-parts":[[2015,4,14]]},"page":"11","PMID":"25926788","publisher":"Frontiers Research Foundation","title":"Python in neuroscience","type":"article-journal","volume":"9"},
  {"id":"newman15","abstract":"Optogenetic techniques enable precise excitation and inhibition of firing in specified neuronal populations and artifact-free recording of firing activity. Several studies have suggested that optical stimulation provides the precision and dynamic range requisite for closed-loop neuronal control, but no approach yet permits feedback control of neuronal firing. Here we present the ‘optoclamp’, a feedback control technology that provides continuous, real-time adjustments of bidirectional optical stimulation in order to lock spiking activity at specified targets over timescales ranging from seconds to days. We demonstrate how this system can be used to decouple neuronal firing levels from ongoing changes in network excitability due to multi-hour periods of glutamatergic or GABAergic neurotransmission blockade in vitro as well as impinging vibrissal sensory drive in vivo. This technology enables continuous, precise optical control of firing in neuronal populations in order to disentangle causally related variables of circuit activation in a physiologically and ethologically relevant manner.","author":[{"family":"Newman","given":"Jonathan P."},{"family":"Fong","given":"Ming Fai"},{"family":"Millard","given":"Daniel C."},{"family":"Whitmire","given":"Clarissa J."},{"family":"Stanley","given":"Garrett B."},{"family":"Potter","given":"Steve M."}],"citation-key":"newman15","container-title":"eLife","DOI":"10.7554/eLife.07192","ISSN":"2050084X","issued":{"date-parts":[[2015]]},"PMID":"26140329","title":"Optogenetic feedback control of neural activity","type":"article-journal"},
  {"id":"neymotin20","abstract":"Magneto-and electro-encephalography (MEG/EEG) non-invasively record human brain activity with millisecond resolution providing reliable markers of healthy and disease states. Relating these macroscopic signals to underlying cellular-and circuit-level generators is a limitation that constrains using MEG/EEG to reveal novel principles of information processing or to translate findings into new therapies for neuropathology. To address this problem, we built Human Neocortical Neurosolver (HNN, https://hnn.brown.edu) software. HNN has a graphical user interface designed to help researchers and clinicians interpret the neural origins of MEG/EEG. HNN’s core is a neocortical circuit model that accounts for biophysical origins of electrical currents generating MEG/EEG. Data can be directly compared to simulated signals and parameters easily manipulated to develop/test hypotheses on a signal’s origin. Tutorials teach users to simulate commonly measured signals, including event related potentials and brain rhythms. HNN’s ability to associate signals across scales makes it a unique tool for translational neuroscience research.","accessed":{"date-parts":[[2021,5,11]]},"author":[{"family":"Neymotin","given":"Samuel A."},{"family":"Daniels","given":"Dylan S."},{"family":"Caldwell","given":"Blake"},{"family":"McDougal","given":"Robert A."},{"family":"Carnevale","given":"Nicholas T."},{"family":"Jas","given":"Mainak"},{"family":"Moore","given":"Christopher I."},{"family":"Hines","given":"Michael L."},{"family":"Hämäläinen","given":"Matti"},{"family":"Jones","given":"Stephanie R."}],"citation-key":"neymotin20","container-title":"eLife","DOI":"10.7554/eLife.51214","ISSN":"2050084X","issued":{"date-parts":[[2020,1,1]]},"PMID":"31967544","publisher":"eLife Sciences Publications Ltd","title":"Human neocortical neurosolver (HNN), a new software tool for interpreting the cellular and network origin of human MEG/EEG data","type":"article-journal","volume":"9"},
  {"id":"nikolic13","abstract":"Optogenetics is a new neurotechnology innovation based on the creation of light sensitivity of neurons using gene technologies and remote light activation. Optogenetics allows for the first time straightforward targeted neural stimulation with practically no interference between multiple stimulation points since either light beam can be finely confined or the expression of light sensitive ion channels and pumps can be genetically targeted. Here we present a generalised computational modeling technique for various types of optogenetic mechanisms, which was implemented in the NEURON simulation environment. It was demonstrated on the example of a two classical mechanisms for cells optical activation and silencing: channelrhodopsin-2 (ChR2) and halorhodopsin (NpHR).We theoretically investigate the dynamics of the neural response of a layer 5 cortical pyramidal neuron (L5) to four different types of illuminations: 1) wide-field whole cell illumination 2) wide-field apical dendritic illumination 3) focal somatic illumination and 4) focal axon initial segment (AIS) illumination. We show that whole-cell illumination of halorhodopsin most effectively hyperpolarizes the neuron and is able to silence the cell even when driving input is present. However, when channelrhodopsin-2 and halorhodopsin are concurrently active, the relative location of each illumination determines whether the response is modulated with a balance towards depolarization. The methodology developed in this study will be significant to interpret and design optogenetic experiments and in the field of neuroengineering in general. © 2013 IEEE.","accessed":{"date-parts":[[2022,3,30]]},"author":[{"family":"Nikolic","given":"Konstantin"},{"family":"Jarvis","given":"Sarahfs"},{"family":"Grossman","given":"Nir"},{"family":"Schultz","given":"Simon"}],"citation-key":"nikolic13","container-title":"Proceedings of the Annual International Conference of the IEEE Engineering in Medicine and Biology Society, EMBS","DOI":"10.1109/EMBC.2013.6610903","ISBN":"978-1-4577-0216-7","ISSN":"1557170X","issued":{"date-parts":[[2013]]},"page":"5934-5937","title":"Computational models of optogenetic tools for controlling neural circuits with light","type":"paper-conference"},
  {"id":"oby19","accessed":{"date-parts":[[2022,9,7]]},"author":[{"family":"Oby","given":"Emily R."},{"family":"Golub","given":"Matthew D."},{"family":"Hennig","given":"Jay A."},{"family":"Degenhart","given":"Alan D."},{"family":"Tyler-Kabara","given":"Elizabeth C."},{"family":"Yu","given":"Byron M."},{"family":"Chase","given":"Steven M."},{"family":"Batista","given":"Aaron P."}],"citation-key":"oby19","container-title":"Proceedings of the National Academy of Sciences","DOI":"10.1073/pnas.1820296116","issue":"30","issued":{"date-parts":[[2019,7,23]]},"page":"15210-15215","publisher":"Proceedings of the National Academy of Sciences","source":"pnas.org (Atypon)","title":"New neural activity patterns emerge with long-term learning","type":"article-journal","URL":"https://www.pnas.org/doi/full/10.1073/pnas.1820296116","volume":"116"},
  {"id":"ortiz21","abstract":"In this article, we present a visual introduction to Gaussian Belief Propagation (GBP), an approximate probabilistic inference algorithm that operates by passing messages between the nodes of arbitrarily structured factor graphs. A special case of loopy belief propagation, GBP updates rely only on local information and will converge independently of the message schedule. Our key argument is that, given recent trends in computing hardware, GBP has the right computational properties to act as a scalable distributed probabilistic inference framework for future machine learning systems.","accessed":{"date-parts":[[2022,6,23]]},"author":[{"family":"Ortiz","given":"Joseph"},{"family":"Evans","given":"Talfan"},{"family":"Davison","given":"Andrew J."}],"citation-key":"ortiz21","DOI":"10.48550/arxiv.2107.02308","issued":{"date-parts":[[2021,7,5]]},"title":"A visual introduction to Gaussian Belief Propagation","type":"article-journal","URL":"https://arxiv.org/abs/2107.02308v1"},
  {"id":"packer13","abstract":"Optogenetic approaches promise to revolutionize neuroscience by using light to manipulate neural activity in genetically or functionally defined neurons with millisecond precision. Harnessing the full potential of optogenetic tools, however, requires light to be targeted to the right neurons at the right time. Here we discuss some barriers and potential solutions to this problem. We review methods for targeting the expression of light-activatable molecules to specific cell types, under genetic, viral or activity-dependent control. Next we explore new ways to target light to individual neurons to allow their precise activation and inactivation. These techniques provide a precision in the temporal and spatial activation of neurons that was not achievable in previous experiments. In combination with simultaneous recording and imaging techniques, these strategies will allow us to mimic the natural activity patterns of neurons in vivo, enabling previously impossible 'dream experiments'. © 2013 Nature America, Inc. All rights reserved.","accessed":{"date-parts":[[2022,3,21]]},"author":[{"family":"Packer","given":"Adam M."},{"family":"Roska","given":"Botond"},{"family":"Häuser","given":"Michael"}],"citation-key":"packer13","container-title":"Nature Neuroscience","DOI":"10.1038/nn.3427","ISSN":"15461726","issue":"7","issued":{"date-parts":[[2013,6,25]]},"page":"805-815","PMID":"23799473","publisher":"Nature Publishing Group","title":"Targeting neurons and photons for optogenetics","type":"article-journal","URL":"https://www.nature.com/articles/nn.3427","volume":"16"},
  {"id":"parasuram16","abstract":"Local Field Potentials (LFPs) are population signals generated by complex spatiotemporal interaction of current sources and dipoles. Mathematical computations of LFPs allow the study of circuit functions and dysfunctions via simulations. This paper introduces LFPsim, a NEURON-based tool for computing population LFP activity and single neuron extracellular potentials. LFPsim was developed to be used on existing cable compartmental neuron and network models. Point source, line source, and RC based filter approximations can be used to compute extracellular activity. As a demonstration of efficient implementation, we showcase LFPs from mathematical models of electrotonically compact cerebellum granule neurons and morphologically complex neurons of the neocortical column. LFPsim reproduced neocortical LFP at 8, 32, and 56 Hz via current injection, in vitro post-synaptic N2a, N2b waves and in vivo T-C waves in cerebellum granular layer. LFPsim also includes a simulation of multi-electrode array of LFPs in network populations to aid computational inference between biophysical activity in neural networks and corresponding multi-unit activity resulting in extracellular and evoked LFP signals.","accessed":{"date-parts":[[2021,11,17]]},"author":[{"family":"Parasuram","given":"Harilal"},{"family":"Nair","given":"Bipin"},{"family":"D’Angelo","given":"Egidio"},{"family":"Hines","given":"Michael"},{"family":"Naldi","given":"Giovanni"},{"family":"Diwakar","given":"Shyam"}],"citation-key":"parasuram16","container-title":"Frontiers in Computational Neuroscience","DOI":"10.3389/fncom.2016.00065","ISSN":"16625188","issue":"Jun","issued":{"date-parts":[[2016,6,28]]},"page":"65","publisher":"Frontiers Research Foundation","title":"Computational modeling of single neuron extracellular electric potentials and network local field potentials using LFPsim","type":"article-journal","volume":"10"},
  {"id":"pettersen12","author":[{"family":"Pettersen","given":"Klas H"},{"family":"Lindén","given":"Henrik"},{"family":"Dale","given":"Anders M"},{"family":"Einevoll","given":"Gaute T"}],"citation-key":"pettersen12","container-title":"Handbook of neural activity measurement","issued":{"date-parts":[[2012]]},"page":"92-135","publisher":"Cambridge University Press Cambridge, UK","title":"Extracellular spikes and CSD","type":"article-journal","volume":"1"},
  {"id":"potter14","accessed":{"date-parts":[[2021,10,5]]},"author":[{"family":"Potter","given":"Steve M."},{"family":"El Hady","given":"Ahmed"},{"family":"Fetz","given":"Eberhard E."}],"citation-key":"potter14","container-title":"Frontiers in Neural Circuits","DOI":"10.3389/FNCIR.2014.00115","ISSN":"1662-5110","issued":{"date-parts":[[2014]]},"page":"115","publisher":"Frontiers","title":"Closed-loop neuroscience and neuroengineering","type":"article-journal","volume":"0"},
  {"id":"prignano19","abstract":"Channelrhodopsins are light-activated ion channels that enable targetable activation or inhibition of excitable cells with light. Ion conductance can generally be described by a four step photocycle, which includes two open and two closed states. While a complete understanding of channelrhodopsin function cannot be understood in the absence of kinetic modeling, model fitting requires manual fitting, which is laborious and technically complicated for non-experts. To enhance analysis of photocurrent data, this manuscript describes a fitting program where electrophysiology data can be automatically and quantitatively analyzed. Significant improvement in this program when compared to our previous version includes 1) the ability to automatically find the experiment start time using the derivative of the current signal, 2) utilizing the Object Oriented Programing (OPP) paradigm which is significantly more reliable if the code is used by people with little to no programming experience and 3) the distribution of the code is simplified to sharing a single MATLAB file, including rigorous comments throughout. To demonstrate the utility of this program, we show automated fitting of photocurrents from two member proteins: channelrhodopsin-2 and a chimera between channelrhodopsin-1 and channelrhodopsin-2 (C1C2).","accessed":{"date-parts":[[2022,3,14]]},"author":[{"family":"Prignano","given":"Lindsey"},{"family":"Faal","given":"Siamak G."},{"family":"Hera","given":"Adriana"},{"family":"Dempski","given":"Robert E."}],"citation-key":"prignano19","container-title":"Analytical Biochemistry","DOI":"10.1016/j.ab.2018.11.023","ISSN":"10960309","issued":{"date-parts":[[2019,2,1]]},"page":"160-167","PMID":"30502319","publisher":"Academic Press","title":"An optimized and automated approach to quantifying channelrhodopsin photocurrent kinetics","type":"article-journal","volume":"566"},
  {"id":"rajendran21","abstract":"One of the main challenges in computational modeling of neurons is to reconstruct the realistic behavior of the neurons of the brain under different functional conditions. At the same time, simulation of large networks is time-consuming and requires huge computational power. The use of spiking neuron models could reduce the computational cost and time. In this study, the extracellular potentials were reconstructed from a single point neuron model of cerebellum granule neuron, and local field potentials (LFP) were modeled. Realistic reconstruction of cerebellum Crus II evoked post-synaptic local field potentials using simple models of granule neurons help to explore emergent behavior attributing patterns of information flow in the granule layer of the cerebellum. The modeling suggests that the evoked extracellular action potential (EAP) arises from the transmembrane currents correlating spiking activity and conductive properties of the extracellular medium to the LFP. The computation study reproduces experimentally observed in vitro N2a and N2b evoked LFP waves and can be used to test the scaling of models developed from a bottom-up approach.","accessed":{"date-parts":[[2021,10,28]]},"author":[{"family":"Rajendran","given":"Arathi"},{"family":"Sargurunathan","given":"Naveen Kumar"},{"family":"Menon","given":"Varadha Sasi"},{"family":"Variyath","given":"Sneha"},{"family":"Sai","given":"Satram Dayamai"},{"family":"Diwakar","given":"Shyam"}],"citation-key":"rajendran21","container-title":"Lecture Notes in Electrical Engineering","DOI":"10.1007/978-981-33-6987-0_1","ISBN":"978-981-336-986-3","ISSN":"18761119","issued":{"date-parts":[[2021]]},"page":"3-13","publisher":"Springer, Singapore","title":"Computational Reconstructions of Extracellular Action Potentials and Local Field Potentials of a Rat Cerebellum Using Point Neurons","type":"paper-conference","URL":"https://link.springer.com/chapter/10.1007/978-981-33-6987-0_1","volume":"736 LNEE"},
  {"id":"ramot22","abstract":"Having established that spontaneous brain activity follows meaningful coactivation patterns and correlates with behavior, researchers have turned their attention to understanding its function and behavioral significance. We suggest closed-loop neuromodulation as a neural perturbation tool uniquely well suited for this task. Closed-loop neuromodulation has primarily been viewed as an interventionist tool to teach subjects to directly control their own brain activity. We examine an alternative operant conditioning model of closed-loop neuromodulation which, through implicit feedback, can manipulate spontaneous activity at the network level, without violating the spontaneous or endogenous nature of the signal, thereby providing a direct test of network causality.","accessed":{"date-parts":[[2022,3,16]]},"author":[{"family":"Ramot","given":"Michal"},{"family":"Martin","given":"Alex"}],"citation-key":"ramot22","container-title":"Trends in Cognitive Sciences","DOI":"10.1016/j.tics.2022.01.008","ISSN":"1879307X","issue":"4","issued":{"date-parts":[[2022,4,1]]},"page":"290-299","PMID":"35210175","publisher":"Elsevier","title":"Closed-loop neuromodulation for studying spontaneous activity and causality","type":"article-journal","URL":"http://www.cell.com/article/S1364661322000237/fulltext","volume":"26"},
  {"id":"reimann13","abstract":"Brain activity generates extracellular voltage fluctuations recorded as local field potentials (LFPs). It is known that the relevant microvariables, the ionic currents across membranes, jointly generate the macrovariables, the extracellular voltage, but neither the detailed biophysical knowledge nor the required computational power have been available to model these processes. We simulated the LFP in a model of the rodent neocortical column composed of >12,000 reconstructed, multicompartmental, and spiking cortical layer 4 and 5 pyramidal neurons and basket cells, including five million dendritic and somatic compartments with voltage- and ion-dependent currents, realistic connectivity, and probabilistic AMPA, NMDA, and GABA synapses. We found that, depending on a number of factors, the LFP reflects local and cross-layer processing. Active currents dominate the generation of LFPs, not synaptic ones. Spike-related currents impact the LFP not only at higher frequencies but below 50Hz. This work calls for re-evaluating the genesis of LFPs","accessed":{"date-parts":[[2021,5,11]]},"author":[{"family":"Reimann","given":"Michael W."},{"family":"Anastassiou","given":"Costas A."},{"family":"Perin","given":"Rodrigo"},{"family":"Hill","given":"Sean L."},{"family":"Markram","given":"Henry"},{"family":"Koch","given":"Christof"}],"citation-key":"reimann13","container-title":"Neuron","DOI":"10.1016/j.neuron.2013.05.023","ISSN":"08966273","issue":"2","issued":{"date-parts":[[2013,7,24]]},"page":"375-390","PMID":"23889937","publisher":"Elsevier","title":"A biophysically detailed model of neocortical local field potentials predicts the critical role of active membrane currents","type":"article-journal","URL":"http://dx.","volume":"79"},
  {"id":"riemenschneider19","abstract":"Purpose: A partial image reconstruction formalism is introduced for the targeted extraction of real-time feedback from arbitrary trajectories when full image reconstruction in real time is computationally too demanding. Methods: Explicit calculation and storage of linear combinations of lines of the reconstruction matrix by an incomplete basis change in spatial coordinates lead to translation of the expensive full reconstruction from a frame-wise application to a region of interest (ROI)-wise application. This step is independent from signal data and can be executed before the experiment. Subsequently, the results of the sum over fully reconstructed voxels can be evaluated directly. Data from a high-speed fMRI acquisition was used to investigate the targeted partial reconstruction of a functional ROI atlas, incorporating an intravolume dephasing correction. The same data and ROIs were used for a comparison of the time series obtained with those obtained from already existing methods for compartment-wise reconstruction. To examine real-time feasibility, the reconstruction was implemented and tested for online reconstruction performance. Results: The reconstruction yields results that are virtually identical to the standard reconstruction (i.e., the magnitude sums over the ROIs), with negligible discrepancies even after termination of the conjugate gradient algorithm at a feasible number of iterations. Notably, more discrepancies arise with existing compartment-wise reconstructions. The online real-time implementation evaluated 1 ROI within 2.8 ms in the case of a highly parallel 3D whole brain acquisition. Conclusion: The high reconstruction fidelity and speed are satisfying for the exemplary application of real-time functional feedback using a highly parallel 3D whole brain acquisition.","accessed":{"date-parts":[[2022,3,16]]},"author":[{"family":"Riemenschneider","given":"Bruno"},{"family":"LeVan","given":"Pierre"},{"family":"Hennig","given":"Jürgen"}],"citation-key":"riemenschneider19","container-title":"Magnetic Resonance in Medicine","DOI":"10.1002/mrm.27478","ISSN":"15222594","issue":"2","issued":{"date-parts":[[2019,2,1]]},"page":"1118-1129","PMID":"30230016","publisher":"John Wiley & Sons, Ltd","title":"Targeted partial reconstruction for real-time fMRI with arbitrary trajectories","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/full/10.1002/mrm.27478","volume":"81"},
  {"id":"roth16","abstract":"To understand brain function, it is essential that we discover how cellular signaling specifies normal and pathological brain function. In this regard, chemogenetic technologies represent valuable platforms for manipulating neuronal and non-neuronal signal transduction in a cell-type-specific fashion in freely moving animals. Designer Receptors Exclusively Activated by Designer Drugs (DREADD)-based chemogenetic tools are now commonly used by neuroscientists to identify the circuitry and cellular signals that specify behavior, perceptions, emotions, innate drives, and motor functions in species ranging from flies to nonhuman primates. Here I provide a primer on DREADDs highlighting key technical and conceptual considerations and identify challenges for chemogenetics going forward.","accessed":{"date-parts":[[2022,9,7]]},"author":[{"family":"Roth","given":"Bryan L."}],"citation-key":"roth16","container-title":"Neuron","container-title-short":"Neuron","DOI":"10.1016/j.neuron.2016.01.040","ISSN":"0896-6273","issue":"4","issued":{"date-parts":[[2016,2,17]]},"language":"en","page":"683-694","source":"ScienceDirect","title":"DREADDs for Neuroscientists","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S0896627316000659","volume":"89"},
  {"id":"sabatier18","abstract":"Optogenetic activation of neurons [[1][1]] have greatly contributed to our understanding of how neural circuits operate, and holds huge promise in the field of neural prosthetics, particularly in sensory restoration. The discovery of new channelrhodopsins, Chrimson — which is 45 nm more red-shifted than any previously discovered or engineered channelrhodopsin — and its mutant ChrimsonR with faster kinetics [[2][2]] made this technology available for medical applications. However, a detailed model that would be able to accurately reproduce the membrane potential dynamics in cells transfected with ChrimsonR under light stimulation is missing. We address this issue by developing the first model for the electrochemical behavior of ChrimsonR that predicts its conductance in response to arbitrary light stimulation. Our model captures ON and OFF dynamics of the protein for stimuli with frequencies up to 100 Hz and their relationship with the brightness, as well as its activation curve, the steady-state amplitude of the response as a function of light intensity. Additionally, we capture a slow adaptation mechanism at a timescale at the order of minutes. Our model holds for light intensities covering the whole dynamic range of the channel (from response onset to saturation) and for timescales in the order of up to several minutes. This model is a new step towards modeling the spiking activity of ChrimsonR-expressing neurons, required for the precise control of information transmission in optogenetics-based Brain-Computer Interfaces, and will inform future applications of ChrimsonR based optogenetics. [1]: #ref-1 [2]: #ref-2","accessed":{"date-parts":[[2022,3,14]]},"author":[{"family":"Sabatier","given":"Quentin"},{"family":"Joffrois","given":"Corentin"},{"family":"Gauvain","given":"Grégory"},{"family":"Chavas","given":"Joël"},{"family":"Pruneau","given":"Didier"},{"family":"Picaud","given":"Serge"},{"family":"Benosman","given":"Ryad"}],"citation-key":"sabatier18","container-title":"bioRxiv","DOI":"10.1101/417899","issued":{"date-parts":[[2018,9,14]]},"page":"417899","publisher":"Cold Spring Harbor Laboratory","title":"Modeling the Electro-chemical Properties of Microbial Opsin ChrimsonR for Application to Optogenetics-based Vision Restoration","type":"article-journal","URL":"https://www.biorxiv.org/content/10.1101/417899v1"},
  {"id":"sadeh20","abstract":"Perturbation of neuronal activity is key to understanding the brain’s functional properties, however, intervention studies typically perturb neurons in a nonspecific manner. Recent optogenetics techniques have enabled patterned perturbations, in which specific patterns of activity can be invoked in identified target neurons to reveal more specific cortical function. Here, we argue that patterned perturbation of neurons is in fact necessary to reveal the specific dynamics of inhibitory stabilization, emerging in cortical networks with strong excitatory and inhibitory functional subnetworks, as recently reported in mouse visual cortex. We propose a specific perturbative signature of these networks and investigate how this can be measured under different experimental conditions. Functionally, rapid spontaneous transitions between selective ensembles of neurons emerge in such networks, consistent with experimental results. Our study outlines the dynamical and functional properties of feature-specific inhibitory-stabilized networks, and suggests experimental protocols that can be used to detect them in the intact cortex.","accessed":{"date-parts":[[2022,3,9]]},"author":[{"family":"Sadeh","given":"Sadra"},{"family":"Clopath","given":"Claudia"}],"citation-key":"sadeh20","container-title":"eLife","DOI":"10.7554/eLife.52757","ISSN":"2050084X","issued":{"date-parts":[[2020,2,1]]},"PMID":"32073400","publisher":"eLife Sciences Publications Ltd","title":"Patterned perturbation of inhibition can reveal the dynamical structure of neural processing","type":"article-journal","volume":"9"},
  {"id":"saleem17","abstract":"Primary visual cortex exhibits two types of gamma rhythm: broadband activity in the 30–90 Hz range and a narrowband oscillation seen in mice at frequencies close to 60 Hz. We investigated the sources of the narrowband gamma oscillation, the factors modulating its strength, and its relationship to broadband gamma activity. Narrowband and broadband gamma power were uncorrelated. Increasing visual contrast had opposite effects on the two rhythms: it increased broadband activity, but suppressed the narrowband oscillation. The narrowband oscillation was strongest in layer 4 and was mediated primarily by excitatory currents entrained by the synchronous, rhythmic firing of neurons in the lateral geniculate nucleus (LGN). The power and peak frequency of the narrowband gamma oscillation increased with light intensity. Silencing the cortex optogenetically did not abolish the narrowband oscillation in either LGN firing or cortical excitatory currents, suggesting that this oscillation reflects unidirectional flow of signals from thalamus to cortex.","accessed":{"date-parts":[[2022,3,21]]},"author":[{"family":"Saleem","given":"Aman B."},{"family":"Lien","given":"Anthony D."},{"family":"Krumin","given":"Michael"},{"family":"Haider","given":"Bilal"},{"family":"Rosón","given":"Miroslav Román"},{"family":"Ayaz","given":"Asli"},{"family":"Reinhold","given":"Kimberly"},{"family":"Busse","given":"Laura"},{"family":"Carandini","given":"Matteo"},{"family":"Harris","given":"Kenneth D."},{"family":"Carandini","given":"Matteo"}],"citation-key":"saleem17","container-title":"Neuron","DOI":"10.1016/j.neuron.2016.12.028","ISSN":"10974199","issue":"2","issued":{"date-parts":[[2017,1,18]]},"page":"315-322","PMID":"28103479","publisher":"Cell Press","title":"Subcortical Source and Modulation of the Narrowband Gamma Oscillation in Mouse Visual Cortex","type":"article-journal","volume":"93"},
  {"id":"sani21a","abstract":"Neural activity exhibits complex dynamics related to various brain functions, internal states and behaviors. Understanding how neural dynamics explain specific measured behaviors requires dissociating behaviorally relevant and irrelevant dynamics, which is not achieved with current neural dynamic models as they are learned without considering behavior. We develop preferential subspace identification (PSID), which is an algorithm that models neural activity while dissociating and prioritizing its behaviorally relevant dynamics. Modeling data in two monkeys performing three-dimensional reach and grasp tasks, PSID revealed that the behaviorally relevant dynamics are significantly lower-dimensional than otherwise implied. Moreover, PSID discovered distinct rotational dynamics that were more predictive of behavior. Furthermore, PSID more accurately learned behaviorally relevant dynamics for each joint and recording channel. Finally, modeling data in two monkeys performing saccades demonstrated the generalization of PSID across behaviors, brain regions and neural signal types. PSID provides a general new tool to reveal behaviorally relevant neural dynamics that can otherwise go unnoticed.","author":[{"family":"Sani","given":"Omid G"},{"family":"Abbaspourazad","given":"Hamidreza"},{"family":"Wong","given":"Yan T"},{"family":"Pesaran","given":"Bijan"},{"family":"Shanechi","given":"Maryam M"}],"citation-key":"sani21a","container-title":"Nature Neuroscience","DOI":"10.1038/s41593-020-00733-0","ISSN":"15461726","issue":"1","issued":{"date-parts":[[2021]]},"page":"140-149","PMID":"33169030","publisher":"Springer US","title":"Modeling behaviorally relevant neural dynamics enabled by preferential subspace identification","type":"article-journal","URL":"http://dx.doi.org/10.1038/s41593-020-00733-0","volume":"24"},
  {"id":"sanzleon13","abstract":"We present TheVirtualBrain (TVB), a neuroinformatics platform for full brain network simulations using biologically realistic connectivity. This simulation environment enables the model-based inference of neurophysiological mechanisms across different brain scales that underlie the generation of macroscopic neuroimaging signals including functional MRI (fMRI), EEG and MEG. Researchers from different backgrounds can benefit from an integrative software platform including a supporting framework for data management (generation, organization, storage, integration and sharing) and a simulation core written in Python. TVB allows the reproduction and evaluation of personalized configurations of the brain by using individual subject data. This personalization facilitates an exploration of the consequences of pathological changes in the system, permitting to investigate potential ways to counteract such unfavorable processes. The architecture of TVB supports interaction with MATLAB packages, for example, the well known Brain Connectivity Toolbox. TVB can be used in a client-server configuration, such that it can be remotely accessed through the Internet thanks to its web-based HTML5, JS and WebGL graphical user interface. TVB is also accessible as a standalone cross-platform Python library and application, and users can interact with the scientific core through the scripting interface IDLE, enabling easy modeling, development and debugging of the scientific kernel. This second interface makes TVB extensible by combining it with other libraries and modules developed by the Python scientific community. In this article, we describe the theoretical background and foundations that led to the development of TVB, the architecture and features of its major software components as well as potential neuroscience applications. © 2013 Sanz_leon, Knock, Woodman, Domide, Mersmann, Mcintosh and Jirsa.","accessed":{"date-parts":[[2022,8,25]]},"author":[{"family":"Sanzleon","given":"Paula"},{"family":"Knock","given":"Stuart A."},{"family":"Woodman","given":"M. Marmaduke"},{"family":"Domide","given":"Lia"},{"family":"Mersmann","given":"Jochen"},{"family":"Mcintosh","given":"Anthony R."},{"family":"Jirsa","given":"Viktor"}],"citation-key":"sanzleon13","container-title":"Frontiers in Neuroinformatics","DOI":"10.3389/fninf.2013.00010","ISSN":"16625196","issue":"MAY","issued":{"date-parts":[[2013,6,11]]},"page":"10","publisher":"Frontiers Media S.A.","title":"The virtual brain: A simulator of primate brain network dynamics","type":"article-journal","volume":"7"},
  {"id":"saran18","abstract":"© 2018 Society of Photo-Optical Instrumentation Engineers (SPIE). A detailed theoretical analysis of low-power, fast optogenetic control of firing of Chronos-expressing neurons has been presented. A three-state model for the Chronos photocycle has been formulated and incorporated in a fast-spiking interneuron circuit model. The effect of excitation wavelength, pulse irradiance, pulse width, and pulse frequency has been studied in detail and compared with ChR2. Theoretical simulations are in excellent agreement with recently reported experimental results and bring out additional interesting features. At very low irradiances (0.005 mW/mm2), the plateau current in Chronos exhibits a maximum. At 0.05 mW/mm2, the plateau current is 2 orders of magnitude smaller and saturates at longer pulse widths (∼700 ms) compared to ChR2 (∼350 ms). Ipeak in Chronos saturates at much shorter pulse widths (1775 pA at 1.5 ms and 5 mW/mm2) than in ChR2. Spiking fidelity is also higher at lower irradiances and longer pulse widths compared to ChR2. Chronos exhibits an average maximal driven rate of over 200 spikes/s in response to 100 pulses/s stimuli, each of 1-ms pulse-width, in the intensity range 0 to 200 mW/mm2. The analysis is important to not only understand the photodynamics of Chronos and Chronos-expressing neurons but also to design opsins with optimized properties and perform precision experiments with required spatiotemporal resolution.","accessed":{"date-parts":[[2022,3,14]]},"author":[{"family":"Saran","given":"Sant"},{"family":"Gupta","given":"Neha"},{"family":"Roy","given":"Sukhdev"}],"citation-key":"saran18","container-title":"Neurophotonics","DOI":"10.1117/1.nph.5.2.025009","ISSN":"23294248","issue":"02","issued":{"date-parts":[[2018,5,24]]},"page":"1","publisher":"SPIE","title":"Theoretical analysis of low-power fast optogenetic control of firing of Chronos-expressing neurons","type":"article-journal","URL":"https://www.spiedigitallibrary.org/journals/neurophotonics/volume-5/issue-2/025009/Theoretical-analysis-of-low-power-fast-optogenetic-control-of-firing/10.1117/1.NPh.5.2.025009.full","volume":"5"},
  {"id":"scheffer20","abstract":"The neural circuits responsible for animal behavior remain largely unknown. We summarize new methods and present the circuitry of a large fraction of the brain of the fruit fly Drosophila melanogaster. Improved methods include new procedures to prepare, image, align, segment, find synapses in, and proofread such large data sets. We define cell types, refine computational compartments, and provide an exhaustive atlas of cell examples and types, many of them novel. We provide detailed circuits consisting of neurons and their chemical synapses for most of the central brain. We make the data public and simplify access, reducing the effort needed to answer circuit questions, and provide procedures linking the neurons defined by our analysis with genetic reagents. Biologically, we examine distributions of connection strengths, neural motifs on different scales, electrical consequences of compartmentalization, and evidence that maximizing packing density is an important criterion in the evolution of the fly’s brain.","accessed":{"date-parts":[[2022,9,7]]},"author":[{"family":"Scheffer","given":"Louis K"},{"family":"Xu","given":"C Shan"},{"family":"Januszewski","given":"Michal"},{"family":"Lu","given":"Zhiyuan"},{"family":"Takemura","given":"Shin-ya"},{"family":"Hayworth","given":"Kenneth J"},{"family":"Huang","given":"Gary B"},{"family":"Shinomiya","given":"Kazunori"},{"family":"Maitlin-Shepard","given":"Jeremy"},{"family":"Berg","given":"Stuart"},{"family":"Clements","given":"Jody"},{"family":"Hubbard","given":"Philip M"},{"family":"Katz","given":"William T"},{"family":"Umayam","given":"Lowell"},{"family":"Zhao","given":"Ting"},{"family":"Ackerman","given":"David"},{"family":"Blakely","given":"Tim"},{"family":"Bogovic","given":"John"},{"family":"Dolafi","given":"Tom"},{"family":"Kainmueller","given":"Dagmar"},{"family":"Kawase","given":"Takashi"},{"family":"Khairy","given":"Khaled A"},{"family":"Leavitt","given":"Laramie"},{"family":"Li","given":"Peter H"},{"family":"Lindsey","given":"Larry"},{"family":"Neubarth","given":"Nicole"},{"family":"Olbris","given":"Donald J"},{"family":"Otsuna","given":"Hideo"},{"family":"Trautman","given":"Eric T"},{"family":"Ito","given":"Masayoshi"},{"family":"Bates","given":"Alexander S"},{"family":"Goldammer","given":"Jens"},{"family":"Wolff","given":"Tanya"},{"family":"Svirskas","given":"Robert"},{"family":"Schlegel","given":"Philipp"},{"family":"Neace","given":"Erika"},{"family":"Knecht","given":"Christopher J"},{"family":"Alvarado","given":"Chelsea X"},{"family":"Bailey","given":"Dennis A"},{"family":"Ballinger","given":"Samantha"},{"family":"Borycz","given":"Jolanta A"},{"family":"Canino","given":"Brandon S"},{"family":"Cheatham","given":"Natasha"},{"family":"Cook","given":"Michael"},{"family":"Dreher","given":"Marisa"},{"family":"Duclos","given":"Octave"},{"family":"Eubanks","given":"Bryon"},{"family":"Fairbanks","given":"Kelli"},{"family":"Finley","given":"Samantha"},{"family":"Forknall","given":"Nora"},{"family":"Francis","given":"Audrey"},{"family":"Hopkins","given":"Gary Patrick"},{"family":"Joyce","given":"Emily M"},{"family":"Kim","given":"SungJin"},{"family":"Kirk","given":"Nicole A"},{"family":"Kovalyak","given":"Julie"},{"family":"Lauchie","given":"Shirley A"},{"family":"Lohff","given":"Alanna"},{"family":"Maldonado","given":"Charli"},{"family":"Manley","given":"Emily A"},{"family":"McLin","given":"Sari"},{"family":"Mooney","given":"Caroline"},{"family":"Ndama","given":"Miatta"},{"family":"Ogundeyi","given":"Omotara"},{"family":"Okeoma","given":"Nneoma"},{"family":"Ordish","given":"Christopher"},{"family":"Padilla","given":"Nicholas"},{"family":"Patrick","given":"Christopher M"},{"family":"Paterson","given":"Tyler"},{"family":"Phillips","given":"Elliott E"},{"family":"Phillips","given":"Emily M"},{"family":"Rampally","given":"Neha"},{"family":"Ribeiro","given":"Caitlin"},{"family":"Robertson","given":"Madelaine K"},{"family":"Rymer","given":"Jon Thomson"},{"family":"Ryan","given":"Sean M"},{"family":"Sammons","given":"Megan"},{"family":"Scott","given":"Anne K"},{"family":"Scott","given":"Ashley L"},{"family":"Shinomiya","given":"Aya"},{"family":"Smith","given":"Claire"},{"family":"Smith","given":"Kelsey"},{"family":"Smith","given":"Natalie L"},{"family":"Sobeski","given":"Margaret A"},{"family":"Suleiman","given":"Alia"},{"family":"Swift","given":"Jackie"},{"family":"Takemura","given":"Satoko"},{"family":"Talebi","given":"Iris"},{"family":"Tarnogorska","given":"Dorota"},{"family":"Tenshaw","given":"Emily"},{"family":"Tokhi","given":"Temour"},{"family":"Walsh","given":"John J"},{"family":"Yang","given":"Tansy"},{"family":"Horne","given":"Jane Anne"},{"family":"Li","given":"Feng"},{"family":"Parekh","given":"Ruchi"},{"family":"Rivlin","given":"Patricia K"},{"family":"Jayaraman","given":"Vivek"},{"family":"Costa","given":"Marta"},{"family":"Jefferis","given":"Gregory SXE"},{"family":"Ito","given":"Kei"},{"family":"Saalfeld","given":"Stephan"},{"family":"George","given":"Reed"},{"family":"Meinertzhagen","given":"Ian A"},{"family":"Rubin","given":"Gerald M"},{"family":"Hess","given":"Harald F"},{"family":"Jain","given":"Viren"},{"family":"Plaza","given":"Stephen M"}],"citation-key":"scheffer20","container-title":"eLife","DOI":"10.7554/eLife.57443","editor":[{"family":"Marder","given":"Eve"},{"family":"Eisen","given":"Michael B"},{"family":"Pipkin","given":"Jason"},{"family":"Doe","given":"Chris Q"}],"ISSN":"2050-084X","issued":{"date-parts":[[2020,9,3]]},"page":"e57443","publisher":"eLife Sciences Publications, Ltd","source":"eLife","title":"A connectome and analysis of the adult Drosophila central brain","type":"article-journal","URL":"https://doi.org/10.7554/eLife.57443","volume":"9"},
  {"id":"schneider22","abstract":"Mapping behavioral actions to neural activity is a fundamental goal of neuroscience. As our ability to record large neural and behavioral data increases, there is growing interest in modeling neural dynamics during adaptive behaviors to probe neural representations. In particular, neural latent embeddings can reveal underlying correlates of behavior, yet, we lack non-linear techniques that can explicitly and flexibly leverage joint behavior and neural data. Here, we fill this gap with a novel method, CEBRA, that jointly uses behavioral and neural data in a hypothesis- or discovery-driven manner to produce consistent, high-performance latent spaces. We validate its accuracy and demonstrate our tool's utility for both calcium and electrophysiology datasets, across sensory and motor tasks, and in simple or complex behaviors across species. It allows for single and multi-session datasets to be leveraged for hypothesis testing or can be used label-free. Lastly, we show that CEBRA can be used for the mapping of space, uncovering complex kinematic features, and rapid, high-accuracy decoding of natural movies from visual cortex.","accessed":{"date-parts":[[2022,9,7]]},"author":[{"family":"Schneider","given":"Steffen"},{"family":"Lee","given":"Jin Hwa"},{"family":"Mathis","given":"Mackenzie Weygandt"}],"citation-key":"schneider22","DOI":"10.48550/arXiv.2204.00673","issued":{"date-parts":[[2022,4,1]]},"number":"arXiv:2204.00673","publisher":"arXiv","source":"arXiv.org","title":"Learnable latent embeddings for joint behavioral and neural analysis","type":"article","URL":"http://arxiv.org/abs/2204.00673"},
  {"id":"siegle17","abstract":"Objective. Closed-loop experiments, in which causal interventions are conditioned on the state of the system under investigation, have become increasingly common in neuroscience. Such experiments can have a high degree of explanatory power, but they require a precise implementation that can be difficult to replicate across laboratories. We sought to overcome this limitation by building open-source software that makes it easier to develop and share algorithms for closed-loop control. Approach. We created the Open Ephys GUI, an open-source platform for multichannel electrophysiology experiments. In addition to the standard ‘open-loop’ visualization and recording functionality, the GUI also includes modules for delivering feedback in response to events detected in the incoming data stream. Importantly, these modules can be built and shared as plugins, which makes it possible for users to extend the functionality of the GUI through a simple API, without having to understand the inner workings of the entire application. Main results. In combination with low-cost, open-source hardware for amplifying and digitizing neural signals, the GUI has been used for closed-loop experiments that perturb the hippocampal theta rhythm in a phase-specific manner. Significance. The Open Ephys GUI is the first widely used application for multichannel electrophysiology that leverages a plugin-based workflow. We hope that it will lower the barrier to entry for electrophysiologists who wish to incorporate real-time feedback into their research.","accessed":{"date-parts":[[2022,9,7]]},"author":[{"family":"Siegle","given":"Joshua H."},{"family":"López","given":"Aarón Cuevas"},{"family":"Patel","given":"Yogi A."},{"family":"Abramov","given":"Kirill"},{"family":"Ohayon","given":"Shay"},{"family":"Voigts","given":"Jakob"}],"citation-key":"siegle17","container-title":"Journal of Neural Engineering","container-title-short":"J. Neural Eng.","DOI":"10.1088/1741-2552/aa5eea","ISSN":"1741-2552","issue":"4","issued":{"date-parts":[[2017,6]]},"language":"en","page":"045003","publisher":"IOP Publishing","source":"Institute of Physics","title":"Open Ephys: an open-source, plugin-based platform for multichannel electrophysiology","title-short":"Open Ephys","type":"article-journal","URL":"https://doi.org/10.1088/1741-2552/aa5eea","volume":"14"},
  {"id":"sorger20","abstract":"Brain-computer interfaces (BCIs) based on functional magnetic resonance imaging (fMRI) provide an important complement to other noninvasive BCIs. While fMRI has several disadvantages (being nonportable, methodologically challenging, costly, and noisy), it is the only method providing high spatial resolution whole-brain coverage of brain activation. These properties allow relating mental activities to specific brain regions and networks providing a transparent scheme for BCI users to encode information and for real-time fMRI BCI systems to decode the intents of the user. Various mental activities have been used successfully in fMRI BCIs so far that can be classified into the four categories: (a) higher-order cognitive tasks (e.g., mental calculation), (b) covert language-related tasks (e.g., mental speech and mental singing), (c) imagery tasks (motor, visual, auditory, tactile, and emotion imagery), and (d) selective attention tasks (visual, auditory, and tactile attention). While the ultimate spatial and temporal resolution of fMRI BCIs is limited by the physiologic properties of the hemodynamic response, technical and analytical advances will likely lead to substantially improved fMRI BCIs in the future using, for example, decoding of imagined letter shapes at 7 T as the basis for more “natural” communication BCIs.","accessed":{"date-parts":[[2022,3,16]]},"author":[{"family":"Sorger","given":"Bettina"},{"family":"Goebel","given":"Rainer"}],"citation-key":"sorger20","container-title":"Handbook of Clinical Neurology","DOI":"10.1016/B978-0-444-63934-9.00021-4","ISSN":"22124152","issued":{"date-parts":[[2020,1,1]]},"page":"289-302","PMID":"32164860","publisher":"Elsevier","title":"Real-time fMRI for brain-computer interfacing","type":"chapter","volume":"168"},
  {"id":"sporns18","abstract":"Network neuroscience is a thriving and rapidly expanding field. Empirical data on brain networks, from molecular to behavioral scales, are ever increasing in size and complexity. These developments lead to a strong demand for appropriate tools and methods that model and analyze brain network data, such as those provided by graph theory. This brief review surveys some of the most commonly used and neurobiologically insightful graph measures and techniques. Among these, the detection of network communities or modules, and the identification of central network elements that facilitate communication and signal transfer, are particularly salient. A number of emerging trends are the growing use of generative models, dynamic (time-varying) and multilayer networks, as well as the application of algebraic topology. Overall, graph theory methods are centrally important to understanding the architecture, development, and evolution of brain networks.","accessed":{"date-parts":[[2022,9,7]]},"author":[{"family":"Sporns","given":"Olaf"}],"citation-key":"sporns18","container-title":"Dialogues in Clinical Neuroscience","DOI":"10.31887/DCNS.2018.20.2/osporns","ISSN":"null","issue":"2","issued":{"date-parts":[[2018,6,30]]},"note":"_eprint: https://doi.org/10.31887/DCNS.2018.20.2/osporns","page":"111-121","PMID":"30250388","publisher":"Taylor & Francis","source":"Taylor and Francis+NEJM","title":"Graph theory methods: applications in brain networks","title-short":"Graph theory methods","type":"article-journal","URL":"https://doi.org/10.31887/DCNS.2018.20.2/osporns","volume":"20"},
  {"id":"sridharan22","abstract":"The biophysical properties of existing optogenetic tools constrain the scale, speed, and fidelity of precise optogenetic control. Here, we use structure-guided mutagenesis to engineer opsins that exhibit very high potency while retaining fast kinetics. These new opsins enable large-scale, temporally and spatially precise control of population neural activity. We extensively benchmark these new opsins against existing optogenetic tools and provide a detailed biophysical characterization of a diverse family of opsins under two-photon illumination. This establishes a resource for matching the optimal opsin to the goals and constraints of patterned optogenetics experiments. Finally, by combining these new opsins with optimized procedures for holographic photostimulation, we demonstrate the simultaneous coactivation of several hundred spatially defined neurons with a single hologram and nearly double that number by temporally interleaving holograms at fast rates. These newly engineered opsins substantially extend the capabilities of patterned illumination optogenetic paradigms for addressing neural circuits and behavior.","accessed":{"date-parts":[[2022,3,16]]},"author":[{"family":"Sridharan","given":"Savitha"},{"family":"Gajowa","given":"Marta A."},{"family":"Ogando","given":"Mora B."},{"family":"Jagadisan","given":"Uday K."},{"family":"Abdeladim","given":"Lamiae"},{"family":"Sadahiro","given":"Masato"},{"family":"Bounds","given":"Hayley A."},{"family":"Hendricks","given":"William D."},{"family":"Turney","given":"Toby S."},{"family":"Tayler","given":"Ian"},{"family":"Gopakumar","given":"Karthika"},{"family":"Oldenburg","given":"Ian Antón"},{"family":"Brohawn","given":"Stephen G."},{"family":"Adesnik","given":"Hillel"}],"citation-key":"sridharan22","container-title":"Neuron","DOI":"10.1016/j.neuron.2022.01.008","ISSN":"10974199","issue":"7","issued":{"date-parts":[[2022,2]]},"page":"1139-1155.e6","PMID":"35120626","publisher":"Elsevier BV","title":"High-performance microbial opsins for spatially and temporally precise perturbations of large neuronal networks","type":"article-journal","URL":"http://www.cell.com/article/S0896627322000083/fulltext","volume":"110"},
  {"id":"steinmetz21","abstract":"Measuring the dynamics of neural processing across time scales requires following the spiking of thousands of individual neurons over milliseconds and months. To address this need, we introduce the Neuropixels 2.0 probe together with newly designed analysis algorithms. The probe has more than 5000 sites and is miniaturized to facilitate chronic implants in small mammals and recording during unrestrained behavior. High-quality recordings over long time scales were reliably obtained in mice and rats in six laboratories. Improved site density and arrangement combined with newly created data processing methods enable automatic post hoc correction for brain movements, allowing recording from the same neurons for more than 2 months. These probes and algorithms enable stable recordings from thousands of sites during free behavior, even in small animals such as mice.","accessed":{"date-parts":[[2022,9,7]]},"author":[{"family":"Steinmetz","given":"Nicholas A."},{"family":"Aydin","given":"Cagatay"},{"family":"Lebedeva","given":"Anna"},{"family":"Okun","given":"Michael"},{"family":"Pachitariu","given":"Marius"},{"family":"Bauza","given":"Marius"},{"family":"Beau","given":"Maxime"},{"family":"Bhagat","given":"Jai"},{"family":"Böhm","given":"Claudia"},{"family":"Broux","given":"Martijn"},{"family":"Chen","given":"Susu"},{"family":"Colonell","given":"Jennifer"},{"family":"Gardner","given":"Richard J."},{"family":"Karsh","given":"Bill"},{"family":"Kloosterman","given":"Fabian"},{"family":"Kostadinov","given":"Dimitar"},{"family":"Mora-Lopez","given":"Carolina"},{"family":"O’Callaghan","given":"John"},{"family":"Park","given":"Junchol"},{"family":"Putzeys","given":"Jan"},{"family":"Sauerbrei","given":"Britton"},{"family":"Daal","given":"Rik J.J.","non-dropping-particle":"van"},{"family":"Vollan","given":"Abraham Z."},{"family":"Wang","given":"Shiwei"},{"family":"Welkenhuysen","given":"Marleen"},{"family":"Ye","given":"Zhiwen"},{"family":"Dudman","given":"Joshua T."},{"family":"Dutta","given":"Barundeb"},{"family":"Hantman","given":"Adam W."},{"family":"Harris","given":"Kenneth D."},{"family":"Lee","given":"Albert K."},{"family":"Moser","given":"Edvard I."},{"family":"O’Keefe","given":"John"},{"family":"Renart","given":"Alfonso"},{"family":"Svoboda","given":"Karel"},{"family":"Häusser","given":"Michael"},{"family":"Haesler","given":"Sebastian"},{"family":"Carandini","given":"Matteo"},{"family":"Harris","given":"Timothy D."}],"citation-key":"steinmetz21","container-title":"Science","DOI":"10.1126/science.abf4588","ISSN":"10959203","issue":"6539","issued":{"date-parts":[[2021,4,16]]},"PMID":"33859006","publisher":"American Association for the Advancement of Science","title":"Neuropixels 2.0: A miniaturized high-density probe for stable, long-term brain recordings","type":"article-journal","URL":"https://www.science.org/doi/10.1126/science.abf4588","volume":"372"},
  {"id":"stringer21","abstract":"Individual neurons in visual cortex provide the brain with unreliable estimates of visual features. It is not known whether the single-neuron variability is correlated across large neural populations, thus impairing the global encoding of stimuli. We recorded simultaneously from up to 50,000 neurons in mouse primary visual cortex (V1) and in higher order visual areas and measured stimulus discrimination thresholds of 0.35° and 0.37°, respectively, in an orientation decoding task. These neural thresholds were almost 100 times smaller than the behavioral discrimination thresholds reported in mice. This discrepancy could not be explained by stimulus properties or arousal states. Furthermore, behavioral variability during a sensory discrimination task could not be explained by neural variability in V1. Instead, behavior-related neural activity arose dynamically across a network of non-sensory brain areas. These results imply that perceptual discrimination in mice is limited by downstream decoders, not by neural noise in sensory representations.","accessed":{"date-parts":[[2022,3,3]]},"author":[{"family":"Stringer","given":"Carsen"},{"family":"Michaelos","given":"Michalis"},{"family":"Tsyboulski","given":"Dmitri"},{"family":"Lindo","given":"Sarah E."},{"family":"Pachitariu","given":"Marius"}],"citation-key":"stringer21","container-title":"Cell","DOI":"10.1016/j.cell.2021.03.042","ISSN":"10974172","issue":"10","issued":{"date-parts":[[2021,5,13]]},"page":"2767-2778.e15","PMID":"33857423","publisher":"Cell Press","title":"High-precision coding in visual cortex","type":"article-journal","volume":"184"},
  {"id":"stujenske15","abstract":"Despite the increasing use of optogenetics invivo, the effects of direct light exposure to brain tissue are understudied. Of particular concern is the potential for heat induced by prolonged optical stimulation. We demonstrate that high-intensity light, delivered through an optical fiber, is capable of elevating firing rate locally, even in the absence of opsin expression. Predicting the severity and spatial extent of any temperature increase during optogenetic stimulation is therefore of considerable importance. Here, we describe a realistic model that simulates light and heat propagation during optogenetic experiments. We validated the model by comparing predicted and measured temperature changes invivo. We further demonstrate the utility of this model by comparing predictions for various wavelengths of light and fiber sizes, as well as testing methods for reducing heat effects on neural targets invivo.","accessed":{"date-parts":[[2020,9,10]]},"author":[{"family":"Stujenske","given":"Joseph M."},{"family":"Spellman","given":"Timothy"},{"family":"Gordon","given":"Joshua A."}],"citation-key":"stujenske15","container-title":"Cell Reports","DOI":"10.1016/j.celrep.2015.06.036","ISSN":"22111247","issue":"3","issued":{"date-parts":[[2015,7,21]]},"page":"525-534","PMID":"26166563","publisher":"Elsevier","title":"Modeling the Spatiotemporal Dynamics of Light and Heat Propagation for InVivo Optogenetics","type":"article-journal","volume":"12"},
  {"id":"svoboda06","abstract":"The brain is complex and dynamic. The spatial scales of interest to the neurobiologist range from individual synapses (∼1 μm) to neural circuits (centimeters); the timescales range from the flickering of channels (less than a millisecond) to long-term memory (years). Remarkably, fluorescence microscopy has the potential to revolutionize research on all of these spatial and temporal scales. Two-photon excitation (2PE) laser scanning microscopy allows high-resolution and high-sensitivity fluorescence microscopy in intact neural tissue, which is hostile to traditional forms of microscopy. Over the last 10 years, applications of 2PE, including microscopy and photostimulation, have contributed to our understanding of a broad array of neurobiological phenomena, including the dynamics of single channels in individual synapses and the functional organization of cortical maps. Here we review the principles of 2PE microscopy, highlight recent applications, discuss its limitations, and point to areas for future research and development.","accessed":{"date-parts":[[2022,9,7]]},"author":[{"family":"Svoboda","given":"Karel"},{"family":"Yasuda","given":"Ryohei"}],"citation-key":"svoboda06","container-title":"Neuron","container-title-short":"Neuron","DOI":"10.1016/j.neuron.2006.05.019","ISSN":"0896-6273","issue":"6","issued":{"date-parts":[[2006,6,15]]},"language":"en","page":"823-839","source":"ScienceDirect","title":"Principles of Two-Photon Excitation Microscopy and Its Applications to Neuroscience","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S0896627306004119","volume":"50"},
  {"id":"telenczuk20","abstract":"Background: The local field potential (LFP) is usually calculated from current sources arising from transmembrane currents, in particular in asymmetric cellular morphologies such as pyramidal neurons. New method: Here, we adopt a different point of view and relate the spiking of neurons to the LFP through efferent synaptic connections and provide a method to calculate LFPs. Results: We show that the so-called unitary LFPs (uLFP) provide the key to such a calculation. We show experimental measurements and simulations of uLFPs in neocortex and hippocampus, for both excitatory and inhibitory neurons. We fit a “kernel” function to measurements of uLFPs, and we estimate its spatial and temporal spread by using simulations of morphologically detailed reconstructions of hippocampal pyramidal neurons. Assuming that LFPs are the sum of uLFPs generated by every neuron in the network, the LFP generated by excitatory and inhibitory neurons can be calculated by convolving the trains of action potentials with the kernels estimated from uLFPs. This provides a method to calculate the LFP from networks of spiking neurons, even for point neurons for which the LFP is not easily defined. We show examples of LFPs calculated from networks of point neurons and compare to the LFP calculated from synaptic currents. Conclusions: The kernel-based method provides a practical way to calculate LFPs from networks of point neurons.","accessed":{"date-parts":[[2021,10,28]]},"author":[{"family":"Telenczuk","given":"Bartosz"},{"family":"Telenczuk","given":"Maria"},{"family":"Destexhe","given":"Alain"}],"citation-key":"telenczuk20","container-title":"Journal of Neuroscience Methods","DOI":"10.1016/j.jneumeth.2020.108871","ISSN":"1872678X","issued":{"date-parts":[[2020,10,1]]},"page":"108871","PMID":"32687850","publisher":"Elsevier","title":"A kernel-based method to calculate local field potentials from networks of spiking neurons","type":"article-journal","volume":"344"},
  {"id":"thornton19","abstract":"Neuronal circuits can be modelled in detail allowing us to predict the effects of stimulation on individual neurons. Electrical stimulation of neuronal circuits in vitro and in vivo excites a range of neurons within the tissue and measurements of neural activity, e.g the local field potential (LFP), are again an aggregate of a large pool of cells. The previous version of our Virtual Electrode Recording Tool for EXtracellular Potentials (VERTEX) allowed for the simulation of the LFP generated by a patch of brain tissue. Here, we extend VERTEX to simulate the effect of electrical stimulation through a focal electric field. We observe both direct changes in neural activity and changes in synaptic plasticity. Testing our software in a model of a rat neocortical slice, we determine the currents contributing to the LFP, the effects of paired pulse stimulation to induce short term plasticity (STP), and the effect of theta burst stimulation (TBS) to induce long term potentiation (LTP).","accessed":{"date-parts":[[2021,5,14]]},"author":[{"family":"Thornton","given":"Christopher"},{"family":"Hutchings","given":"Frances"},{"family":"Kaiser","given":"Marcus"}],"citation-key":"thornton19","container-title":"Wellcome Open Research","DOI":"10.12688/wellcomeopenres.15058.1","ISSN":"2398502X","issued":{"date-parts":[[2019]]},"publisher":"F1000 Research Ltd","title":"The virtual electrode recording tool for extracellular potentials (VERTEX) Version 2.0: Modelling in vitro electrical stimulation of brain tissue","type":"article-journal","URL":"/pmc/articles/PMC6439485.1/","volume":"4"},
  {"id":"tomsett15","abstract":"Local field potentials (LFPs) sampled with extracellular electrodes are frequently used as a measure of population neuronal activity. However, relating such measurements to underlying neuronal behaviour and connectivity is non-trivial. To help study this link, we developed the Virtual Electrode Recording Tool for EXtracellular potentials (VERTEX). We first identified a reduced neuron model that retained the spatial and frequency filtering characteristics of extracellular potentials from neocortical neurons. We then developed VERTEX as an easy-to-use Matlab tool for simulating LFPs from large populations (>100,000 neurons). A VERTEX-based simulation successfully reproduced features of the LFPs from an in vitro multi-electrode array recording of macaque neocortical tissue. Our model, with virtual electrodes placed anywhere in 3D, allows direct comparisons with the in vitro recording setup. We envisage that VERTEX will stimulate experimentalists, clinicians, and computational neuroscientists to use models to understand the mechanisms underlying measured brain dynamics in health and disease.","accessed":{"date-parts":[[2022,3,10]]},"author":[{"family":"Tomsett","given":"Richard J."},{"family":"Ainsworth","given":"Matt"},{"family":"Thiele","given":"Alexander"},{"family":"Sanayei","given":"Mehdi"},{"family":"Chen","given":"Xing"},{"family":"Gieselmann","given":"Marc A."},{"family":"Whittington","given":"Miles A."},{"family":"Cunningham","given":"Mark O."},{"family":"Kaiser","given":"Marcus"}],"citation-key":"tomsett15","container-title":"Brain Structure and Function","DOI":"10.1007/s00429-014-0793-x","ISSN":"18632661","issue":"4","issued":{"date-parts":[[2015,7,27]]},"page":"2333-2353","PMID":"24863422","publisher":"Springer Verlag","title":"Virtual Electrode Recording Tool for EXtracellular potentials (VERTEX): comparing multi-electrode recordings from simulated and biological mammalian cortical tissue","type":"article-journal","URL":"https://link.springer.com/article/10.1007/s00429-014-0793-x","volume":"220"},
  {"id":"tran20","abstract":"Simulating extracellular recordings of neuronal populations is an important and challenging task both for understanding the nature and relationships between extracellular field potentials at different scales, and for the validation of methodological tools for signal analysis such as spike detection and sorting algorithms. Detailed neuronal multicompartmental models with active or passive compartments are commonly used in this objective. Although using such realistic NEURON models could lead to realistic extracellular potentials, it may require a high computational burden making the simulation of large populations difficult without a workstation. We propose in this paper a novel method to simulate extracellular potentials of firing neurons, taking into account the NEURON geometry and the relative positions of the electrodes. The simulator takes the form of a linear geometry based filter that models the shape of an action potential by taking into account its generation in the cell body / axon hillock and its propagation along the axon. The validity of the approach for different NEURON morphologies is assessed. We demonstrate that our method is able to reproduce realistic extracellular action potentials in a given range of axon/dendrites surface ratio, with a time-efficient computational burden.","accessed":{"date-parts":[[2021,10,28]]},"author":[{"family":"Tran","given":"Harry"},{"family":"Ranta","given":"Radu"},{"family":"Le Cam","given":"Steven"},{"family":"Louis-Dorr","given":"Valérie"}],"citation-key":"tran20","container-title":"Journal of Computational Neuroscience","DOI":"10.1007/s10827-019-00735-3","ISSN":"15736873","issue":"1","issued":{"date-parts":[[2020,1,17]]},"page":"27-46","PMID":"31953614","publisher":"Springer","title":"Fast simulation of extracellular action potential signatures based on a morphological filtering approximation","type":"article-journal","URL":"https://link.springer.com/article/10.1007/s10827-019-00735-3","volume":"48"},
  {"id":"vierock21","abstract":"Optogenetic manipulation of neuronal activity through excitatory and inhibitory opsins has become an indispensable experimental strategy in neuroscience research. For many applications bidirectional control of neuronal activity allowing both excitation and inhibition of the same neurons in a single experiment is desired. This requires low spectral overlap between the excitatory and inhibitory opsin, matched photocurrent amplitudes and a fixed expression ratio. Moreover, independent activation of two distinct neuronal populations with different optogenetic actuators is still challenging due to blue-light sensitivity of all opsins. Here we report BiPOLES, an optogenetic tool for potent neuronal excitation and inhibition with light of two different wavelengths. BiPOLES enables sensitive, reliable dual-color neuronal spiking and silencing with single- or two-photon excitation, optical tuning of the membrane voltage, and independent optogenetic control of two neuronal populations using a second, blue-light sensitive opsin. The utility of BiPOLES is demonstrated in worms, flies, mice and ferrets.","accessed":{"date-parts":[[2022,3,15]]},"author":[{"family":"Vierock","given":"Johannes"},{"family":"Rodriguez-Rozada","given":"Silvia"},{"family":"Dieter","given":"Alexander"},{"family":"Pieper","given":"Florian"},{"family":"Sims","given":"Ruth"},{"family":"Tenedini","given":"Federico"},{"family":"Bergs","given":"Amelie C.F."},{"family":"Bendifallah","given":"Imane"},{"family":"Zhou","given":"Fangmin"},{"family":"Zeitzschel","given":"Nadja"},{"family":"Ahlbeck","given":"Joachim"},{"family":"Augustin","given":"Sandra"},{"family":"Sauter","given":"Kathrin"},{"family":"Papagiakoumou","given":"Eirini"},{"family":"Gottschalk","given":"Alexander"},{"family":"Soba","given":"Peter"},{"family":"Emiliani","given":"Valentina"},{"family":"Engel","given":"Andreas K."},{"family":"Hegemann","given":"Peter"},{"family":"Wiegert","given":"J. Simon"}],"citation-key":"vierock21","container-title":"Nature Communications","DOI":"10.1038/s41467-021-24759-5","ISSN":"20411723","issue":"1","issued":{"date-parts":[[2021,7,26]]},"page":"1-20","PMID":"34312384","publisher":"Nature Publishing Group","title":"BiPOLES is an optogenetic tool developed for bidirectional dual-color control of neurons","type":"article-journal","URL":"https://www.nature.com/articles/s41467-021-24759-5","volume":"12"},
  {"id":"vila19","abstract":"Objective. Optogenetics provides a means to probe functional connections between brain areas. By activating a set of presynaptic neurons and recording the activity from a downstream brain area, one can establish the sign and strength of a feedforward connection. One challenge is that there are virtually limitless patterns that can be used to stimulate a presynaptic brain area. Functional influences on downstream brain areas can depend not just on whether presynaptic neurons were activated, but how they were activated. Corticofugal axons from the auditory cortex (ACtx) heavily innervate the auditory tectum, the inferior colliculus (IC). Here, we sought to determine whether different modes of corticocollicular activation could titrate the strength of feedforward modulation of sound processing in IC neurons. Approach. We used multi-channel electrophysiology and optogenetics to record from multiple regions of the IC in awake head-fixed mice while optogenetically stimulating ACtx neurons expressing Chronos, an ultra-fast channelrhodopsin. To identify cortical activation patterns associated with the strongest effects on IC firing rates, we employed a closed-loop evolutionary optimization procedure that tailored the voltage command signal sent to the laser based on spike feedback from single IC neurons. Main results. Within minutes, our evolutionary search procedure converged on ACtx stimulation configurations that produced more effective and widespread enhancement of IC unit activity than generic activation parameters. Cortical modulation of midbrain spiking was bi-directional, as the evolutionary search procedure could be programmed to converge on activation patterns that either suppressed or enhanced sound-evoked IC firing rate. Significance. This study introduces a closed-loop optimization procedure to probe functional connections between brain areas. Our findings demonstrate that the influence of descending feedback projections on subcortical sensory processing can vary both in sign and degree depending on how cortical neurons are activated in time.","accessed":{"date-parts":[[2022,3,9]]},"author":[{"family":"Vila","given":"Charles Henri"},{"family":"Williamson","given":"Ross S."},{"family":"Hancock","given":"Kenneth E."},{"family":"Polley","given":"Daniel B."}],"citation-key":"vila19","container-title":"Journal of Neural Engineering","DOI":"10.1088/1741-2552/ab39cf","ISSN":"17412552","issue":"6","issued":{"date-parts":[[2019,10,29]]},"page":"066023","PMID":"31394519","publisher":"IOP Publishing","title":"Optimizing optogenetic stimulation protocols in auditory corticofugal neurons based on closed-loop spike feedback","type":"article-journal","URL":"https://iopscience.iop.org/article/10.1088/1741-2552/ab39cf","volume":"16"},
  {"id":"viswam19","abstract":"Advances in microfabrication technology have enabled the production of devices containing arrays of thousands of closely spaced recording electrodes, which afford subcellular resolution of electrical signals in neurons and neuronal networks. Rationalizing the electrode size and configuration in such arrays demands consideration of application-specific requirements and inherent features of the electrodes. Tradeoffs among size, spatial density, sensitivity, noise, attenuation, and other factors are inevitable. Although recording extracellular signals from neurons with planar metal electrodes is fairly well established, the effects of the electrode characteristics on the quality and utility of recorded signals, especially for small, densely packed electrodes, have yet to be fully characterized. Here, we present a combined experimental and computational approach to elucidating how electrode size, and size-dependent parameters, such as impedance, baseline noise, and transmission characteristics, influence recorded neuronal signals. Using arrays containing platinum electrodes of different sizes, we experimentally evaluated the electrode performance in the recording of local field potentials (LFPs) and extracellular action potentials (EAPs) from the following cell preparations: acute brain slices, dissociated cell cultures, and organotypic slice cultures. Moreover, we simulated the potential spatial decay of point-current sources to investigate signal averaging using known signal sources. We demonstrated that the noise and signal attenuation depend more on the electrode impedance than on electrode size, per se, especially for electrodes <10 μm in width or diameter to achieve high-spatial-resolution readout. By minimizing electrode impedance of small electrodes (<10 μm) via surface modification, we could maximize the signal-to-noise ratio to electrically visualize the propagation of axonal EAPs and to isolate single-unit spikes. Due to the large amplitude of LFP signals, recording quality was high and nearly independent of electrode size. These findings should be of value in configuring in vitro and in vivo microelectrode arrays for extracellular recordings with high spatial resolution in various applications.","accessed":{"date-parts":[[2022,3,11]]},"author":[{"family":"Viswam","given":"Vijay"},{"family":"Obien","given":"Marie Engelene J."},{"family":"Franke","given":"Felix"},{"family":"Frey","given":"Urs"},{"family":"Hierlemann","given":"Andreas"}],"citation-key":"viswam19","container-title":"Frontiers in Neuroscience","DOI":"10.3389/fnins.2019.00385","ISSN":"1662453X","issue":"APR","issued":{"date-parts":[[2019]]},"page":"385","publisher":"Frontiers Media S.A.","title":"Optimal electrode size for multi-scale extracellular-potential recording from neuronal assemblies","type":"article-journal","volume":"13"},
  {"id":"wang15","abstract":"Deciphering neuronal circuitry is central to understanding brain function and dysfunction, yet it remains a daunting task. To facilitate the dissection of neuronal circuits, a process requiring functional analysis of synaptic connections and morphological identification of interconnected neurons, we present here a method for stable simultaneous octuple patch-clamp recordings. This method allows physiological analysis of synaptic interconnections among 4-8 simultaneously recorded neurons and/or 10-30 sequentially recorded neurons, and it allows anatomical identification of >85% of recorded interneurons and >99% of recorded principal neurons. We describe how to apply the method to rodent tissue slices; however, it can be used on other model organisms. We also describe the latest refinements and optimizations of mechanics, electronics, optics and software programs that are central to the realization of a combined single- and two-photon microscopy-based, optogenetics- and imaging-assisted, stable, simultaneous quadruple-viguple patch-clamp recording system. Setting up the system, from the beginning of instrument assembly and software installation to full operation, can be completed in 3-4 d.","accessed":{"date-parts":[[2022,3,16]]},"author":[{"family":"Wang","given":"Guangfu"},{"family":"Wyskiel","given":"Daniel R."},{"family":"Yang","given":"Weiguo"},{"family":"Wang","given":"Yiqing"},{"family":"Milbern","given":"Lana C."},{"family":"Lalanne","given":"Txomin"},{"family":"Jiang","given":"Xiaolong"},{"family":"Shen","given":"Ying"},{"family":"Sun","given":"Qian Quan"},{"family":"Zhu","given":"J. Julius"}],"citation-key":"wang15","container-title":"Nature Protocols","DOI":"10.1038/nprot.2015.019","ISSN":"17502799","issue":"3","issued":{"date-parts":[[2015,2,5]]},"page":"397-412","PMID":"25654757","publisher":"Nature Publishing Group","title":"An optogenetics- and imaging-assisted simultaneous multiple patch-clamp recording system for decoding complex neural circuits","type":"article-journal","URL":"https://www.nature.com/articles/nprot.2015.019","volume":"10"},
  {"id":"wiegert17","abstract":"Reversible silencing of neuronal activity is a powerful approach for isolating the roles of specific neuronal populations in circuit dynamics and behavior. In contrast with neuronal excitation, for which the majority of studies have used a limited number of optogenetic and chemogenetic tools, the number of genetically encoded tools used for inhibition of neuronal activity has vastly expanded. Silencing strategies vary widely in their mechanism of action and in their spatial and temporal scales. Although such manipulations are commonly applied, the design and interpretation of neuronal silencing experiments present unique challenges, both technically and conceptually. Here, we review the most commonly used tools for silencing neuronal activity and provide an in-depth analysis of their mechanism of action and utility for particular experimental applications. We further discuss the considerations that need to be given to experimental design, analysis, and interpretation of collected data. Finally, we discuss future directions for the development of new silencing approaches in neuroscience. Optogenetic and chemogenetic tools for neuronal silencing have become indispensable in modern neuroscience research. In this review, Wiegert et al. describe some of the most commonly used genetically encoded tools for silencing of neural activity, highlighting their unique features and major constraints.","accessed":{"date-parts":[[2020,9,10]]},"author":[{"family":"Wiegert","given":"J Simon"},{"family":"Mahn","given":"Mathias"},{"family":"Prigge","given":"Matthias"},{"family":"Printz","given":"Yoav"},{"family":"Yizhar","given":"Ofer"}],"citation-key":"wiegert17","container-title":"Neuron","DOI":"10.1016/j.neuron.2017.06.050","ISSN":"10974199","issue":"3","issued":{"date-parts":[[2017]]},"page":"504-529","PMID":"28772120","title":"Silencing Neurons: Tools, Applications, and Experimental Constraints","type":"article-journal","URL":"http://dx.doi.org/10.1016/j.neuron.2017.06.050","volume":"95"},
  {"id":"witt13","abstract":"Dynamic oscillatory coherence is believed to play a central role in flexible communication between brain circuits. To test this communication-through-coherence hypothesis, experimental protocols that allow a reliable control of phase-relations between neuronal populations are needed. In this modeling study, we explore the potential of closed-loop optogenetic stimulation for the control of functional interactions mediated by oscillatory coherence. The theory of non-linear oscillators predicts that the efficacy of local stimulation will depend not only on the stimulation intensity but also on its timing relative to the ongoing oscillation in the target area. Induced phase-shifts are expected to be stronger when the stimulation is applied within specific narrow phase intervals. Conversely, stimulations with the same or even stronger intensity are less effective when timed randomly. Stimulation should thus be properly phased with respect to ongoing oscillations (in order to optimally perturb them) and the timing of the stimulation onset must be determined by a real-time phase analysis of simultaneously recorded local field potentials (LFPs). Here, we introduce an electrophysiologically calibrated model of Channelrhodopsin 2 (ChR2)-induced photocurrents, based on fits holding over two decades of light intensity. Through simulations of a neural population which undergoes coherent gamma oscillations-either spontaneously or as an effect of continuous optogenetic driving-we show that precisely-timed photostimulation pulses can be used to shift the phase of oscillation, even at transduction rates smaller than 25%. We consider then a canonic circuit with two inter-connected neural populations oscillating with gamma frequency in a phase-locked manner. We demonstrate that photostimulation pulses applied locally to a single population can induce, if precisely phased, a lasting reorganization of the phase-locking pattern and hence modify functional interactions between the two populations.","author":[{"family":"Witt","given":"Annette"},{"family":"Palmigiano","given":"Agostina"},{"family":"Neef","given":"Andreas"},{"family":"El Hady","given":"Ahmed"},{"family":"Wolf","given":"Fred"},{"family":"Battaglia","given":"Demian"}],"citation-key":"witt13","container-title":"Frontiers in Neural Circuits","DOI":"10.3389/fncir.2013.00049","ISBN":"1662-5110 (Electronic)\\n1662-5110 (Linking)","ISSN":"1662-5110","issue":"April","issued":{"date-parts":[[2013]]},"page":"1-17","PMID":"23616748","title":"Controlling the oscillation phase through precisely timed closed-loop optogenetic stimulation: a computational study","type":"article-journal","URL":"http://journal.frontiersin.org/article/10.3389/fncir.2013.00049/abstract","volume":"7"},
  {"id":"wu20a","abstract":"Understanding information processing in the brain requires monitoring neuronal activity at high spatiotemporal resolution. Using an ultrafast two-photon fluorescence microscope empowered by all-optical laser scanning, we imaged neuronal activity in vivo at up to 3,000 frames per second and submicrometer spatial resolution. This imaging method enabled monitoring of both supra- and subthreshold electrical activity down to 345 μm below the brain surface in head-fixed awake mice.","accessed":{"date-parts":[[2022,3,9]]},"author":[{"family":"Wu","given":"Jianglai"},{"family":"Liang","given":"Yajie"},{"family":"Chen","given":"Shuo"},{"family":"Hsu","given":"Ching Lung"},{"family":"Chavarha","given":"Mariya"},{"family":"Evans","given":"Stephen W."},{"family":"Shi","given":"Dongqing"},{"family":"Lin","given":"Michael Z."},{"family":"Tsia","given":"Kevin K."},{"family":"Ji","given":"Na"}],"citation-key":"wu20a","container-title":"Nature Methods","DOI":"10.1038/s41592-020-0762-7","ISSN":"15487105","issue":"3","issued":{"date-parts":[[2020,3,2]]},"page":"287-290","PMID":"32123392","publisher":"Nature Publishing Group","title":"Kilohertz two-photon fluorescence microscopy imaging of neural activity in vivo","type":"article-journal","URL":"https://www.nature.com/articles/s41592-020-0762-7","volume":"17"},
  {"id":"yang20","abstract":"The closed-loop brain stimulation technique plays a key role in neural network information processing and therapies of neurological diseases. Transcranial ultrasound stimulation (TUS) is an established neuromodulation method for the neural oscillation in animals or human. All available TUS systems provide brain stimulation in an open-loop pattern. In this study, we developed a closed-loop transcranial ultrasound stimulation (CLTUS) system for real-time non-invasive neuromodulation in vivo. We used the CLTUS system to modulate the neural activities of the hippocampus of a wild-type mouse based on the phase of the theta rhythm recorded at the ultrasound-targeted location. In addition, we modulated the hippocampus of a temporal lobe epilepsy (TLE) mouse. The ultrasound stimulation increased the absolute power and reduced the relative power of the theta rhythm, which were independent of the specific phase of the theta rhythm. Compared with those of a sham stimulation, the latency of epileptic seizures was significantly increased, while the epileptic seizure duration was significantly decreased under the CLTUS. The above results indicate that the CLTUS can be used to not only modulate the neural oscillation through the theta-phase-specific manipulation of the hippocampus but also effectively inhibit the seizure of a TLE mouse in time. CLTUS has large application potentials for the understanding of the causal relationship of neural circuits as well as for timely, effective, and non-invasive therapies of neurological diseases such as epilepsy and Parkinson’s disease.","accessed":{"date-parts":[[2022,3,9]]},"author":[{"family":"Yang","given":"Huifang"},{"family":"Yuan","given":"Yi"},{"family":"Wang","given":"Xingran"},{"family":"Li","given":"Xin"}],"citation-key":"yang20","container-title":"Frontiers in Neuroscience","DOI":"10.3389/fnins.2020.00445","ISSN":"1662453X","issued":{"date-parts":[[2020,5,12]]},"page":"445","publisher":"Frontiers Media S.A.","title":"Closed-Loop Transcranial Ultrasound Stimulation for Real-Time Non-invasive Neuromodulation in vivo","type":"article-journal","volume":"14"},
  {"id":"yang21","abstract":"Direct electrical stimulation can modulate the activity of brain networks for the treatment of several neurological and neuropsychiatric disorders and for restoring lost function. However, precise neuromodulation in an individual requires the accurate modelling and prediction of the effects of stimulation on the activity of their large-scale brain networks. Here, we report the development of dynamic input–output models that predict multiregional dynamics of brain networks in response to temporally varying patterns of ongoing microstimulation. In experiments with two awake rhesus macaques, we show that the activities of brain networks are modulated by changes in both stimulation amplitude and frequency, that they exhibit damping and oscillatory response dynamics, and that variabilities in prediction accuracy and in estimated response strength across brain regions can be explained by an at-rest functional connectivity measure computed without stimulation. Input–output models of brain dynamics may enable precise neuromodulation for the treatment of disease and facilitate the investigation of the functional organization of large-scale brain networks.","accessed":{"date-parts":[[2021,4,27]]},"author":[{"family":"Yang","given":"Yuxiao"},{"family":"Qiao","given":"Shaoyu"},{"family":"Sani","given":"Omid G."},{"family":"Sedillo","given":"J. Isaac"},{"family":"Ferrentino","given":"Breonna"},{"family":"Pesaran","given":"Bijan"},{"family":"Shanechi","given":"Maryam M."}],"citation-key":"yang21","container-title":"Nature Biomedical Engineering","DOI":"10.1038/s41551-020-00666-w","ISSN":"2157846X","issue":"4","issued":{"date-parts":[[2021,2,1]]},"page":"324-345","PMID":"33526909","publisher":"Nature Research","title":"Modelling and prediction of the dynamic responses of large-scale brain networks during direct electrical stimulation","type":"article-journal","URL":"https://doi.org/10.1038/s41551-020-00666-w","volume":"5"},
  {"id":"zhang18","abstract":"Understanding the causal relationship between neural activity and behavior requires the ability to perform rapid and targeted interventions in ongoing activity. Here we describe a closed-loop all-optical strategy for dynamically controlling neuronal activity patterns in awake mice. We rapidly tailored and delivered two-photon optogenetic stimulation based on online readout of activity using simultaneous two-photon imaging, thus enabling the manipulation of neural circuit activity ‘on the fly’ during behavior.","accessed":{"date-parts":[[2020,9,8]]},"author":[{"family":"Zhang","given":"Zihui"},{"family":"Russell","given":"Lloyd E."},{"family":"Packer","given":"Adam M."},{"family":"Gauld","given":"Oliver M."},{"family":"Häusser","given":"Michael"}],"citation-key":"zhang18","container-title":"Nature Methods","DOI":"10.1038/s41592-018-0183-z","ISSN":"15487105","issue":"12","issued":{"date-parts":[[2018,12,1]]},"page":"1037-1040","PMID":"30420686","publisher":"Nature Publishing Group","title":"Closed-loop all-optical interrogation of neural circuits in vivo","type":"article-journal","URL":"https://doi.org/10.1038/s41592-018-0183-z","volume":"15"},
  {"id":"zotero-4215","accessed":{"date-parts":[[2022,3,14]]},"citation-key":"zotero-4215","title":"2P optogenetics : simulation and modeling for optimized thermal dissipation and current integration - TEL - Thèses en ligne","type":"webpage","URL":"https://tel.archives-ouvertes.fr/tel-02469061/"},
  {"id":"zotero-4372","accessed":{"date-parts":[[2022,9,7]]},"citation-key":"zotero-4372","title":"New neural activity patterns emerge with long-term learning | PNAS","type":"webpage","URL":"https://www.pnas.org/doi/full/10.1073/pnas.1820296116"}
]
